[
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/75871-systemarkitekt-inom-ai-bi/",
    "roles": [
      "System Architect"
    ],
    "places": [
      "Sundsvall"
    ],
    "description": "Uppdragsbeskrivning För kunds räkning söker vi en Systemarkitekt med expertis inom AI/BI. Uppdraget innebär att leda modernisering och utveckling av system med starkt fokus på AI, BI och säkerhet. Rollbeskrivning: Designa och modernisera system med fokus på AI och BI, inklusive mikro-tjänster och Kafka-lösningar. Migrera äldre Cobol-system till modern Java- och Linux-plattform med stöd av AI/BI. Utveckla lösningar för BI och AI, skapa datastrategier och arkitektur för analyser och affärsbeslut. Samarbeta med utvecklingsteam och myndigheter för att säkerställa att systemlösningarna uppfyller både tekniska och affärsmässiga mål. Säkerställa säkerhet och kvalitet genom DevSecOps och agila metoder. Ge tekniskt stöd och beslutsunderlag till ledningen och driva strategiska IT-frågor. Huvudsakliga arbetsuppgifter/Skall-krav: Du ska ha tidigare erfarenhet inom liknande roll, arbetat som systemarkitekt och systemförnyelse. Du ska ha goda kunskaper inom följande tekniker: BI i GrossSQL, Oracle, Sas verktygen. Jira. Python, Linux, Jenkins, ETL, Kubernetes. Du ska kunna ta fram dokumentation och förslag till realisering i form av lösningsarkitektur, både i text och i modeller. Du ska kunna ta fram lösningsmönster för att arbeta med micro-services(API:er) och Kafta- lösningar samt BIaaS(SaaS-BI as a Service koncept). Nära kopplat till AI. Du ska kunna ta fram lösningsmönster för att arbeta med i första hand BI samt till BI stöd för AI med mönster, tränande, arkitektur, datastrategier och datarutinunderlag. Du ska kunna presentera lösningsarkitektur på ett tydligt sätt så att utvecklingsteam, it-styrning, verksamhet och att i vissa fall andra myndigheter förstår och kan agera och implementera korrekt. Du ska kunna samarbeta med andra myndigheter i BI frågor-Teknikstöd och normalisering. Även AI. Du ska kunna arbeta med vår kunds datamanagement för utveckling av AI- och maskininlärningsmodeller. Du ska kunna föreslå, skapa beslutsunderlag samt införa samt förvalta BI- plattformarna och verktygen. Övriga arbetsuppgifter/ Bör-krav: Stöd för ledningsgrupperingar och bistå med framtagande av underlag för välgrundade beslut. Ta fram arkitekturella modeller och lösningar som främjar DEVSECOPS. Driva och förbättra myndighetssamarbetet med hjälp av optimeringar av processer och arkitekturella principer. Hantera strategiska frågeställningar angående hur IT-stödets lösningsarkitektur BI(och AI) ska möta verksamhetens målbild och strategier. Ta fram lösningsmönster för att arbeta med micro-services(API:er) samt Kafta- lösningar. Jobba med säkerhet och säkerhetsställa vår kunds målarkitektur. I vår kunds systemförnyelse ingår att: Kartlägga befintligt Systemstöd i Cobol som migrerats från Unisys stordatorplattform till Linuxbaserad plattform om AI kan lösa vissa delfunktioner samt koppling till BI för uppföljning och analys. Identifiera och föreslå hur befintliga Cobolprogram skall ersättas med nya IT- komponenter som skall implementeras på en Linux- och java baserad plattform enligt vår kunds målarkitektur mot AI/BI stöd. Styra och hjälpa utvecklingsteamen som implementerar IT-lösningen som ersätter Befintlig IT-lösning i BI(och AI). Arbetssätt Agilt, iterativt och värdeskapande med SAFe som agilt ramverk och inspiration. Uppdragsleda/delprojektleda för flera team Agilt med fokus på problemlösning inom arkitektur Arkitektmodeller och vara uppdragsledare inom migreringsprojekt av IT-lösningar i Cobol på olika stordatorplattformar till Java- och Linuxbaserade plattformar ur ett BI inriktad teknik. Styra val av BI för analys och lagring. Sätta och styra via it-arkitektstyrning och områdesarkitektur på Operativ, taktisk och strategisk nivå"
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/75667-4-x-devops-engineers/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Brande",
      "Remote",
      "Skovlunde"
    ],
    "description": "Assignment Description We are looking for 4 DevOps Engineers on behalf of our client. These roles will involve the automation of infrastructure hardware platforms, specifically focusing on server and network component orchestration. Responsibilities include automating the installation and configuration processes, as well as utilizing infrastructure automation tools like Ansible and Chef. The position is primarily remote, with 1-2 days on-site at the customers locations in Skovlunde or Brande bi-weekly. You will be tasked with automating various elements of servers and auxiliary hardware components within the infrastructure platform. This includes developing and maintaining automation scripts in PowerShell or Bash to streamline server and network orchestration. Using tools such as Ansible, the engineers will ensure efficient infrastructure and network component management. Collaboration with development teams will be essential to guarantee the smooth automation of deployment processes. Additionally, they will document procedures, produce &#8221;documentation as code,&#8221; and develop training materials to support ongoing projects and team development. Required Qualifications: Extensive understanding of network and server hardware. Proficiency in using automation tools like Ansible (Python) or Chef. Experience with GitLab runners and container orchestration platforms such as Kubernetes. Strong emphasis on IT/OT security, along with knowledge of security standards and products. It is meritorious if you have experience with HPE Server Hardware, Eaton Products, and Meinberg Products. Certification such as CKA (Certified Kubernetes Administrator) is also an advantage. Familiarity with IT management frameworks, including ITIL, and tools like Jira will be beneficial for this role."
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/75643-backend-utvecklare-4/",
    "roles": [
      "Backendutvecklare"
    ],
    "places": [
      "Sundsvall"
    ],
    "description": "Uppdragsbeskrivning För kunds räkning söker vi nu en backend-utvecklare med inriktning Python och AI. Vår kund arbetar med agil metodik baserat på CRISP-ML-processen med kontinuerlig feedback och förbättringar. Du kommer även att arbeta i ett agilt team, där det är stort eget ansvar. Rollbeskrivning: På ett strukturerat och samarbetsinriktat sätt driva AI/ML-utvecklingen. Du kommer att arbeta med förberedelse och bearbetning av data. Natural Language Processing (NLP): Erfarenhet med språkmodeller (LLMs) och NLP för att lösa AI/ML-uppgifter. Du kommer att arbeta med testdriven och beteendedriven utveckling (TDD/BDD), Utvecklingsmetodiker där testning och beteenden står i fokus. Kvalifikationer: Du ska ha god erfarenhet av Python, då det är huvudspråket för utvecklingen, andra moderna programmerings språk kan också användas. Du ska ha kunskap inom artificiell intelligens och maskininlärning, inklusive modellutveckling, träning av modeller och byggande av pipelines. Du ska ha erfarenhet av CRISP-ML eller liknande strukturerade processer för ML-utveckling. Du ska ha erfarenhet av hantering av Continuous Integration/Continuous Deployment-processer, samt erfarenhet med Docker och Kubernetes. Du ska gärna ha erfarenhet av följande verktyg: Jira, Confluence, Airflow, JupyterLabs, MLflow Tracking, Ollama, Label studio, CUDA och Kubernetes. &nbsp; Du kommer att arbeta på plats i vår kunds lokaler i Sundsvall cirka 50% av tiden. &nbsp;"
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/75509-arkitekt-5/",
    "roles": [
      "Arkitekt"
    ],
    "places": [
      "Distans",
      "Uppsala"
    ],
    "description": "Uppdragsbeskrivning För kunds räkning söker vi nu en Arkitekt som kan hjälpa till med utveckling inom datalagring, datahantering och business intelligence. Fokus för uppdraget är att ta fram ett lösningsförslag inklusive arkitektur och lösningsmönster. Rollbeskrivning: Dela data och rapporter, internt och externt, i olika format på en data-/rapportportal. Möjliggöra användning av data från data warehouse, data lake och källsystem i data-/rapportportalen. Säkerhet och åtkomstkontroll. Insamling av data från externa källor. Skall-krav: Du ska ha erfarenhet av att designa en modern dataarkitektur inklusive business intelligence (BI). Du ska ha förmåga att dokumentera arkitektur i text och med arkitekturmodeller. Du ska ha erfarenhet av teknikerna beskrivna i uppdragsbeskrivningen/rollbeskrivningen. Bör-krav:       Du bör ha erfarenhet av att dokumentera arkitektur med Archimate. Du bör ha erfarenhet av för uppdraget relevanta tjänster i Microsoft Azure. Du bör ha erfarenhet av att arbeta med Sparx EA. Du bör ha erfarenhet av att ha arbetat med offentlig verksamhet. &nbsp; Du kommer att behöva arbeta på plats i vår kunds lokaler i Uppsala ca 20%, och arbete på distans ca 80% av tiden efter överenskommelse med vår kund."
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/75480-it-arkitekt-6/",
    "roles": [
      "IT-arkitekt"
    ],
    "places": [
      "Sundsvall"
    ],
    "description": "Uppdragsbeskrivning För kunds räkning söker vi nu en IT-Arkitekt inom webbutveckling som är självgående och drivande. Vi ser även att du har god erfarenhet och hög kompetens inom aktuella området. Rollbeskrivning: Utreda och ta fram lösningsmönster som stödjer vår kunds mål- och referensarkitektur. Dokumentera lösningsmönster. Samverka med andra IT-arkitekter och Systemutvecklare. Stötta vid val av lösningsmönster. Kvalifikationer: Du har minst 3 års erfarenhet av Javascript ramverk, såsom Angular, React eller Vue de senaste 5 åren. Du bör ha erfarenhet av att arbeta som IT-arkitekt senaste 8 åren. Du har kunskap i Java-ramverk som Springbook, med versionhantering i GIT-hub och byggprocess i Jenkins. Du har haft en ledande roll i team som avser IT-arkitektur eller systemutveckling. Du har arbetat med skalad Scrum eller motsvarande skalat agilt arbetssätt. Du har arbetat med systemutveckling och eller IT-arkitektur avseende mikrotjänster. Du kommer att arbeta på plats i vår kunds lokaler i Sundsvall, distansarbete kan medges i samråd med vår kund."
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/75364-cloud-data-engineer/",
    "roles": [
      "Cloud Engineer",
      "Data Engineer"
    ],
    "places": [
      "Poland",
      "Remote"
    ],
    "description": "Assignment Description On behalf of our client we are looking for a Cloud Data Engineer. Role Description: You will be responsible for developing and maintaining the data pipelines in our clients Snowflake based data warehouse. You will be responsible for loading and extracting data from source to target, so that your team members of bi developers can utilize the data to create Power BI reports based on it. Requirements: You have 1-3 years of experience working with Snowflake hands on, implementing SPs and UDFs. You have 10+ years of experience with Data Warehouse solutions prior to Snowflake. You are an expert in SQL. You are an expert in designing and developing ELT/ETL flows. You have good communication skills and you are organized. You are good at problem-solving and like to dig deeper into complicated matters. You are familiar with Snowflake. To be successful in this role you need to know how to check the metadata, get and read SQL and JS based object definition or where it is used. Fluency in Confluence. You have practical knowledge of git. You have advanced knowledge of Data Warehousing concepts and standard approaches. You have advanced knowledge of Data Integration concepts (streaming, batch). You have strong skills in translating business requirements to ETL solutions. You are familiar with DataStage is an avenges but not a must. You have knowledge about DS structures: sequences, jobs, etc. You have a large and extensive knowledge of how an ELT/ETL design and implementation should be designed to make it robust and scalable. &nbsp; You will be working from our clients office in Poland, either in Warsaw or Gdansk. With the possibility of remote work, after discussions with our client."
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/75133-scala-utvecklare-2/",
    "roles": [
      "Utvecklare"
    ],
    "places": [
      "Distans",
      "Lund"
    ],
    "description": "Uppdragsbeskrivning Vi söker en erfaren Scala-utvecklare som är van vid att arbeta med eventdrivna system och som har kunskap om teknologier som ElasticSearch och Cassandra. Rollen innefattar ett stort fokus på att förbättra och optimera befintliga system för att möta ökande användarantal och krav på prestanda. Vår kunds kontor ligger i Lund, med möjlighet att arbeta på distans från andra platser i Sverige. Huvudsakliga ansvarsområden: Som Scala-utvecklare kommer du att arbeta med att utveckla och optimera system för att möta ökande krav på prestanda och kapacitet. En central del av ditt arbete kommer att vara att hantera migrering av kunder för att säkerställa att systemet klarar den ökade belastningen. Du kommer även att utföra lasttester och implementera lastbalansering för att säkerställa effektivitet. För att förbättra systemets prestanda kommer du att optimera kod och omstrukturera datamodeller, samt genomföra en migrering från Elastic till SQL-baserade databaser. Dessutom kommer du att bidra till skapandet av en skalbar och robust plattform som kan möta framtida utmaningar. Obligatoriska kvalifikationer: Gedigen erfarenhet av Scala-utveckling. Erfarenhet av att genomföra lasttester och arbeta med prestandaoptimering. Meriterande kvalifikationer: Kunskap inom eventdriven arkitektur och erfarenhet av RabbitMQ. Erfarenhet av DevOps-relaterade teknologier såsom AWS/Cloud, Terraform, CloudFormation eller OpenStack. Erfarenhet av att arbeta med ElasticSearch och Cassandra för datahantering. Kunskap om att bygga och underhålla pipelines samt arbeta med infrastruktur som kod. Förmåga att bidra till plattformsarkitektur och driva utvecklingen framåt. Svenska språkkunskaper och närhet till Lund ses som en fördel, men distansarbete är möjligt. Personliga egenskaper:  Förmåga att arbeta självständigt och i team för att hitta lösningar på problem relaterade till hög belastning."
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/74683-citrix-specialist/",
    "roles": [
      "Specialist"
    ],
    "places": [
      "Hybrid",
      "Norrköping"
    ],
    "description": "Uppdragsbeskrivning För kunds räkning söker vi nu en konsult med mycket god kunskap inom Citrix XenMobile och Citrix NetScaler. Rollbeskrivning: Genomgång av den befintliga IT-miljön. Stödja säkerställning av en säker hantering av mobila enheter. Skapa ett företagsanpassat app-bibliotek, som användaren har begränsad tillgång till. Dokumentation. Utbildning av personal. Överlämning till tekniker och telefonisupport. Kvalifikationer: Du ska ha mycket god kunskap kring Citrix Xenmobile Du ska ha mycket god kunskap kring Citrix Netscaler"
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/74486-java-utvecklare-5/",
    "roles": [
      "Javautvecklare"
    ],
    "places": [
      "Sundsvall"
    ],
    "description": "Uppdragsbeskrivning För kunds räkning söker vi nu en Java utvecklare. Rollbeskrivning: Utveckling initierad av vår kunds verksamhet och deras externa kunder Ständiga förbättringar för att öka kvalitet och effektivitet. Omvärldsbevakning Att hela tiden utveckla nya sätt för att automatisera, effektivisera och säkra kvaliteten. Framtagande av enhetstester för att möjliggöra stor del av kodtäckning i arbetet. Kvalifikationer: Du ska ha tidigare erfarenhet av systemutveckling i huvudsak med inriktning mot Javautveckling (Java Spring) Du ska ha erfarenhet av arbete med applikationsservrar (framförallt Jboss) Du ska ha erfarenhet av arbete inom området iXBRL/XBRL &#8211; standarden samt utvecklande av taxonomier för ekonomisk information med inriktning på främst årsredovisning. Du ska ha erfarenhet av utveckling av systemlösningar mha reporting standard api. Meriterande krav: Du har erfarenhet av testdriven och beteendedriven utveckling (TDD/BDD) Du har tidigare erfarenhet av arbete med Micro-services (API) och vissa delar mot front-end Du har erfarenhet av continuous integration/ continuous deployment (CI/CD) och tillhörande containerhantering med delar såsom Docker och kubernetes. Tekniker: Jira, Confluence, cucumber, IBM MQ, Jenkins, Maven och Vue 3. Arbetssätt: Agilt, iterativt och värdeskapande med SAFe som agilt ramverk och inspiration Agilt team med stort eget ansvar Du kommer att arbeta på plats i kundens lokaler i Sundsvall, möjlighet till 60% distansarbete efter dialog med slutkunden."
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/74365-it-tekniker-6/",
    "roles": [
      "IT Technician"
    ],
    "places": [
      "Distans",
      "Sundsvall"
    ],
    "description": "Uppdragbeskrivning För kunds räkning söker vi nu en It-tekniker inom applikationsdrift i Windows Server OS-miljö. Arbetet inkluderar slutanvändarkontakter, leverantörskontakter och problemlösning, baserat på ITIL-ramverk. SKA-krav: Du ska ha teknisk kompetens inom Windows Server OS och erfarenhet av underhåll i Windowsmiljö. Du ska vara nivå 4, 9-12års erfarenhet. Du ska ha minst ett års erfarenhet av drift av storskalig central skanningslösning (minst 400 000 sidor/månad). Du ska ha minst tre års erfarenhet av arbete med Windows Server. Bör-krav: Du bör ha erfarenhet av ITIL-ramverk. Du kommer att behöva arbeta på plats i vår kunds lokaler minst 3 dagar i veckan."
  }
]