{
  "link_to_post": "https://upgraded.se/konsultuppdrag/69857-senior-plattformsansvarig-autentiseringstjanster-region-skane-avrop-925/",
  "place": "Lund",
  "roll_id": 185,
  "description": "Uppdragsbeskrivning: Vi söker dig med universitets- eller högskoleutbildning i kombination med en bred teknisk kompetens och lämplig arbetslivserfarenhet. Självklart har du ett särskilt intresse för katalog och autentiserings tjänster. Vi ser också att du har erfarenhet från tidigare plattformsansvar eller liknande ansvar. Meriterande är erfarenhet av olika autentiseringstjänster: IDP, ADFS, Single Sign On och federationslösningar samt grundkunskap inom e-legitimation, stark autentisering och elektronisk identitetshandling som används för säker identifiering av både personer och system. Då vi arbetar enligt ITIL4 är tidigare erfarenhet och/eller certifiering i detta också ett mervärde, tillsammans med erfarenhet från att framgångsrikt ha samordnat flera olika parter, interna såväl som externa. För framgång i arbetet vill vi att du är strukturerad och försedd med förmågan att se saker ur ett helhetsperspektiv. Genom ditt processtänk och genom att planera och prioritera löser du såväl det långsiktiga strategiska arbetet såväl som de akuta situationer som uppstår. Du gillar att förvalta en plattform och du är både nätverkande, kommunikativ, pedagogisk och förstår vikten av att kvalitetssäkra genom bl. a.  dokumentation. Det är inte du som utför de tekniska delarna av plattformen, det har du leverantörer som ansvarar för, men du leder och ser till att rutiner och processer fungerar och löser problemen när de inte gör det. Du kommer att ha dialog med olika parter som befinner sig kunskapsmässigt på olika nivåer vad gäller teknik och IT och vi värdesätter därför din kommunikativa förmåga att &#8221;prata IT&#8221; så att alla förstår. Du har förmågan att uttrycka dig väl i tal och skrift både på svenska och engelska. Du ser till att övriga Region Skåne har tillgång till tjänster inom autentisering, auktorisering, legitimering, spärr, samtycke och logg med målsättningen att åstadkomma säker åtkomst och säker hantering av information och resurser. I dialog med våra leverantörer, ansvarar du för utveckling av de berörda plattformarna samtidigt som du säkerställer att de är stabila och funktionella. Du har god kunskap kring hur digitala certifikat används, vilka som utfärdar dem och vad som händer om certifikaten inte är korrekta. Självklart jobbar du med kontinuerlig tjänsteförbättring samt vidareutvecklar tjänsterna till verksamheterna i Region Skåne. Arbetet innebär således att även hantera den långsiktiga, strategiska planeringen. Dina främsta ansvarsområden är att: planera, organisera och leda genomförandet av aktiviteter inom dina ansvarsområden. identifiera brister och ta fram nya lösningsförslag samt ansvara för att de implementeras ge stöd till projektledare och systemansvariga under och efter införande av autentiseringstjänster Du har ett tätt samarbete med såväl leverantörer som med den egna och andra förvaltningar inom Region Skåne. Administration och drift är outsourcat till vår leverantör men du kommer att ha huvudansvaret för plattformarna och det är du som ser till att processer och rutiner följs och fungerar. Då tjänsten innebär många kontaktytor är det viktigt att du gillar att vara spindeln i nätet i kommunikationen med bl a användare, leverantörer och certifikatutfärdare. Upgraded People tillsammans med Region Skåne agerar i enighet med och står bakom EUs och Sveriges sanktioner mot Ryssland och de som omfattas av dessa. Det medför att leverantörer [&hellip;]"
}