[
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70556-teamleverans-systemutvecklare-servicenow/",
    "roles": [
      "Utvecklare"
    ],
    "places": [
      "Göteborg",
      "Hybrid"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en eller flera systemutvecklare inom IT Service Management. Du kommer att förstärka ett tekniskt förvaltningsteam och arbeta med vidareutveckling och förvaltning av ITSM-plattformen ServiceNow. Uppdraget omfattar bland annat vidareutveckling av funktioner inom Hardware Asset Management (HAM) samt förvaltning av befintliga leveranser i ServiceNow. Omfattning: Den totala omfattningen är 1,5 till 2 heltidstjänster men kan delas mellan upp på tre individer. Arbetet sker delvis på plats hos kunden med minst 50 % av arbetstiden utförd på kundens kontor. Huvudsakliga ansvarsområden: Vidareutveckling av funktioner inom ServiceNow-plattformen. Livscykelhantering av IT-utrustning som PC och Chromebooks. Integrationer och stöd för andra områden som telefoner och läsplattor. Arbeta nära den tekniska förvaltningen samt andra interna team inom organisationen. Fokus på systemutveckling och förvaltning för välfärdstjänster och politiska processer. Obligatoriska kvalifikationer: ITIL version 4-certifiering. Certifiering som ServiceNow System Administrator. Minst fyra års erfarenhet av utvecklingsprojekt i ServiceNow. Erfarenhet av att arbeta i större organisationer med över 10 000 användare. Erfarenhet av ServiceNow-portaler och HAM-processer. Erfarenhet av svensk offentlig sektor inom de senaste fem åren. Meriterande kvalifikationer: Certifiering som ServiceNow Implementation Specialist. Erfarenhet av integrationer med Unifi. Personliga egenskaper: Förmåga att arbeta strukturerat med en helhetssyn och förståelse för processutveckling. Stark kommunikations- och presentationsförmåga, särskilt i samarbete mellan olika team och intressenter. God metodik och förmåga att organisera arbetsprocesser inom teamet."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70529-data-curator/",
    "roles": [
      "Analytiker"
    ],
    "places": [
      "Remote",
      "Stockholm"
    ],
    "description": [
      "Assignment Description: Our client is looking for a talented Campaign Measurement Analyst to join our team on a contract basis. In this role, you will be responsible for interpreting campaign measurement results and developing actionable recommendations that will be shared with our advertisers. Your insights will play a key role in optimizing campaign performance and driving revenue growth. Key Responsibilities: ● Analyze Campaign Data: Collect and analyze campaign performance data using both first-party (1P) and third-party (3P) measurement methodologies. Utilize internal benchmarking tools to contextualize and position campaign measurement results effectively. ● Interpret Results: Provide clear and actionable insights based on campaign measurement results, identifying the causes behind flat or underperforming metrics and providing insights which will help shape data-driven strategies. ● Develop Recommendations: Create detailed recommendations to optimize campaign effectiveness, tailored to the specific needs and goals of each advertiser. Ensure that all recommendations and insights are aligned with the Client´s Advertising’s broader goals and business needs. ● Collaborate with Teams: Work closely with Sales and partner teams to prepare and present comprehensive reports that translate complex data into understandable and impactful insights for advertisers. ● Campaign Measurement Expertise: Develop a deep understanding of the mechanics and processes behind the campaign measurement solutions utilized at our client, with a particular focus on brand lift and online conversion methodologies. Qualifications: ● Experience: 5+ years of experience in advertising sales research, preferably in roles at research agencies, media owners, advertisers, or media agencies. ● Technical Skills: Strong working knowledge of 3rd party measurement providers, particularly in brand lift, with a proven track record of adoption and analysis. ● Communication Skills: Exceptional communication, organizational, and presentation skills with the ability to present research findings effectively in both internal and client-facing settings. ● Analytical Ability: Proficiency in data analysis and storytelling, with the capability to explore and explain the? and why? behind research results. ● Adaptability: Comfortable with adapting to new skills, research methodologies, and technologies as needed. ● Industry Knowledge: Thorough understanding of the digital advertising landscape. ● Team Collaboration: A collaborative team player with a positive attitude, committed to building strong relationships with colleagues and stakeholders."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70509-databasutvecklare/",
    "roles": [
      "Databasutvecklare"
    ],
    "places": [
      "Kalmar",
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning På kunds räkning söker vi nu en databasutvecklare, där du ska kunna arbeta testdrivet och med testautomation. Uppdraget kan bland annat bestå av följande uppgifter: Ta fram och utveckla lösningsförslag Dokumentera lösningar Testa funktioner och tjänster Implementera och exekvera automatiska tester Uppdraget kan förändras där till exempel du kan komma att ingå i andra projekt och eller förvaltning, i rollen som databasutvecklare. Skallkrav Du ska ha minst fem (5) års erfarenhet av databasutveckling i Oracle PL/SQL och/eller i Postgres PL/pgSQm Du ska ha minst ett (1) års erfarenhet av databasutveckling i Oracle PL/SQL och i Postgres PL/pgSQL. Du ska ha relevant universitets- eller högskoleutbildning eller arbetslivserfarenhet som bedöms likvärdig. Du ska ha goda kunskaper i svenska i såväl tal som skrift. Börkrav Du bör ha minst fem (5) års erfarenhet av utveckling i både PL/SQL och PL/pgSQL. Du bör ha erfarenhet av att porta kod från Oracle och PL/SQL till Postgres och PL/pgSQL. Du bör ha erfarenhet av Oracle APEX. Du bör ha erfarenhet av transaktionsintensiva system som hanterar stora datamängder. Du bör ha erfarenhet av agil utveckling. Du bör ha erfarenhet av versionshantering med GIT och Liquibase. &nbsp; OBS: Du måste kunna starta 2024-11-04. Du måste även kunna närvara i Kalmar på PI-planning 11-13 november. Arbete sker i kundens lokaler i Stockholm eller i Kalmar – 3 dagar/vecka på plats"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70493-implementationsprojektledare/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning På kunds räkning söker vi nu en implementationsprojektledare till projektet Digital arbetsplatsupphandling. Arbetsuppgifter: Projektleda enligt PPS/Pejl metodik. Hålla ihop delprojekt och uppföljning som följer med det. Täta dialoger med alla parter inom och utanför vår kund. Ta fram och kommunicera nya rutiner till de olika parterna i projektet och till verksamheten. Ta fram underlag till interna beslutspunkter, samt uppföljning ekonomi. För detta uppdraget så krävs det gedigen erfarenhet utav: Leda människor och ta tydligt ägarskap och vara tydlig med delegering och uppföljning. Med flera delprojekt. Flera leverantörer att koordinera. Driva förändringsarbete kopplat till ny leverans. Kommunicera till olika grupper i verksamheten. Skallkrav: Du ska ha gedigen erfarenhet att som implementationsprojektledare med flera delprojekt. Du ska ha kunskap och erfarenhet av PPS/Pejl projektmodellen. Du ska ha kunskap av digital arbetsplats (HW/SW). Du ska ha vana att arbeta i Teams. Börkrav: Du bör ha Erfarenhet av retail (meriterande)."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70490-3-x-senior-expert-utvecklare-beslutsstodsapplikationer-50-region-skane-avrop-936-937-938/",
    "roles": [
      "Expert",
      "Utvecklare"
    ],
    "places": [
      "Lund",
      "Remote"
    ],
    "description": [
      "Uppdragsbeskrivning: Utveckla befintliga eller nya PowerBI eller Qlik-applikationer på uppdrag av systemansvarig och utifrån prioritering av Koncernkontorets beslutstödsenhet. Avropade konsulter från kan samarbeta med utvecklare från Region Skåne och andra leverantörer. Till största del distansarbete från egen arbetsplats. Önskad kompetens: Bred erfarenhet av utveckling i verktygen Qlikview, Qlik Sense och PowerBI. Dokumenterad erfarenhet av design, utveckling, test och dokumentation i ovan produkter Hög förståelse av data och databaser Förmåga att analysera data och genomföra rimlighetskontroll av resultat i utvecklade applikationer Tidigare erfarenhet från Region Skåne är önskvärd"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70377-strategisk-radgivare-utbildningmaterial-sdv-region-skane-avrop-939/",
    "roles": [
      "Rådgivare"
    ],
    "places": [
      "Lund"
    ],
    "description": [
      "Uppdragsbeskrivning: Region Skåne implementerar med hjälp av Oracle Health ett digitalt vårdsystem för att ersätta ett antal applikationer som stödjer regionens vårdaktiviteter. Detta är det mest omfattande förnyelsearbetet i Region Skånes historia. För mer information se https://vardgivare.skane.se/tema/skanes-digitala-vardsystem-sdv/ SDV söker nu en Strategisk Rådgivare Utbildningmaterial, nivå expert. Rådgivning och bollplank kring taktiska/strategiska ställningstaganden inom hälso- och sjukvårdområdet i förhållande till digitalisering och införande av nya systemplattformar: Granskning och revidering av av utbildningsmaterial till sjukvårdsanställda, i första hand till läkare. Materialet avser Region Skånes stora omställning till det nya vårdinformationssystemet SDV. Du rapporterar till SDVs programchef. &nbsp; För denna roll krävs: Erfarenhet av att ha producerat utbildningsmaterial Erfarenhet av att ha bedrivit utbildning för olika kategorier medicinsk personal Egen klinisk utbildning och sjukvårdserfarenhet Önskvärt med akademisk meritering"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70373-uppdragsledare-7/",
    "roles": [
      "Uppdragsledare"
    ],
    "places": [
      "Gävle",
      "Hybrid"
    ],
    "description": [
      "Uppdragsbeskrivning På kunds räkning söker vi nu efter en uppdragsledare. SKA-KRAV: Du ska ha erfarenhet och kunskap om behovsfångst av information. Du ska ha erfarenhet och kunskap om analysarbete av information. Du ska ha erfarenhet av att leda team i olika konstellationer, tex. Tvärfunktionella team. Du ska vara Strukturerad, noggrann och ha en vana att dokumentera. Du ska ha genomfört och avslutat adekvat projektledningsutbildning. Du ska ha genomfört och avslutat adekvat högskole- eller universitetsutbildning eller motsvarande. Du ska behärska svenska i både tal och skrift. BÖR-KRAV: Du bör ha erfarenhet av att ha deltagit i eller drivit utvecklingsarbete/projekt inom Hälso- och Sjukvården. Du bör ha erfarenhet av att ha tagit fram och etablerat driftstoppsrutiner. Du bör ha erfarenhet av arbete inom Sussa samverkan och/eller i annan Regionsamverkan. &nbsp; Du kommer delvis att behöva vara på plats i kundens lokaler i Gävle"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70344-hil-development-engineer/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a HIL Development Engineer. Their development centers focus heavily on software (SW), and they are taking a bold step forward by introducing a centralized compute platform in their next-generation vehicles. This platform will host most of the active safety, driver support, and vehicle motion control software. This centralized architecture will connect all exterior sensors to a central computer, enabling: In-house software development Continuous innovation on a stable compute platform Superior customer offerings Together with their partners, the client is building a modular, service-based perception platform to lead in safety and driver support applications. This innovation sets the stage for future safety advancements and autonomous drivingfeatures, fulfilling their mission of providing safe, personal, and sustainable mobility as they work toward a future of Zero Collisions. In their next-generation vehicles, the client is developing a computer-in-the-car architecture, essential for driving innovation in areas such as: Vehicle Motion Protective Safety Advanced Connectivity Machine Learning Autonomous Drive Their goal is to create a Vehicle Control Unit platform using cutting-edge technologies like DriveOS and NVIDIA’s latest chip technology, combined with traditional car signaling systems. This core computer and platform will: Simplify software and application development Provide a safe, reliable, and secure platform to boost innovation and development speed The Hardware In The Loop (HIL) test environments are built around this computer-in-the-car architecture. These setups integrate vehicle simulators and real hardware components to emulate a real vehicle, including all relevant dynamics. The team is responsible for developing and maintaining these test environments, ensuring they are capable of executing critical test cases for platform, software, and function verification. The hardware-based environments are state-of-the-art test setups, essential for verifying software before the final product is launched. In this role, you will be working in a fast-paced, innovative environment, tackling daily challenges and contributing to groundbreaking advancements in automotive technology. Main Responsibilities: Work in a small cross-functional team with a high focus on quality and continuous improvements. Define, set up, and configure Hardware In The Loop (HIL) test environments to support current and future projects. Deploy software applications on core computers and model with Matlab and Simulink. Enable test automation, driving toward Continuous Integration (CI) and Continuous Deployment (CD). Collaborate closely with other groups at the client company, suppliers, and cross-functional teams. Grow your understanding of Next-Generation Vehicles and the Software Platform, especially in domains such as Vehicle Motion Control, Protective Safety, and Autonomous Driving. Required Qualifications: Education in M.Sc or B.Sc in Electronics, Physics, Mechatronics, Software Engineering, or similar. At least 2 years of experience with dSPACE HIL rigs. At least 2 years of experience with dSPACE development tools (e.g., ControlDesk, ConfigurationDesk, ModelDesk, Bus Manager, Aurelion, etc.). At least 2 years of experience with Matlab/Simulink development. Fluent in English, able to communicate effectively with all types of stakeholders. Additional Qualifications: Vehicle Communication: Knowledge of CAN, LIN, FlexRay, Ethernet, etc. Programming Skills: Expertise in Matlab and Python. Agile Development: Familiar with Agile methods of working. Sensing Technologies: Knowledge of [&hellip;]"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70341-systemutvikler-ruby-on-rails/",
    "roles": [
      "Developer"
    ],
    "places": [
      "Drammen"
    ],
    "description": [
      "Oppdragsbeskrivelse På vegne av vår kunde søker vi nå en systemutvikler til deres IT-avdeling. Vår kunde ser gjerne at du arbeider 2–3 dager i uken på deres kontor. Kundens IT-avdeling består i dag av to personer og jobber med å effektivisere arbeidshverdagen for både små og store bedrifter. Teamet utvikler løsninger som omfatter alt fra e-handelssystemer til prissystemer, kvalitetssystemer og backoffice-løsninger, med kort vei fra idé til produksjon. Teamet er nå i en vekstfase, og første steg er å rekruttere en systemutvikler. Kvalifikasjoner: Backend- eller fullstackutvikler med kompetanse innen eller interesse for Ruby on Rails. Alternativt erfaring med backendutvikling i JavaScript eller TypeScript, med et ønske om å lære Ruby on Rails. Erfaring med JAVA, Go eller Rust er også relevant, så lenge du er motivert til å lære Ruby on Rails. Erfaring med Postgres-database. 5–10 års erfaring som utvikler. Personlige egenskaper: Initiativrik og systematisk. Trives med å jobbe selvstendig og autonomt. Gode kommunikasjonsferdigheter."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70338-e-commerceansvarlig/",
    "roles": [
      "E-commerce Manager"
    ],
    "places": [
      "Drammen"
    ],
    "description": [
      "Oppdragsbeskrivelse For kundes regning søker vi nå en dedikert E-Commerceansvarlig innen IT-avdelingen som kan ta det totale ansvaret for kundens nettbutikk. Kunden forventer at du jobber 2–3 dager per uke på plass i deres lokaler. Hovedansvarsområder: Rollen som e-handelsansvarlig innebærer et helhetsansvar for kundens nettbutikk, med fokus på følgende områder: Samle alt som gjelder kundens nettbutikk under én og samme funksjon. Utvikle og implementere strategier for videre vekst innen e-handel. Optimalisere driften av nettbutikken og sikre at de kommersielle målene nås. Kundens netthandel er en av de mest sentrale salgskanalene, med en omsetning på 300 millioner i dag. Det er stort potensial for ytterligere vekst gjennom nye markeder og partnerskap. Rollen rapporterer til innkjøpsdirektøren og tar over ansvaret som i dag er fordelt på flere avdelinger. Kvalifikasjoner: Teknisk forståelse, gjerne med noe programmeringserfaring (dog ikke et krav). Kommersiell erfaring, spesielt innen e-handel. Tidligere erfaring fra en lignende rolle. God prosjektledelse og erfaring med å ta ansvar. Personlige egenskaper: Lidenskap for innkjøp og kreativt arbeid. Selvstendig, med en autoritær men rolig arbeidsstil. Trives med å jobbe i prosjekter med stort ansvar."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70332-tillsynshandlaggare-med-samordningsansvar/",
    "roles": [
      "Organisationskonsult"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning Bygglovenheten har behov av en konsult som kan leda och utveckla arbetet med tillsynsärenden enligt plan- och bygglagen samt handlägga tillsynsärenden. I uppdraget ingår att ta fram mallar och rutiner samt handleda andra handläggare inom tillsyn. Uppskattad tid i timmar för uppdraget: 40 timmar i veckan. Möjlighet till förlängning 6 månader. Krav på leverans Målet är att ha en fungerande process och en kraftigt förkortad kö av tillsynsärenden när uppdraget är slutfört. Konsult kommer att ansvara för samordning, handledning och utveckling av processer. Förväntat resultat Målet är att ha en fungerande process och en kraftigt förkortad kö av tillsynsärenden när uppdraget är slutfört. Hantering av personuppgifter Fastighetsbeteckningar, personnummer Handlingar som ska ingå i offert: &#8211; CV &#8211; Pris Skallkrav Mångårig erfarenhet av handläggning av tillsynsärenden enligt plan- och bygglagen Mångårig erfarenhet av att handleda inom området Erfarenhet av att med goda resultat utvecklat och implementerat fungerande arbetssätt inom tillsyns enligt plan- och bygglagen Börkrav Meriterande om konsult har kunskap om Täby kommuns organisation och politiska mål &nbsp; För att kunna ansöka för detta uppdrag måste du vara en registrerad användare i vår portal som är helt kostnadsfri. Är du ny användare och vill registrera dig eller ditt bolag i Upgrades portal klicka här: https://portal.upgraded.se/"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70323-oss-sw-engineer-2/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client is currently seeking an OSS SW Engineer for software development in Java, interfacing with embedded controls and customer ERP/MES/MCS systems. The role requires the ability to envision the complete system, design, implement, and test smart optimization algorithms, and debug system events using log data streams. Additionally, collaboration with the simulation team to conduct tests via emulated hardware interfaces will be essential. The engineer will be responsible for designing, testing, and debugging product features—whether mechanical, electrical, or software—and will contribute to defining and specifying product requirements. Estimating work packages and assisting project management with time plan breakdowns are part of the job. Hands-on work in laboratory environments with testing and debugging will also be required. The role allows for flexibility with a hybrid work environment and flexible office spaces. Main Responsibilities: Software development in Java, interfacing with embedded controls and customer ERP/MES/MCS systems. Envisioning complete systems to design, implement, and test smart optimization algorithms. Debugging system events based on log data streams. Collaborating with the simulation team to conduct tests through emulated hardware. Designing, testing, and debugging product features (mechanical, electrical, or software). Contributing to defining and specifying product requirements. Estimating work packages and assisting project management in time plan breakdown. Producing and maintaining documentation. Working hands-on in laboratory environments with test and debugging. Effectively working in a hybrid work environment with flexible office spaces. The project this position is part of involves the extension of the AFS team for a new and exciting project in semiconductor manufacturing, a new industry for our client. The goal is to design, develop, test, and deploy a mechatronic solution involving multiple shuttles in a goods transportation system. The project encompasses all aspects, including the shuttles, rail structure, charging station, and management system, integrating mechanical, electrical, and software design. The development project is based in Sweden, with the customer located in southern Europe. The development team is responsible for requirements breakdown, design, implementation, and testing of all components, and their involvement will be high during the installation and commissioning phases, which may require occasional travel to the customer site. Qualifications: Bachelor’s degree in a relevant field. At least 5 years of relevant professional work experience. Meritorious Qualifications: Experience with AGV, AMR, or other mechatronic solutions in industrial automation. Familiarity with SEMI standards within automation (e.g., E84) or safety (e.g., S2). Experience with clean room applications (ISO 5). Required Attributes: Creativity and ingenuity. Focus on customer and business value when industrializing solutions. Well-structured with attention to detail. Fluent in English, both written and spoken. Strong communication skills, especially the ability to convey technical information clearly to non-technical colleagues."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70312-compliance-engineer-2/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client is seeking a Compliance Engineer for a full or part-time operative role within a project. While the company has internal compliance responsibilities at the company level, this role will focus on operational compliance for the specific project. The project is a new venture in semiconductor manufacturing, representing a new industry sector for the client. The project involves designing, developing, testing, and deploying a mechatronic solution for goods transportation. The solution includes shuttles, a rail structure, a charging station, and a management system. The development team, based in Sweden, is responsible for the entire project lifecycle, including design, implementation, and testing, before handing over to a commissioning team for deployment. The customer is located in Southern Europe, and some travel within Europe may be required. The role demands adaptability and collaboration with different stakeholders, including close cooperation with product owners and other team members to define and detail requirements. The tight project timeline and growing project team make it essential for the Compliance Engineer to take an active role in all project phases. Main Responsibilities: Perform risk assessments in line with applicable regulations, such as the Machinery Directive. Apply knowledge of EN ISO 13849-1:2023 and EN ISO 13849-2:2016 to ensure safety compliance. Identify Safety-Related Parts of Control Systems (SRPCS) and document safety functions using SISTEMA or equivalent tools. Oversee electrical safety, including incoming supply and CE marking of electrical cabinets, according to IEC 60204-1. Handle and mitigate EMC disturbances. Ensure CE marking compliance throughout all project phases. Evaluate and apply all relevant regulations and directives for the project. Collaborate with internal compliance teams and external suppliers and customers to secure compliance. Engage in hands-on design, testing, and debugging of mechanical, electrical, or software features. Work closely with design houses to analyze and debug PCBs and electrical schematics. Contribute to EMC compliance testing and handle power supply and electrical design tasks. Participate in training support teams and maintain close cooperation with mechanical engineers. Work in laboratory environments for testing and debugging. Produce and maintain project documentation. Estimate work packages and assist with time plan breakdown for project management. Required Qualifications: Profound knowledge of risk assessment methods according to regulations like the Machinery Directive. Expertise in EN ISO 13849-1:2023 and EN ISO 13849-2:2016. Ability to identify SRPCS and document safety functions with SISTEMA or equivalent. Competency in managing electrical safety, particularly in CE marking electrical cabinets according to IEC 60204-1. Experience in handling EMC disturbances. At least five years of professional, relevant work experience. Bachelor’s degree in a relevant field. Fluent in English, both written and spoken. Additional Qualifications: Experience with SAT and SEMI conductors. Hands-on experience in designing, testing, and debugging product features (mechanical, electrical, software). Ability to analyze and debug PCBs and electrical schematics in close cooperation with design houses. Practical experience in EMC compliance and testing. Experience in electrical safety and power supply design, as well as motor and sensor integration. Experience with automated systems such as AGVs, AMRs, or other mechatronic solutions for industrial automation. [&hellip;]"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70309-frontendutviklere-sharepoint-og-azure-google-analytics-konsulenter/",
    "roles": [
      "Developer"
    ],
    "places": [
      "Oslo"
    ],
    "description": [
      "Oppdragsbeskrivelse På vegne av vår kunde søker vi nå erfarne konsulenter innen ulike områder for en spennende mulighet med umiddelbar oppstart i Oslo. Arbetet sker på plats i kundens lokaler i Oslo tre dagar i veckan.  Vår kunde har behov for kompetanse innen følgende områder: Frontendutviklere: Antall: 2 konsulenter Kompetanse: Ekspertise innen Vue.js Erfaring: Cirka 7 års erfaring SharePoint-konsulenter: Antall: 5–6 konsulenter Kompetanse: Erfaring med on-prem-løsninger Krav: Sikkerhetsklarering er nødvendig eller mulighet for sikkerhetsklarering Erfaring: Cirka 5 års erfaring Azure/Google Analytics-konsulenter: Antall: 3–4 konsulenter Kompetanse: Erfaring med både Azure og Google Analytics Krav: Sikkerhetsklarering er nødvendig eller mulighet for sikkerhetsklarering Erfaring: Cirka 5 års erfaring Vi søker deg som er norsk statsborger og som har en sterk arbeidsmoral samt evne til å jobbe effektivt i team. Er du interessert i disse spennende mulighetene? Send din søknad og CV til oss så snart som mulig. Kontakt oss gjerne for mer informasjon!"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70278-devops-engineer-21/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a DevOps Engineer. Agile Release Train High Integrity Nodes (ARTHIN) is an integral part of the Core System Platform, offering a safety-critical platform for functions to be deployed upon. It is an Autosar Classic-based platform using Infineon Aurix TriCore processors. The High Integrity (HI) teams are jointly responsible for the creation and deployment of a platform for high-ASIL components (up to ASIL-D) and safety-critical processes. The High Integrity (HI) teams are split into Platform Development and an Integration-focused Organization. They consist of teams responsible for architecture, safety, cybersecurity, DevOps, development and configuration, and application integration. The platform is developed with the ambition to reuse the software across 3 system-on-chips (HI-A, HI-B, HI-C) located within the Core System, and across generations of the Core System. Main Responsibilities: Build tool chains and workflows to ensure smooth SW flow and deployment in an automotive environment Automate and robustly integrate software Identify errors early in the process Reduce turnaround times Suggest ideas for improvement Take ownership of tasks to meet project goals Support embedded software developers in building a world-leading, safe, and sustainable High Integrity platform Required Qualifications: Experience with CI/CD infrastructure and tools in embedded software environments Experience in the automotive industry Experience working with Jenkins Experience working with Gerrit Experience working with WSL (Windows Subsystem for Linux) Experience working with Docker Experience working with Artifactory Experience working with Azure Experience working with Linux Skilled in Groovy Skilled in Python Strong networking skills Cross-functional communication skills Structured and capable of delivering exceptional solutions Fluent in spoken and written English Additional Qualifications: Worked in an Automotive Environment with Autosar Classic-based products Experience with build management tools Experience with pipeline orchestration tools Worked with safety-critical functions Keen on spreading knowledge to colleagues Self-driven and solution-oriented Result-oriented with a think-outside-the-box attitude Keen perception with quality understanding Desired Attributes: Keen interest in modern computing technologies Eager to work in an evolving industry Enjoys solving problems with others Customer-oriented Takes initiative Pride in personal and team deliveries Previous experience working in a DevOps environment Understanding of what is required for a good SW flow"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70275-sw-update-engineer-complete-vehicle-engineering/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a SW-Update Engineer &#8211; Complete Vehicle Engineering. Are you interested in contributing to our client’s new focus area, responsible for software updates in complete vehicles and test objects for various purposes and projects? They are a shared service team, composed of experienced colleagues, and can offer you the opportunity to work with all vehicle programs, from the concept phase until the start of production. Main Responsibilities: Support software updates in test objects and ensure delivery of updated test objects to secure further testing with the latest software. Update test objects to the latest baseline or according to customer specifications. Download and organize baselines during different project phases. Collaborate closely with customers and various stakeholders within the client’s organization. Qualifications: Good computer skills. Valid driving license (B). Basic knowledge of DSA, PIE R&amp;D, PIE, TEAMS, test object processes, and/or fault tracing (considered meritorious). Desired Attributes: Initiative in introducing new solutions. Willingness to seek assistance from colleagues when needed and provide support as required. A driven individual with strong team-player qualities."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70252-software-developer-16/",
    "roles": [
      "Developer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Software Developer. We are looking for a proactive and innovative individual to join a major initiative in their software development landscape. You will be at the forefront of introducing and applying new technologies, guiding the development teams in our client’s organization through a pivotal transformation in automotive software development. Key Responsibilities: Transition existing Windows-based development tools to a Linux environment Streamline and improve source code integration processes, transitioning from CMake and Conan to Bazel Refine and enhance build and deployment pipelines for greater efficiency Research and implement solutions for model-based development and automatic code generation Required Qualifications: In-depth experience working in both Windows and Linux development environments Strong proficiency with CMake, Bazel, Conan, and other build automation tools Solid understanding of version control systems, especially Git and Gerrit Familiarity with model-based development tools, such as Matlab/Simulink Knowledge of continuous integration and delivery (CI/CD) methodologies Experience with cloud platforms, preferably AWS or Azure Desired Attributes: Excellent communication skills, both written and spoken Proven ability to deliver results, even when working with multiple teams, stakeholders, and complex dependencies Strong decision-making capabilities in ambiguous situations Analytical mindset, focused on continuous improvement Flexibility and willingness to adopt new technologies and practices Demonstrated success in change management and aligning stakeholders If you are excited about leading technological innovation and possess a combination of technical expertise and leadership, we would love to hear from you!"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70242-frontend-utvecklare-12/",
    "roles": [
      "Frontend-utvecklare"
    ],
    "places": [
      "Lund"
    ],
    "description": [
      "Uppdragsomfattning: Portering av befintlig produkt från Knockout till React/Fluent UI &#8211; Flera av produkterna som levereras inom ramen för tjänsten moderniseras och i samband med det så byts även ramverk till React/FluentUI Driva utvecklingen framåt för existerande fullstack-lösningar byggda på .Net plattformen &#8211; Genom nära samarbete med kunder och områdesexperter ska nya och existerande lösningar drivas framåt. Arbeta med agila arbetsprocesser med mycket eget ansvar &#8211; Arbetet sker i en miljö där vi kontinuerligt strävar efter att automatisera och effektivisera våra bygg-, test- och releaseprocesser. Kodgranska &#8211; Som en del i vårt kvalitetsarbete så ska all kod granskas av någon annan än den som producerat den. I uppdraget förekommer att granska övriga utvecklares kod för att säkerställa god kvalitet. Konsulterna förväntas även vid uppdragets slut vara aktivt deltagande i framtagande av dokumentation samt stöd vid överlämningen. Att presentera utfört arbete för dels den interna arbetsgruppen men även för kunder och kravställare. Offererad konsult ska ha minst tre (3) års erfarenhet av systemutveckling i: Visual Studio Att integrera med REST-baserade WebAPI:er Typescript React/Fluent UI (Fluent UI- viktigt!!) Offererad konsult ska ha minst tre (3) års erfarenhet av att arbeta med GIT som versionshanterare Krav på referensuppdrag: Anbudsgivaren ska redovisa att offererad konsult uppfyller kraven på referensuppdragen nedan genom att bifoga ifylld bilaga 1- referensuppdrag. Offererad konsult för rollen Senior Front-End utvecklare ska inkomma med två referensuppdrag som uppfyller nedan ställda krav på referensuppdragen. Samtliga referensuppdrag får vara pågående och inte äldre än tre från sista anbudsdag. Referensuppdragen ska ha omfattat: Referens a) Erfarenhet av att bedriva utveckling i React, Javascript/Typescript; Referens b) Erfarenhet av att bedriva utveckling både på egen hand och i team; Referens c) Erfarenhet av använda Microsoft Azure DevOps och ha goda kunskaper i GIT som versionshanterare. Anbud: Det som skall skickas med i er ansökan är följande: CV Referenser Kompetensmatris Fiktiva uppdrag Arbetar på plats 3 dagar i veckan &nbsp; Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till Kravmatris_Frontend_Utvecklare"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70230-bygglovshandlaggare-2/",
    "roles": [
      "Organisationskonsult"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning Bygglovsenheten har behov av stöttning i form av en handläggare som kan handlägga bygglovsärenden självständigt samt ta fram beslutsunderlag. Avropet omfattar en (1) konsult till 50 % av en heltidstjänst. Möjligt att förlänga 3 månader + 3 månader. Krav på leverans Konsulten förväntas handlägga bygglovsansökningar självständigt och ta fram beslutsunderlag. Förväntat resultat Arbete på distans kan bli aktuellt 2-3 dagar i veckan. Konsulten förväntas handlägga bygglovsansökningar självständigt och ta fram beslutsunderlag. Platsbesök kan bli aktuellt under handläggningen. Projektorganisation Bygglovenheten består av två bygglovsarkitekter, två byggnadsinspektörer, en bygglovskoordinator, en bygglovschef samt en handläggare av bostadsanpassningsbidrag. Konsulten rapporterar först och främst till bygglovschefen. Säkerhetskrav Enligt KLASSA. Hantering av personuppgifter Konsulten kommer hantera personuppgifter som finns i en bygglovsansökan. Handlingar som ska ingå i offert: &#8211; CV &#8211; Pris Skallkrav Mycket god kännedom om plan- och bygglagen Flerårig erfarenhet av bygglovshandläggning Mycket goda kunskaper i tal och skrift i det svenska språket Börkrav Kunskap i ärendehanteringssystemet Castor är meriterande Det är meriterade om konsulten tidigare arbetat i Sundbyberg stad Övriga krav Erfarenheten styrks genom två (2) antal referensuppdrag med exempelvis följande innehåll: Uppdragets namn och typ av uppdrag. Namn på konsult/er som genomförde uppdraget. Kort beskrivning av uppdragets planering, genomförande, resultat och uppföljning. Ange även tidpunkten för uppdraget. Start- och slutdatum. &nbsp; För att kunna ansöka för detta uppdrag måste du vara en registrerad användare i vår portal som är helt kostnadsfri. Är du ny användare och vill registrera dig eller ditt bolag i Upgrades portal klicka här: https://portal.upgraded.se/"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70202-senior-architect-specialist-bmc-remedy/",
    "roles": [
      "Architect"
    ],
    "places": [
      "Distans",
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning: För kunds räkning söker vi nu en BMC Remedy-utvecklare och arkitekt för att stödja och förbättra företagets BMC Remedy-installation. Rollen innebär att förstå behoven från intressenter och förbättra plattformen utifrån dessa behov, felsöka hela miljön vid problem, samt ge stöd till användare med både enkla och avancerade frågor och rapporter. Ansvarsområden: Genomföra små och medelstora förbättringar på BMC Remedy-plattformen, från start till slut. Detta innebär att prata med intressenter för att förstå deras krav och sedan designa, bygga, testa och driftsätta förbättringen. Felsöka problem relaterade till BMC Remedy-plattformen. Stödja slutanvändare Kvalifikationer: Dokumenterad erfarenhet av att utveckla och hantera BMC Remedy-plattformen, inklusive moduler som ITSM, CMDB och skräddarsydda applikationer. Bra samarbetsförmåga med både teammedlemmar och intressenter, och förmåga att arbeta självständigt samtidigt som man håller kontakten med det globala teamet. Förmåga att felsöka både BMC-applikationen och den omgivande miljön. Utvecklingskunskaper för att analysera behov och skapa passande lösningar. Erfarenhet av utveckling, administration och drift inom: Remedy som utvecklingsplattform Remedy för integration och automation, inklusive RESTful API och Spoon. BMC CMDB Smart Reporting Digital Workplace Erfarenhet av BMC Helix-versionen är meriterande: Helix-plattformen Helix Dashboards DWP Catalog Färdigheter inom följande områden är också meriterande: MS SQL AWS-implementeringar och Terraform Python"
    ]
  }
]