[
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70341-systemutvikler-ruby-on-rails/",
    "roles": [
      "Developer"
    ],
    "places": [
      "Drammen"
    ],
    "description": [
      "Oppdragsbeskrivelse På vegne av vår kunde søker vi nå en systemutvikler til deres IT-avdeling. Vår kunde ser gjerne at du arbeider 2–3 dager i uken på deres kontor. Kundens IT-avdeling består i dag av to personer og jobber med å effektivisere arbeidshverdagen for både små og store bedrifter. Teamet utvikler løsninger som omfatter alt fra e-handelssystemer til prissystemer, kvalitetssystemer og backoffice-løsninger, med kort vei fra idé til produksjon. Teamet er nå i en vekstfase, og første steg er å rekruttere en systemutvikler. Kvalifikasjoner: Backend- eller fullstackutvikler med kompetanse innen eller interesse for Ruby on Rails. Alternativt erfaring med backendutvikling i JavaScript eller TypeScript, med et ønske om å lære Ruby on Rails. Erfaring med JAVA, Go eller Rust er også relevant, så lenge du er motivert til å lære Ruby on Rails. Erfaring med Postgres-database. 5–10 års erfaring som utvikler. Personlige egenskaper: Initiativrik og systematisk. Trives med å jobbe selvstendig og autonomt. Gode kommunikasjonsferdigheter."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70338-e-commerceansvarlig/",
    "roles": [
      "E-commerce Manager"
    ],
    "places": [
      "Drammen"
    ],
    "description": [
      "Oppdragsbeskrivelse For kundes regning søker vi nå en dedikert E-Commerceansvarlig innen IT-avdelingen som kan ta det totale ansvaret for kundens nettbutikk. Kunden forventer at du jobber 2–3 dager per uke på plass i deres lokaler. Hovedansvarsområder: Rollen som e-handelsansvarlig innebærer et helhetsansvar for kundens nettbutikk, med fokus på følgende områder: Samle alt som gjelder kundens nettbutikk under én og samme funksjon. Utvikle og implementere strategier for videre vekst innen e-handel. Optimalisere driften av nettbutikken og sikre at de kommersielle målene nås. Kundens netthandel er en av de mest sentrale salgskanalene, med en omsetning på 300 millioner i dag. Det er stort potensial for ytterligere vekst gjennom nye markeder og partnerskap. Rollen rapporterer til innkjøpsdirektøren og tar over ansvaret som i dag er fordelt på flere avdelinger. Kvalifikasjoner: Teknisk forståelse, gjerne med noe programmeringserfaring (dog ikke et krav). Kommersiell erfaring, spesielt innen e-handel. Tidligere erfaring fra en lignende rolle. God prosjektledelse og erfaring med å ta ansvar. Personlige egenskaper: Lidenskap for innkjøp og kreativt arbeid. Selvstendig, med en autoritær men rolig arbeidsstil. Trives med å jobbe i prosjekter med stort ansvar."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70332-tillsynshandlaggare-med-samordningsansvar/",
    "roles": [
      "Organisationskonsult"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning Bygglovenheten har behov av en konsult som kan leda och utveckla arbetet med tillsynsärenden enligt plan- och bygglagen samt handlägga tillsynsärenden. I uppdraget ingår att ta fram mallar och rutiner samt handleda andra handläggare inom tillsyn. Uppskattad tid i timmar för uppdraget: 40 timmar i veckan. Möjlighet till förlängning 6 månader. Krav på leverans Målet är att ha en fungerande process och en kraftigt förkortad kö av tillsynsärenden när uppdraget är slutfört. Konsult kommer att ansvara för samordning, handledning och utveckling av processer. Förväntat resultat Målet är att ha en fungerande process och en kraftigt förkortad kö av tillsynsärenden när uppdraget är slutfört. Hantering av personuppgifter Fastighetsbeteckningar, personnummer Handlingar som ska ingå i offert: &#8211; CV &#8211; Pris Skallkrav Mångårig erfarenhet av handläggning av tillsynsärenden enligt plan- och bygglagen Mångårig erfarenhet av att handleda inom området Erfarenhet av att med goda resultat utvecklat och implementerat fungerande arbetssätt inom tillsyns enligt plan- och bygglagen Börkrav Meriterande om konsult har kunskap om Täby kommuns organisation och politiska mål &nbsp; För att kunna ansöka för detta uppdrag måste du vara en registrerad användare i vår portal som är helt kostnadsfri. Är du ny användare och vill registrera dig eller ditt bolag i Upgrades portal klicka här: https://portal.upgraded.se/"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70323-oss-sw-engineer-2/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client is currently seeking an OSS SW Engineer for software development in Java, interfacing with embedded controls and customer ERP/MES/MCS systems. The role requires the ability to envision the complete system, design, implement, and test smart optimization algorithms, and debug system events using log data streams. Additionally, collaboration with the simulation team to conduct tests via emulated hardware interfaces will be essential. The engineer will be responsible for designing, testing, and debugging product features—whether mechanical, electrical, or software—and will contribute to defining and specifying product requirements. Estimating work packages and assisting project management with time plan breakdowns are part of the job. Hands-on work in laboratory environments with testing and debugging will also be required. The role allows for flexibility with a hybrid work environment and flexible office spaces. Main Responsibilities: Software development in Java, interfacing with embedded controls and customer ERP/MES/MCS systems. Envisioning complete systems to design, implement, and test smart optimization algorithms. Debugging system events based on log data streams. Collaborating with the simulation team to conduct tests through emulated hardware. Designing, testing, and debugging product features (mechanical, electrical, or software). Contributing to defining and specifying product requirements. Estimating work packages and assisting project management in time plan breakdown. Producing and maintaining documentation. Working hands-on in laboratory environments with test and debugging. Effectively working in a hybrid work environment with flexible office spaces. The project this position is part of involves the extension of the AFS team for a new and exciting project in semiconductor manufacturing, a new industry for our client. The goal is to design, develop, test, and deploy a mechatronic solution involving multiple shuttles in a goods transportation system. The project encompasses all aspects, including the shuttles, rail structure, charging station, and management system, integrating mechanical, electrical, and software design. The development project is based in Sweden, with the customer located in southern Europe. The development team is responsible for requirements breakdown, design, implementation, and testing of all components, and their involvement will be high during the installation and commissioning phases, which may require occasional travel to the customer site. Qualifications: Bachelor’s degree in a relevant field. At least 5 years of relevant professional work experience. Meritorious Qualifications: Experience with AGV, AMR, or other mechatronic solutions in industrial automation. Familiarity with SEMI standards within automation (e.g., E84) or safety (e.g., S2). Experience with clean room applications (ISO 5). Required Attributes: Creativity and ingenuity. Focus on customer and business value when industrializing solutions. Well-structured with attention to detail. Fluent in English, both written and spoken. Strong communication skills, especially the ability to convey technical information clearly to non-technical colleagues."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70312-compliance-engineer-2/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client is seeking a Compliance Engineer for a full or part-time operative role within a project. While the company has internal compliance responsibilities at the company level, this role will focus on operational compliance for the specific project. The project is a new venture in semiconductor manufacturing, representing a new industry sector for the client. The project involves designing, developing, testing, and deploying a mechatronic solution for goods transportation. The solution includes shuttles, a rail structure, a charging station, and a management system. The development team, based in Sweden, is responsible for the entire project lifecycle, including design, implementation, and testing, before handing over to a commissioning team for deployment. The customer is located in Southern Europe, and some travel within Europe may be required. The role demands adaptability and collaboration with different stakeholders, including close cooperation with product owners and other team members to define and detail requirements. The tight project timeline and growing project team make it essential for the Compliance Engineer to take an active role in all project phases. Main Responsibilities: Perform risk assessments in line with applicable regulations, such as the Machinery Directive. Apply knowledge of EN ISO 13849-1:2023 and EN ISO 13849-2:2016 to ensure safety compliance. Identify Safety-Related Parts of Control Systems (SRPCS) and document safety functions using SISTEMA or equivalent tools. Oversee electrical safety, including incoming supply and CE marking of electrical cabinets, according to IEC 60204-1. Handle and mitigate EMC disturbances. Ensure CE marking compliance throughout all project phases. Evaluate and apply all relevant regulations and directives for the project. Collaborate with internal compliance teams and external suppliers and customers to secure compliance. Engage in hands-on design, testing, and debugging of mechanical, electrical, or software features. Work closely with design houses to analyze and debug PCBs and electrical schematics. Contribute to EMC compliance testing and handle power supply and electrical design tasks. Participate in training support teams and maintain close cooperation with mechanical engineers. Work in laboratory environments for testing and debugging. Produce and maintain project documentation. Estimate work packages and assist with time plan breakdown for project management. Required Qualifications: Profound knowledge of risk assessment methods according to regulations like the Machinery Directive. Expertise in EN ISO 13849-1:2023 and EN ISO 13849-2:2016. Ability to identify SRPCS and document safety functions with SISTEMA or equivalent. Competency in managing electrical safety, particularly in CE marking electrical cabinets according to IEC 60204-1. Experience in handling EMC disturbances. At least five years of professional, relevant work experience. Bachelor’s degree in a relevant field. Fluent in English, both written and spoken. Additional Qualifications: Experience with SAT and SEMI conductors. Hands-on experience in designing, testing, and debugging product features (mechanical, electrical, software). Ability to analyze and debug PCBs and electrical schematics in close cooperation with design houses. Practical experience in EMC compliance and testing. Experience in electrical safety and power supply design, as well as motor and sensor integration. Experience with automated systems such as AGVs, AMRs, or other mechatronic solutions for industrial automation. [&hellip;]"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70309-frontendutviklere-sharepoint-og-azure-google-analytics-konsulenter/",
    "roles": [
      "Developer"
    ],
    "places": [
      "Oslo"
    ],
    "description": [
      "Oppdragsbeskrivelse På vegne av vår kunde søker vi nå erfarne konsulenter innen ulike områder for en spennende mulighet med umiddelbar oppstart i Oslo. Arbetet sker på plats i kundens lokaler i Oslo tre dagar i veckan.  Vår kunde har behov for kompetanse innen følgende områder: Frontendutviklere: Antall: 2 konsulenter Kompetanse: Ekspertise innen Vue.js Erfaring: Cirka 7 års erfaring SharePoint-konsulenter: Antall: 5–6 konsulenter Kompetanse: Erfaring med on-prem-løsninger Krav: Sikkerhetsklarering er nødvendig eller mulighet for sikkerhetsklarering Erfaring: Cirka 5 års erfaring Azure/Google Analytics-konsulenter: Antall: 3–4 konsulenter Kompetanse: Erfaring med både Azure og Google Analytics Krav: Sikkerhetsklarering er nødvendig eller mulighet for sikkerhetsklarering Erfaring: Cirka 5 års erfaring Vi søker deg som er norsk statsborger og som har en sterk arbeidsmoral samt evne til å jobbe effektivt i team. Er du interessert i disse spennende mulighetene? Send din søknad og CV til oss så snart som mulig. Kontakt oss gjerne for mer informasjon!"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70278-devops-engineer-21/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a DevOps Engineer. Agile Release Train High Integrity Nodes (ARTHIN) is an integral part of the Core System Platform, offering a safety-critical platform for functions to be deployed upon. It is an Autosar Classic-based platform using Infineon Aurix TriCore processors. The High Integrity (HI) teams are jointly responsible for the creation and deployment of a platform for high-ASIL components (up to ASIL-D) and safety-critical processes. The High Integrity (HI) teams are split into Platform Development and an Integration-focused Organization. They consist of teams responsible for architecture, safety, cybersecurity, DevOps, development and configuration, and application integration. The platform is developed with the ambition to reuse the software across 3 system-on-chips (HI-A, HI-B, HI-C) located within the Core System, and across generations of the Core System. Main Responsibilities: Build tool chains and workflows to ensure smooth SW flow and deployment in an automotive environment Automate and robustly integrate software Identify errors early in the process Reduce turnaround times Suggest ideas for improvement Take ownership of tasks to meet project goals Support embedded software developers in building a world-leading, safe, and sustainable High Integrity platform Required Qualifications: Experience with CI/CD infrastructure and tools in embedded software environments Experience in the automotive industry Experience working with Jenkins Experience working with Gerrit Experience working with WSL (Windows Subsystem for Linux) Experience working with Docker Experience working with Artifactory Experience working with Azure Experience working with Linux Skilled in Groovy Skilled in Python Strong networking skills Cross-functional communication skills Structured and capable of delivering exceptional solutions Fluent in spoken and written English Additional Qualifications: Worked in an Automotive Environment with Autosar Classic-based products Experience with build management tools Experience with pipeline orchestration tools Worked with safety-critical functions Keen on spreading knowledge to colleagues Self-driven and solution-oriented Result-oriented with a think-outside-the-box attitude Keen perception with quality understanding Desired Attributes: Keen interest in modern computing technologies Eager to work in an evolving industry Enjoys solving problems with others Customer-oriented Takes initiative Pride in personal and team deliveries Previous experience working in a DevOps environment Understanding of what is required for a good SW flow"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70275-sw-update-engineer-complete-vehicle-engineering/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a SW-Update Engineer &#8211; Complete Vehicle Engineering. Are you interested in contributing to our client’s new focus area, responsible for software updates in complete vehicles and test objects for various purposes and projects? They are a shared service team, composed of experienced colleagues, and can offer you the opportunity to work with all vehicle programs, from the concept phase until the start of production. Main Responsibilities: Support software updates in test objects and ensure delivery of updated test objects to secure further testing with the latest software. Update test objects to the latest baseline or according to customer specifications. Download and organize baselines during different project phases. Collaborate closely with customers and various stakeholders within the client’s organization. Qualifications: Good computer skills. Valid driving license (B). Basic knowledge of DSA, PIE R&amp;D, PIE, TEAMS, test object processes, and/or fault tracing (considered meritorious). Desired Attributes: Initiative in introducing new solutions. Willingness to seek assistance from colleagues when needed and provide support as required. A driven individual with strong team-player qualities."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70252-software-developer-16/",
    "roles": [
      "Developer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Software Developer. We are looking for a proactive and innovative individual to join a major initiative in their software development landscape. You will be at the forefront of introducing and applying new technologies, guiding the development teams in our client’s organization through a pivotal transformation in automotive software development. Key Responsibilities: Transition existing Windows-based development tools to a Linux environment Streamline and improve source code integration processes, transitioning from CMake and Conan to Bazel Refine and enhance build and deployment pipelines for greater efficiency Research and implement solutions for model-based development and automatic code generation Required Qualifications: In-depth experience working in both Windows and Linux development environments Strong proficiency with CMake, Bazel, Conan, and other build automation tools Solid understanding of version control systems, especially Git and Gerrit Familiarity with model-based development tools, such as Matlab/Simulink Knowledge of continuous integration and delivery (CI/CD) methodologies Experience with cloud platforms, preferably AWS or Azure Desired Attributes: Excellent communication skills, both written and spoken Proven ability to deliver results, even when working with multiple teams, stakeholders, and complex dependencies Strong decision-making capabilities in ambiguous situations Analytical mindset, focused on continuous improvement Flexibility and willingness to adopt new technologies and practices Demonstrated success in change management and aligning stakeholders If you are excited about leading technological innovation and possess a combination of technical expertise and leadership, we would love to hear from you!"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70242-frontend-utvecklare-12/",
    "roles": [
      "Frontend-utvecklare"
    ],
    "places": [
      "Lund"
    ],
    "description": [
      "Uppdragsomfattning: Portering av befintlig produkt från Knockout till React/Fluent UI &#8211; Flera av produkterna som levereras inom ramen för tjänsten moderniseras och i samband med det så byts även ramverk till React/FluentUI Driva utvecklingen framåt för existerande fullstack-lösningar byggda på .Net plattformen &#8211; Genom nära samarbete med kunder och områdesexperter ska nya och existerande lösningar drivas framåt. Arbeta med agila arbetsprocesser med mycket eget ansvar &#8211; Arbetet sker i en miljö där vi kontinuerligt strävar efter att automatisera och effektivisera våra bygg-, test- och releaseprocesser. Kodgranska &#8211; Som en del i vårt kvalitetsarbete så ska all kod granskas av någon annan än den som producerat den. I uppdraget förekommer att granska övriga utvecklares kod för att säkerställa god kvalitet. Konsulterna förväntas även vid uppdragets slut vara aktivt deltagande i framtagande av dokumentation samt stöd vid överlämningen. Att presentera utfört arbete för dels den interna arbetsgruppen men även för kunder och kravställare. Offererad konsult ska ha minst tre (3) års erfarenhet av systemutveckling i: Visual Studio Att integrera med REST-baserade WebAPI:er Typescript React/Fluent UI (Fluent UI- viktigt!!) Offererad konsult ska ha minst tre (3) års erfarenhet av att arbeta med GIT som versionshanterare Krav på referensuppdrag: Anbudsgivaren ska redovisa att offererad konsult uppfyller kraven på referensuppdragen nedan genom att bifoga ifylld bilaga 1- referensuppdrag. Offererad konsult för rollen Senior Front-End utvecklare ska inkomma med två referensuppdrag som uppfyller nedan ställda krav på referensuppdragen. Samtliga referensuppdrag får vara pågående och inte äldre än tre från sista anbudsdag. Referensuppdragen ska ha omfattat: Referens a) Erfarenhet av att bedriva utveckling i React, Javascript/Typescript; Referens b) Erfarenhet av att bedriva utveckling både på egen hand och i team; Referens c) Erfarenhet av använda Microsoft Azure DevOps och ha goda kunskaper i GIT som versionshanterare. Anbud: Det som skall skickas med i er ansökan är följande: CV Referenser Kompetensmatris Fiktiva uppdrag Arbetar på plats 3 dagar i veckan &nbsp; Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till Kravmatris_Frontend_Utvecklare"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70230-bygglovshandlaggare-2/",
    "roles": [
      "Organisationskonsult"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning Bygglovsenheten har behov av stöttning i form av en handläggare som kan handlägga bygglovsärenden självständigt samt ta fram beslutsunderlag. Avropet omfattar en (1) konsult till 50 % av en heltidstjänst. Möjligt att förlänga 3 månader + 3 månader. Krav på leverans Konsulten förväntas handlägga bygglovsansökningar självständigt och ta fram beslutsunderlag. Förväntat resultat Arbete på distans kan bli aktuellt 2-3 dagar i veckan. Konsulten förväntas handlägga bygglovsansökningar självständigt och ta fram beslutsunderlag. Platsbesök kan bli aktuellt under handläggningen. Projektorganisation Bygglovenheten består av två bygglovsarkitekter, två byggnadsinspektörer, en bygglovskoordinator, en bygglovschef samt en handläggare av bostadsanpassningsbidrag. Konsulten rapporterar först och främst till bygglovschefen. Säkerhetskrav Enligt KLASSA. Hantering av personuppgifter Konsulten kommer hantera personuppgifter som finns i en bygglovsansökan. Handlingar som ska ingå i offert: &#8211; CV &#8211; Pris Skallkrav Mycket god kännedom om plan- och bygglagen Flerårig erfarenhet av bygglovshandläggning Mycket goda kunskaper i tal och skrift i det svenska språket Börkrav Kunskap i ärendehanteringssystemet Castor är meriterande Det är meriterade om konsulten tidigare arbetat i Sundbyberg stad Övriga krav Erfarenheten styrks genom två (2) antal referensuppdrag med exempelvis följande innehåll: Uppdragets namn och typ av uppdrag. Namn på konsult/er som genomförde uppdraget. Kort beskrivning av uppdragets planering, genomförande, resultat och uppföljning. Ange även tidpunkten för uppdraget. Start- och slutdatum. &nbsp; För att kunna ansöka för detta uppdrag måste du vara en registrerad användare i vår portal som är helt kostnadsfri. Är du ny användare och vill registrera dig eller ditt bolag i Upgrades portal klicka här: https://portal.upgraded.se/"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70202-senior-architect-specialist-bmc-remedy/",
    "roles": [
      "Architect"
    ],
    "places": [
      "Distans",
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning: För kunds räkning söker vi nu en BMC Remedy-utvecklare och arkitekt för att stödja och förbättra företagets BMC Remedy-installation. Rollen innebär att förstå behoven från intressenter och förbättra plattformen utifrån dessa behov, felsöka hela miljön vid problem, samt ge stöd till användare med både enkla och avancerade frågor och rapporter. Ansvarsområden: Genomföra små och medelstora förbättringar på BMC Remedy-plattformen, från start till slut. Detta innebär att prata med intressenter för att förstå deras krav och sedan designa, bygga, testa och driftsätta förbättringen. Felsöka problem relaterade till BMC Remedy-plattformen. Stödja slutanvändare Kvalifikationer: Dokumenterad erfarenhet av att utveckla och hantera BMC Remedy-plattformen, inklusive moduler som ITSM, CMDB och skräddarsydda applikationer. Bra samarbetsförmåga med både teammedlemmar och intressenter, och förmåga att arbeta självständigt samtidigt som man håller kontakten med det globala teamet. Förmåga att felsöka både BMC-applikationen och den omgivande miljön. Utvecklingskunskaper för att analysera behov och skapa passande lösningar. Erfarenhet av utveckling, administration och drift inom: Remedy som utvecklingsplattform Remedy för integration och automation, inklusive RESTful API och Spoon. BMC CMDB Smart Reporting Digital Workplace Erfarenhet av BMC Helix-versionen är meriterande: Helix-plattformen Helix Dashboards DWP Catalog Färdigheter inom följande områden är också meriterande: MS SQL AWS-implementeringar och Terraform Python"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70178-systems-operations-senior-specialist/",
    "roles": [
      "Systemspecialist"
    ],
    "places": [
      "Distans",
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning: Du kommer att arbeta med vår toppmoderna handelsplattform och ansvara för att hantera inkommande ärenden, lösa incidenter och lansera nya versioner. Prestandatester och återställningsprocedurer utförs för olika versioner, och du kommer att delta i många spännande projekt som förbättrar och introducerar nya produkter och förbättringar. Trivs du i en resultatorienterad, högpresterande internationell miljö och gillar att arbeta kreativt och dynamiskt, är detta rollen för dig. Arbetsuppgifter: Deltagande i alla aktiviteter kring applikationerna, såsom hantering av inkommande ärenden, incidentlösning, krav och lansering av nya versioner. Designa, planera och genomföra ändringar i våra befintliga system samt implementera nya lösningar. Planera och utföra prestanda- och icke-funktionella tester. Agera specialist i operativa frågor, krav och problem. Deltagande i olika projekt för både befintliga och nya kunder. Underhålla dokumentation för drift, som behövs för andra linjens support. Hantera projekt och självständigt utföra delar av större implementeringsprojekt. Kvalifikationer: Obligatoriskt: Kunskap om Linux/Unix. Erfarenhet av att arbeta med DevOps, systemadministration, nätverk, applikationsdrift eller liknande områden. Kunskap om skriptning (Perl, Python, etc.) och databaser (SQL) är meriterande. Kunskap inom molntjänster, containerisering (Docker) och containerorkestrering (Kubernetes) är meriterande. Examen i datavetenskap, informationssystem eller liknande. Utmärkta språkkunskaper i engelska, både i tal och skrift. Stark egen drivkraft och initiativförmåga, samt trivs med att arbeta i en snabb, krävande miljö med fokus på kundnöjdhet. Förmåga att hantera flera uppgifter samtidigt och en stark arbetsmoral i en affärskritisk 24/7-miljö kommer att säkerställa din framgång i denna roll."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70168-data-governance/",
    "roles": [
      "Data Governance"
    ],
    "places": [
      "Distans",
      "Nearshore"
    ],
    "description": [
      "Responsible and Managing: Establishing a comprehensive data governance framework aligned with our strategic objectives. Developing and implementing data policies, standards and guidelines. Creating a clear data governance organization structure with defined roles and responsibilities. Defining data domains and conducting a pilot implementation of the governance framework. Collaborating with stakeholders across the organization to ensure successful adoption of data governance practices. &nbsp; Qualifications: Strong understanding of data concepts, taxonomy, and metadata management. Extensive experience in data governance projects, ideally across various industries. Proven ability to design and implement effective data governance frameworks. Excellent communication and interpersonal skills to build relationships and influence stakeholders. Strong analytical and problem-solving skills. Familiarity with data management tools and technologies (a plus). Fluent in both written and spoken English"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70141-70141/",
    "roles": [
      "Developer",
      "System Developer",
      "Systemutvecklare",
      "Utvecklare"
    ],
    "places": [
      "Distans"
    ],
    "description": [
      "Assignment Description:‌ Our client is looking for a Backstage developer. The aim is to develop a unifying infrastructure for tooling, services, and documentation to create a streamlined development environment from end to end with Backstage. To succeed in this role: Bachelors/Master&#8217;s degree in IT or related disciplines. Experience of DevOps, APIs, microservices and integrations. Experience with Backstage or ability to learn it quickly. Excellent networking and interpersonal skills. Are an analytical person with great coordination and planning skills. Pay attention to details, with the ability to keep an overview to deliver your commitments and dependencies to others. Accountability, proactivity, and ability to quickly adapt and respond to change. Effective communication and stakeholder management skills. Flexibility: able to work paid evenings and weekends for the implementation of events. Practical understanding of Agile, Scrum, SAFe methodologies."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70134-systemtestare/",
    "roles": [
      "System Tester"
    ],
    "places": [
      "Kalmar",
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning På kunds räkning söker vi nu en systemtestare. Uppdraget hos vår kund kommer att bestå av, bland annat, följande uppgifter: Designa, implementera och exekvera automatiska tester för tjänster och underliggande affärslager, kan innebära GUI tester Testgenomförande på tjänstebaserade plattformar Dokumentera och rapportera testresultat till teamet Ärendehantering vid produktionsfel Databas- och loggsökning Uppdraget kan förändras där t.ex. du kan komma att ingå i andra projekt som systemtestare. Skallkrav Du ska uppfylla minst kompetensnivå tre (3). Du ska ha minst fem (5) års erfarenhet av att arbeta med testdesign och testning av mjukvara. Minst tre (3) år av arbetslivserfarenheten ska vara förvärvad någon gång under den senaste femårsperioden. Du ska ha minst tre (3) års erfarenhet av att arbeta med testautomatisering. Minst två (2) år av arbetslivserfarenheten ska vara förvärvad någon gång under den senaste femårsperioden. Du ska ha minst ett (1) års erfarenhet av arbete i team som arbetar enligt agila arbetssätt. Du ska ha minst tre (3) års erfarenhet av att arbeta med tjänstebaserade plattformar. Minst två (2) år av arbetslivserfarenheten ska vara förvärvad någon gång under den senaste femårsperioden. Du ska ha minst tre (3) års erfarenhet av testning i webbapplikation, både frontend och backend. Du ska ha relevant universitets- eller högskoleutbildning eller arbetslivserfarenhet som bedöms likvärdig. Du ska ha goda kunskaper i svenska i såväl tal som skrift. &nbsp; Börkrav Du bör ha erfarenhet av relevanta sökningar i loggverktyg. Du bör ha erfarenhet av acceptanstestning tillsammans med verksamhetsspecialister. Du bör ha certifiering inom testområdet (ISTQB). Du bör ha Erfarenhet av databashanterare samt SQL. Du bör ha erfarenhet av att ha arbetat med testverktyget ReadyAPI/SoapUI. Du bör ha erfarenhet av att ha arbetat med testverktyget Cypress. Du bör ha erfarenhet av att ha arbetat med kontinuerlig testning av pipelines/CI/CD. Du bör ha kunskap av att ha arbetat med någon av följande tekniker/plattformar: &#8211; Java &#8211; Java EE/Jakarta EE &#8211; JPA/Hibernate &#8211; Sonarqube &#8211; Jax-RS &#8211; Vue.js &#8211; Kubernetes/Openshift &nbsp; OBS: Du måste kunna starta 2024-11-04. Du måste även kunna närvara i Kalmar på PI-planning 11-13 november. Arbete sker i kundens lokaler i Stockholm eller i Kalmar &#8211; 3 dagar/vecka på plats"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70119-solution-developer-fullstack/",
    "roles": [
      "Fullstack-utvecklare",
      "Solution Developer"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Assignment Description: Target rates that are listed for each requisition is the rate that our. client is looking for, depending on the market situation and competition, the rate that the client chooses can of course be under the listed target rate. If you submit a rate below the target rate that will increase your chance to get the assignment. The average period for a consultant assignment exceeds 14months, extensions included. Take that into consideration when you submit your rate. Project and role description: Our client needs to strengthen their team and in the midst of an exciting project involving the development of an app that is expected to launch a pilot this fall. Looking for someone with fullstack expertise. To succeed in the role, we believe you have the following mindset: Likes pair programming, mob programming and other forms of co-creation Likes working in an ever changing environment where new information (from the market / customers) leads to new decisions Not afraid of presenting half baked ideas and improving them together with the team / test users Cares strongly about constant refactoring to keep the code base pristine Technical and Personal Competences Requirements: Experience in API design Experience with Node.js and TypeScript Experience with setting up and maintaining cloud infrastructure (preferably GCP) Experience with setting up and maintaining CI/CD pipelines, GitOps-style TDD You are fluent in both Swedish and English. Meritorious: Experienced with or deeply interested in investments (stocks, funds, ETFs, etc.) Experience with http://Socket.io at scale Experience with event-driven architecture Experience with React and React Native Experience with building mobile apps"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70121-backendutvecklare-3/",
    "roles": [
      "Backend",
      "Backendutvecklare"
    ],
    "places": [
      "Kalmar",
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning På kunds räkning söker vi nu efter en backendutvecklare.  Du kommer att hjälpa att förstärka vår kunds utvecklingsteam som backendutvecklare och förvalta och utveckla deras tjänster. Du ska kunna arbeta testdrivet och med testautomation. Uppdraget kan bestå bland annat av följande uppgifter: Ta fram och utveckla lösningsförslag Dokumentera lösningar, gränssnitt mm Testa funktioner och tjänster Implementera och exekvera automatiska tester Uppdraget kan förändras där till exempel du kan komma att ingå i andra projekt och eller förvaltning, i rollen som backendutvecklare. Skallkrav Du ska uppfylla minst kompetensnivå tre (3) Du ska ha minst fem (5) års erfarenhet av arbete som senior utvecklare inom följande tekniker: Java, Java EE 6-8 (SOAP och RMI), JPA/Hibernate Du ska ha minst (3) års erfarenhet av arbete som senior utvecklare inom Spring Framework Du ska ha minst ett (1) års erfarenhet av arbete som senior utvecklare inom följande tekniker: Jakarta EE, Oracle/SQL, Kubernetes/Openshift. Arbetslivserfarenheten ska vara förvärvad någon gång under den senaste femårsperioden Du ska ha minst tre (3) års erfarenhet av att arbeta med testdriven utveckling och testautomatisering som en naturlig del av ditt arbete som systemutvecklare. Minst två (2) år av arbetslivserfarenheten ska vara förvärvad någon gång under den senaste femårsperioden. Du ska ha minst ett (1) års erfarenhet av arbete i team som arbetar enligt agila arbetssätt. Du ska ha relevant universitets- eller högskoleutbildning eller arbetslivserfarenhet som bedöms likvärdig. Du ska ha goda kunskaper i svenska i såväl tal som skrift. Börkrav Du bör ha minst tio (10) års erfarenhet som senior Java-utvecklare. Du bör ha erfarenhet av containerbaserade tekniker som Docker, Kubernetes och OpenShift. Du bör ha erfarenhet av utveckling i Linux-miljö. Du bör ha arbetat med versionshantering exempelvis GIT. Du bör ha arbetat med enhetstestning och/eller TDD. Du bör ha erfarenhet av utvecklingsverktyget IntelliJ OBS: Du måste kunna närvara i Kalmar på PI-planning 11-13 november. Arbete sker i kundens lokaler i Stockholm eller i Kalmar &#8211; 3 dagar/vecka på plats"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70117-produktdesigner/",
    "roles": [
      "Product Designer",
      "UX-designer"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning På kunds räkning söker vi nu efter en senior produktdesigner som kan hjälpa vår kund med en strategisk förflyttning av visuell presentation och interaktionsdesign. Arbetsuppgifter: Hålla ihop designförflyttningen i samverkan med produktägare. Producera design: ta fram nya komponenter efter behov. Samarbeta med vår kunds befintliga designresurser i att identifiera och prioritera designbehov. Samarbeta med intressenter från den redaktionella sidan för att skapa rätt  uttryck. Dokumentation: Skapa designguidelines för vår kunds som vägleder deras produktteam i arbetet framåt. &nbsp; Skall-krav: Minst 5 års erfarenhet av att jobba med visuell design/UI/UX med tyngdpunkt i design Erfarenhet av att leda och genomföra digitala produktförflyttningar inom området design. Har omsatt varumärkesplattform i digital design med erfarenhet av att ha jobbat nära marknad och ledningsteam och kunna motivera digitala prioriteringar och val. Dokumenterad erfarenhet av produktdesign inom media eller motsvarande konsumentprodukter Erfarenhet av att facilitera och leda workshops med mål att ta fram och leda designriktiningar. Dokumenterad kompetens inom tillgänglighet Erfarenhet av att ha jobbat med designsystem i flera olika organisationer Erfarenhet av responsiv design Har svenska som arbetsspråk Kan vara på plats i kundens lokaler i Stockholm ca 3 dagar i veckan BÖR-krav: Är kommunikativ och har hög samarbetsförmåga kring design och designbeslut Minst 3 års erfarenhet av Figma Har kunskap och erfarenhet från både app och webb Erfarenhet av att skapa en enhetlig produkt på flera plattformar."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70114-tva-microsoft-365-cloud-konsulter/",
    "roles": [
      "Cloud Consultant",
      "Microsoft 365 Cloud Konsult"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning På kunds räkning söker vi nu efter två Microsoft 365 konsulter. Vår kund ska förnya sina avtal för den digitala arbetsplatsen som används av både anställda och elever. Ett projekt har startats för att upphandla och implementera nya lösningar, med fokus på att stödja drift av en M365-miljö. Projektet beräknas pågå fram till 2029 och vår kund söker nu dig som har djup kunskap inom molnlösningar, särskilt Microsofts miljöer, för att bidra med expertis inom arkitektur, användarverktyg och hantering av digitala enheter i en hybridmiljö. Du/ni ska agera både som rådgivare och ta fram lösningsförslag. SKA krav för båda konsulter Utmärkt förmåga att kommunicera på svenska i tal och skrift Du ska ha erfarenhet på nivå 2 av Microsoft 365 och Microsofts molnlösningar Du ska ha erfarenhet från uppdrag där organisationen/-erna hade 500 eller fler anställda och de tekniska miljöerna var hybridmiljöer, d.v.s. on-prem och moln. SKA krav för konsulter (kraven behöver fyllas för minst en av konsulterna, de kan komplettera varandra) Minst en av konsulterna ska ha certifiering &#8221;MicrosoftCertified: Azure Solutions Architect Expert&#8221; eller &#8221;Microsoft 365 Certified: Enterprise Administrator Expert&#8221;. (cert ska bifogas) Minst en av konsulterna ska ha erfarenhet av manageringsverktyg för hantering av digitala enheter och applikationer i en molnmiljö (500+ anställda) Minst en av konsulterna ska ha erfarenhet av migrering från on-prem till Microsofts molnmiljöer (deltagit i minst två projekt i planläggning och genomförande) (500+ anställda) Minst en av konsulterna ska ha deltagit i upphandling av extern leverantör för hantering av M365 eller andra molntjänster för kunds räkning Minst en av konsulterna ska ha erfarenhet av hur kundspecifik identitets- och behörighetsinfrastruktur (IDP) kan användas mot molntjänster BÖR krav (kraven bör fyllas av minst en av konsulterna, men de kan komplettera varandra) Konsulten bör inneha erfarenhet av Google Cloud Console från uppdrag. Konsulten bör inneha erfarenhet av Jamf från uppdrag. Konsulten bör inneha erfarenhet av Apple cloud från uppdrag. Konsulten bör inneha erfarenhet av att ha arbetat (anställd eller från uppdrag) inom kommun eller region under en total period om minst sex månader. Konsulten bör inneha erfarenhet av vägvalsfrågor för legacy-system vid införande av M365 från uppdrag."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70046-senior-software-developer-java-and-elasticsearch/",
    "roles": [
      "Developer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Senior Software Developer with expertise in Java and Elasticsearch. Our client believes that curiosity and a genuine commitment to understanding people are key to future success. They are a team of people who care about others, working together to create new technologies and innovations for safe, sustainable, and convenient mobility. They are part of Car Software Development Solutions, a division within our client&#8217;s Software Digital department in Engineering. They develop, provide, and maintain an extensive suite of digital solutions designed to enable best-in-class vehicle software development. To achieve this, they work closely with their R&amp;D organization and other departments within the client’s organization. Their solutions cover Complete CI Tool Chains, High-Performance Computing, and other tools for Software Development and Engineering. The team is diverse and engaged, consisting of 50 members divided into 7 product teams. Main Responsibilities: In this role, you will: Develop and maintain a sophisticated metadata management platform to support Autonomous Drive development. Ensure smooth daily operations to help users and the business maximize the benefits of the big data collected from test and customer vehicles worldwide. Act as a Subject Matter Expert (SME) for the AD/ADAS (Autonomous Drive/Advanced Driver Assistance System) metadata domain, collaborating closely with the product owner, business stakeholders, and the architectural community. Contribute to the maintenance and development of coding standards and best practices within the team. Participate in planning, high-level design, evaluation and improvement of existing solutions, and implementation of new solutions. Support the optimization of data usage, integration of new data sources, and improvement of data processes and pipelines. Be empowered to solve issues and ensure users receive the services they need. Development and maintenance of the platform’s backend, frontend, and Elasticsearch configuration. Participating in testing, deployment, and operation of application services. Driving data pipeline architecture and information models in collaboration with team members and business stakeholders. Capturing business needs and translating them into solution designs. Contributing to the evolution of coding processes, standards, and ways of working to improve quality and delivery speed. Maintaining and, to some extent, developing the platform&#8217;s cloud infrastructure. Engaging with the stakeholder and user community to understand platform usage, requirements, and needs. Required Qualifications: To succeed in this position, you should have the following qualifications: Java: 5-6 years of experience. Python. Experience in building fast and scalable applications using Elasticsearch. Kubernetes: 3 years of experience. Knowledge of PostgreSQL, Spring Boot, Swagger, Groovy, and working with CI/CD tool chains. Application Security skills. Additional Qualifications: JavaScript. TypeScript. ReactJS. GraphQL. Application development using Azure cloud services. Linux. Desired Attributes: Ability to work in an Agile environment. Strong communication skills and a team player with a positive attitude."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70037-hil-engineer-sw-developer-ci-devops/",
    "roles": [
      "Developer",
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a HIL Engineer / SW Developer &#8211; CI / DevOps to join their RigOps team. Main Responsibilities: Monitor and manage around 200 component HILs as one of two engineers focusing on rig operations in the lab. Design and order new rigs to ensure stable operations, which are crucial for continuous development. Collaborate closely with the cloud infrastructure team and Software Test Center to ensure stable rig operations. Utilize Python development skills to enhance rig monitoring systems when not working directly on the rigs. Work with CI teams to improve rig usage and optimize processes. Develop and maintain CI infrastructure (as code) in collaboration with all Infotainment CI teams for the current and future generations of head-unit ECUs (SPA1, SPA2, and SPA3). Support approximately 30 development teams through the CI infrastructure. Tools and Technologies: Our client&#8217;s Infotainment system is based on Android Automotive OS, with close collaboration with partners such as Google, Apple, Aptiv, Microsoft, QNX, and Qualcomm. The CI teams work with various tools, including: Jenkins, Gerrit/GIT, Artifactory, SonarQube, Cloud/Azure, Python, Bash, Linux, Ansible, Terraform, MongoDB, and Docker. Qualifications: Background as a SW Developer or HIL Engineer. Experience with RigOps, CI, DevOps, or Cloud (Azure). Proficiency in Python development."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70023-software-engineer-112/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Software Engineer to join their development team. In this role as a Developer, you will be part of a fast-paced team delivering state-of-the-art functionality and calibrations. You will utilize various software tools used for different parts of the development process and will be responsible for all phases of development—from design and implementation to vehicle testing and fine-tuning of functionality. The Power Electronics Software department at our client’s organization is proud to be one of the most successful players in software development for Electric Vehicles. They deliver system solutions and software functionality for the Inverters in their electrified vehicles. Their vision is to deliver the best and most innovative functions to the market and continuously evolve their software platform. The Motor Controls team is developing an in-house Electric Motor Control Application from the ground up. The core functionality of the software is to realize the requested electric machine torque in the most optimal way, given the current operating conditions. Because the software is being developed from the ground up in an embedded environment, the scope of the team is comparatively large, as it is responsible for the entire development chain: architectural structure, concept studies, development environment, functionality development, software verification (unit testing, MIL, SIL, HIL, and rig/dyno), documentation, and requirements review. The team uses Simulink and code generation for application software, and direct C code for the lower-level code needed for the inverter drivers and communication. The way of working includes using Git and Gerrit with short iterations between implementation and team feedback. Qualifications: Master of Science in Electrical Power Engineering / Power Electronics / Control Theory Expertise in electric machine controls (PMSM, IM, etc.) At least 5 years of full-time industry experience System safety competence (e.g., ASIL standards) Embedded software development experience Expert knowledge of MATLAB Simulink for controls development Familiarity with modern integrated development environments and debuggers Experience in other programming languages such as Python, C, C++ Experience in calibration activities in test rigs and vehicles Knowledge of AUTOSAR structured architecture, workflows, and toolchains Advanced proficiency in the English language, with the ability to explain and understand complex solutions Holds a valid driver’s license Desired Attributes: Passion for the development of complex mechatronic systems within vehicle electrification, electronics, and embedded systems. Enjoy driving engineering challenges from the business case and concept stage through to mass production. Senior experience within the Power Electronics field and a natural initiator committed to delivering the team’s objectives with high precision and quality. A team player who contributes to bringing out the best in fellow team members and actively works to expand their professional network."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70007-configuration-manager-5/",
    "roles": [
      "Configuration Manager"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Configuration Manager. This role will focus on ensuring consistent configuration, control, and management of their Core System. As the Configuration Manager, you will be responsible for managing and enforcing changes to the product while maintaining full traceability for product releases and documentation throughout its life cycle. Your scope includes overseeing version control of crucial components, such as software and hardware. Main Responsibilities: Oversee the collection and management of all configuration items for each release to ensure traceability across the entire life cycle. Ensure that all configuration items are properly identified, tracked, reviewed, and approved as per the defined process. Prepare and present the status of configuration items prior to each release at release meetings. Conduct configuration audits to confirm that all releases are compliant with established configuration management processes, guidelines, and procedures. Contribute to the continuous improvement of configuration management processes, guidelines, and procedures for the Core System. Required Qualifications: 3-5 years of experience in roles related to configuration management. Proficient in identifying areas that require configuration management control. Solid understanding of version control systems and branching strategies. Familiarity with DevOps methodologies and their integration into configuration management processes. Desired Attributes: Strong communication and interpersonal abilities. Proficiency in English, both written and verbal."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69984-ai-architect/",
    "roles": [
      "AI/ML"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client is currently seeking an AI Architect. The role will have an ongoing responsibility for overseeing the successful execution and continuous improvement of the AI/ML environment and governance structure. Main Responsibilities AI/ML Architecture Overview Perform an assessment of the existing AI/ML architecture, including data pipelines, algorithms, models, and their scalability. Identify areas for improvement, optimization, and potential risks in the current AI/ML systems. Provide recommendations for enhancements. Strategic Roadmap Development Propose a roadmap to advance AI/ML capabilities, outlining short-term and long-term goals. Define milestones, timelines, and resource requirements for the proposed roadmap. AI/ML Operations Platform Review Evaluate potential suppliers for AI/ML operations platforms based on functionality, scalability, compatibility, and cost. Compare and rank suppliers according to the company&#8217;s specific needs and requirements. Prepare a summary report of the supplier analysis, including top contenders and recommendations. Develop a detailed requirement specification document to streamline procurement for an AI/ML operations platform, ensuring alignment with the strategic roadmap. Governance Structure Development Design a governance structure in compliance with the AI Act and other legal requirements. Establish guidelines for AI ethics, data privacy, model transparency, and risk management. Provide recommendations for internal training, communication, and monitoring to ensure adherence to governance standards. Long-term Ownership and Management Act as the primary point of contact for AI/ML strategy, platform management, and governance. Collaborate with internal teams and external partners to align AI/ML strategies with the organization&#8217;s objectives. Assist internal teams in evaluating the potential use of AI/ML solutions. Required Qualifications: Minimum 10 years of AI/ML experience, including 5 years in senior consulting or management roles. Track record of designing, implementing, and optimizing AI/ML architectures in medium to large enterprises. Extensive experience in AI/ML strategic roadmaps, setting milestones, timelines, and managing resources. Hands-on experience in researching, evaluating, and selecting AI/ML operations platforms. Expertise in developing AI/ML platform requirement specifications and managing procurement. Prior experience in AI governance structure design and implementation. Familiarity with AI Act, legal requirements, and industry best practices. Strong communication, collaboration, and project management skills. Proficient in monitoring, evaluating, and improving AI/ML environments and governance structures. Bachelor&#8217;s or Master&#8217;s degree in Computer Science, AI, Machine Learning, Data Science, or a related field. Additional Qualifications: Self-driven with the ability to handle ambiguity in work situations. Experience in defining solutions to business needs. Fluency in English; additional language skills are a plus. Willingness to travel if necessary for specific activities. Desired Attributes: Possibility to impact how AI &amp; ML is run and governed in a large manufacturing company. Opportunity to take an active role in outlining architecture and processes. Ability to work with an international team."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69973-teknisk-specialist-2/",
    "roles": [
      "Teknisk specialist"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en engagerad och tekniskt kunnig tekniker med erfarenhet av telekomsystem, som ska stärka produktteamet för mobil konnektivitet. Huvudsakliga ansvarsområden: Som tekniker i produktteamet kommer du att spela en nyckelroll i etableringen av kundens egna 5G-nät. Dina arbetsuppgifter innefattar: Deltagande i implementeringen av pilot- och labbmiljöer. Implementering av 5G-nät på verksamhetskritiska platser, inklusive sjukhus. Skapa ny kompetens och utveckla arbetsmetoder för att säkerställa optimal nätverksprestanda. Säkerställa att lösningar och arbetsmetoder följer riktlinjer och mål som satts av Enterprise arkitektur (EA). Obligatoriska kvalifikationer: Relevant högskoleutbildning, till exempel en kandidatexamen i datavetenskap, systemutveckling eller motsvarande certifieringar och arbetslivserfarenhet. God förmåga att uttrycka dig i tal och skrift på både svenska och engelska. Kunskap om leverantörsrekommendationer för optimering av nätverksprestanda. Specifika kvalifikationer (krävs minst en av följande) Djupt kunnande inom datakommunikation Konfiguration, implementering och felsökning av routing, switching och brandväggar. Nätverksdesign. Quality of Service (QoS). Kärnnätskompetens Erfarenhet inom 4G/5G med fokus på &#8221;user-plane&#8221; (SGW/PGW eller SMF/UPF). Kunskap om en eller flera 3GPP-leverantörers kärnnätslösningar, främst inom &#8221;user-plane&#8221;-funktioner. Förståelse för APN/DNN och &#8221;network slicing&#8221; utifrån APN/DNN eller NSSF-slicing i 5G. Erfarenhet av konfiguration och hantering av trafikflöden kopplat till QoS-profiler och QCI, samt IP QoS/DCI. Förståelse för och erfarenhet av privata 5G-nät. Serverkompetens Erfarenhet av virtualisering. Goda kunskaper i Linux. Felsökning av servrar och nätverk. Linux-nätverkshantering, inklusive användning av verktyg som WireShark, tcpdump och netcat för nätverksanalys, routing och segmentering. Kunskap om radionät för LTE/5G/WiFi Meriterande kvalifikationer:  Erfarenhet av övervakning och hantering av radiobasstationer, radioenheter och antenner för att säkerställa hög prestanda. Förmåga att diagnostisera nätverksproblem och vidta åtgärder för att minimera påverkan. Erfarenhet av arbete i stora organisationer. Tidigare arbete hos telekomoperatörer eller telekomleverantörer. Dokumenterad erfarenhet av implementation av liknande komplex infrastruktur. &nbsp; Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69953-management-konsult-projektledare/",
    "roles": [
      "Managementkonsult",
      "Projektledare"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en som kan utveckla den finansiell styrmodellen (principer, processer, rutiner och rapportering) som stöttar IT-verksamhetens uppdrag och mål, och som främjar kostnadseffektivitet över tid. Styrmodellen måste utgå från organisationens förutsättningar, och behöver därför utvecklas med hänsyn till både bolagets affärsmodell och IT-verksamhetens arbetssätt. Du förväntas snabbt kunna sätta dig in i nuvarande styrmodell, förstå dess styrkor och svagheter samt utifrån verksamhetens behov ta fram förslag på justeringar av nuvarande styrning samt implementera nya processer och rutiner. Uppdragsgivare är CIO samt Chef Strategi &amp; Styrning, och du kommer samverka mycket nära med IT-ledningen samt Business Controlling. Profil &amp; Meriter: Minst 8 års erfarenhet som projektledare eller managementkonsult, med framgångsrika uppdrag inom process- och verksamhetsutveckling. Ekonomiutbildning och praktisk erfarenhet av finansiell styrning av en verksamhet, t ex som business controller Omfattande kunskaper om hur en IT-verksamhet fungerar Prestigelös, förmåga att kunna se och förklara komplexa samband, lösningsorienterad, van att hantera många stakeholders och rapportering till senior management."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69936-cloud-security-architect/",
    "roles": [
      "Cloud Architect"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Assignment Description: Our client is looking for a consultant to help define the next generation cloud security architecture. A hybrid architecture solution is envisioned, combining multi-cloud capabilities with on-premise solutions. This architecture includes the definition of appropriate and proportional security functions, along with the identification of relevant requirements. Experience &amp; Meriter: Enterprise security architecture for hybrid environments Security architecture for Microsoft Azure, On-prem and Google Cloud Platform Security functionality and tools supporting the Enterprise- and Cloud Security architecture Describing a technical and organizational transformation path from current state to the next generation architecture Documenting architectural frameworks and processes Facilitating and leading workshops with other experts Communicating with focus on explaining complex ideas and giving advice and feedback. Identifying security challenges and security risks within cloud security area"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69948-devops-engineer-20/",
    "roles": [
      "Ingenjör"
    ],
    "places": [
      "Ålesund",
      "Göteborg",
      "Hybrid",
      "Oslo"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en DevOps Engineer med gedigen erfarenhet av Remote Desktop och praktisk teknisk kompetens. Du kommer att ha möjlighet att arbeta antingen från Oslo, Ålesund eller Göteborg (Oslo eller Göteborg är att föredra). Tjänsten erbjuder en hybridlösning med cirka två dagar per vecka på deras kontor. Huvudsakliga ansvarsområden: Designa och implementera skalbara infrastrukturlösningar i Azure för att stödja både operativa och utvecklingsrelaterade behov. Använda övervakningsverktyg för att identifiera och lösa prestandaproblem samt säkerställa hög tillgänglighet, optimal prestanda och kostnadseffektivitet för applikationer och infrastruktur. Automatisera repetitiva uppgifter och processer med hjälp av skript och orkestreringsverktyg för att förbättra effektiviteten och minska risken för mänskliga fel. Implementera och underhålla säkerhetspolicys och rutiner samt genomföra regelbundna systemgranskningar för att säkerställa efterlevnad av de senaste säkerhetsstandarderna och branschpraxis. Vara en nyckelperson i incidenthantering, tillhandahålla tekniskt stöd och expertis för att snabbt och effektivt lösa operativa utmaningar. Främja en kultur av kontinuerlig förbättring och effektivitet genom att dela kunskap och vägleda teammedlemmar i DevOps bästa praxis och verktyg. Kvalifikationer: Högre utbildning inom relevanta IT-områden eller motsvarande arbetslivserfarenhet inom drift och underhåll av infrastruktur och plattformar i Azure. Stort intresse för att säkerställa säker och stabil drift. Ett naturligt engagemang för kontinuerlig professionell utveckling och lärande. Personliga egenskaper: Stark kommunikationsförmåga och förmåga att samarbeta väl i en teammiljö. Ledarskapserfarenhet och förmåga att ta ansvar. Hög uppmärksamhet på detaljer och ett analytiskt tillvägagångssätt. Engagemang för kontinuerlig professionell utveckling och lärande. Flytande kunskaper i norska och engelska, både i tal och skrift."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69927-devops-engineer-19/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Ålesund",
      "Göteborg",
      "Hybrid",
      "Oslo"
    ],
    "description": [
      "Oppdragsbeskrivelse På vegne av vår kunde søker vi nå en DevOps Engineer med solid erfaring innen Remote Desktop og praktisk teknisk kompetanse. Du vil ha mulighet til å jobbe fra enten Oslo, Ålesund eller Göteborg (Oslo eller Göteborg er foretrukket). Stillingen tilbyr en hybridløsning, med cirka to dager per uke på deres kontor. Hovedansvarsområder: Designe og implementere skalerbare infrastrukturløsninger i Azure for å støtte både operasjonelle og utviklingsrelaterte behov. Bruke overvåkingsverktøy for å identifisere og løse ytelsesproblemer, samt sikre høy tilgjengelighet, optimal ytelse og kostnadseffektivitet for applikasjoner og infrastruktur. Automatisere repeterende oppgaver og prosesser ved hjelp av skript og orkestreringsverktøy for å forbedre effektiviteten og redusere risikoen for menneskelige feil. Implementere og vedlikeholde sikkerhetspolicyer og prosedyrer, samt gjennomføre regelmessige systemrevisjoner for å sikre samsvar med de nyeste sikkerhetsstandardene og bransjepraksis. Være en nøkkelperson i hendelseshåndtering, yte teknisk støtte og ekspertise for raskt og effektivt å løse operasjonelle utfordringer. Fremme en kultur for kontinuerlig forbedring og effektivitet ved å dele kunnskap og veilede teammedlemmer i DevOps-beste praksis og verktøy. Kvalifikasjoner: Høyere utdanning innen relevante IT-studier, eller tilsvarende arbeidserfaring innen drift og vedlikehold av infrastruktur og plattformer i Azure. Stor interesse for å sikre sikker og stabil drift. Et naturlig engasjement for kontinuerlig faglig utvikling og læring. Personlige egenskaper: Sterke kommunikasjonsferdigheter og evne til å samarbeide godt i et teammiljø. Lederskapserfaring og evne til å ta ansvar. Høy oppmerksomhet på detaljer og en analytisk tilnærming. Engasjement for kontinuerlig faglig utvikling og læring. Flytende i både norsk og engelsk, muntlig og skriftlig."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69926-business-analyst-33/",
    "roles": [
      "Business Analyst"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning: För kunds räkning söker vi nu en Business Analyst till vår produktutvecklingsprocess. I rollen som Business Analyst kommer du, tillsammans med vår lösningsarkitekt, titta på befintlig produktutvecklingsprocess och bidra med konkreta förbättringsåtgärder. Du blir en del av förstudie och implementeringen av vår nya lösning samt säkerställer då att verksamhetens krav fångas in, att lösningen möter verksamhetens önskemål idag och imorgon samt att lösningen är praktisk ur ett användningsperspektiv. Du kommer även ha daglig kontakt med användare och verksamhet för att se till att verktyget utvecklas i takt med verksamhetens förändrade krav samt förblir tekniskt förvaltningsbar. Du agerar bryggan mellan IT och verksamheten genom att bidra till holistiskt perspektiv och transparens mellan de båda grupperingarna. Nyckelkompetens: God teknisk förståelse Kommunikativ Produktutvecklingserfarenhet God erfarenhet av kravinsamling Retail IT utveckling Meriterande kunskap: Projektledning Lösningsarkitektur"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69915-ad-adas-connectivity-and-maps-system-engineer/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking an experienced AD/ADAS Connectivity and Maps System Engineer. Main Responsibilities: Work as a team player in a cross-functional team. Contribute system engineering competence and experience from similar roles. Qualifications: Experience in coding from previous positions. Desired Attributes: Strong interest or passion for AD/ADAS (Autonomous Driving/Advanced Driver Assistance Systems). Desire to be part of the shift toward autonomous driving vehicles and the creation of new customer experiences."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69912-electronics-engineer-3/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking an Electronics Engineer. Main Responsibilities: Be part of the Electronics Engineering team for Core System Components, responsible for all existing and planned vehicles. Involve in electric, electronic, and mechatronic designs as well as software (SW) firmware. Collect, break down, and implement component requirements and technical documentation in cooperation with suppliers. Ensure that Analysis and Verification requirements are created, monitored, and implemented in collaboration with your team. Develop detailed solutions on PCB level, including electronics selection, for strategic components. Contribute to the system design for the Core System. Collaborate closely with the software development area to optimize solutions. Incorporate Functional Safety and Cyber Security throughout the development process. Engage in work from concept and architectural design to quality and maintenance of the product. Manage and perform Design Reviews for the assignment. Handle Change Management and support purchasing in supplier evaluation and selection. Required Qualifications: B.Sc. or M.Sc. in Electrical Engineering, Electronics, or Mechatronics. Knowledge and understanding of integrating electronics, functions, and architecture. Fluency in English (written and spoken). Clear communication skills, team spirit, and strong collaboration abilities. Additional Qualifications: Experience in cross-functional work within the automotive industry. Product development experience in fast-paced environments. Experience in electronics development or digital systems design engineering. Desired Attributes: Self-motivated, proactive, and with a strong drive to make a difference. Initiative and strong problem-solving skills. Strong team spirit with the ability to work effectively with diverse stakeholders."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69897-senior-devops-technician/",
    "roles": [
      "DevOps Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a senior DevOps technician living in or near Gothenburg to join their office on a regular basis. The team&#8217;s responsibility is to provide and maintain services such as: Artifactory (a binary management system) Black Duck (a software composition analysis tool) SonarQube (a static code analysis system) Polyspace Access (a presentation tool for Polyspace Bugfinder) These tools are used by several thousand developers within our client&#8217;s organization. The team is committed to improving and automating these services to enhance the lives of their users. Currently, the team consists of four DevOps engineers who specialize in technologies and platforms such as: Azure AWS Terraform Kubernetes Argo CD How they work: Collaborate closely with various stakeholder teams to better understand their needs. Improve key characteristics of the services offered, including user experience, performance, scalability, resource utilization, supportability, maintainability, and observability. Automate service management. Implement a GitOps approach to operations. Provide self-service options and documentation for end-users. Offer expert-level support for their services. Required Qualifications: Outspoken and willing to actively participate in brainstorming sessions. Proactive, with a knack for finding new solutions to technical challenges or improving ways of working. Curious, eager to learn, and able to think outside the box. A true team player with excellent communication and collaboration skills. Confident in working with Linux and Git. Solid understanding of CI/CD pipelines. Experience with Kubernetes and Docker. Good knowledge of Azure and/or AWS. Broad understanding of IT infrastructure and its components to help diagnose and resolve incidents affecting the tools. Additional Qualifications: Experience with Azure Cloud and Azure-managed services. Experience with the GitOps way of working. Expertise in Kubernetes. Experience with Artifactory, Black Duck, and SonarQube. Knowledge of Polyspace Access. Familiarity with high-availability applications. Proficiency in Python."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69904-pki-specialist/",
    "roles": [
      "PKI Specialist"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Ansvarsområden: Granska och utvärdera befintlig Microsoft-baserad PKI-lösning samt identifiera förbättringsområden. Samarbeta med infrastrukturleverantören för att bedöma och implementera föreslagna förändringar. Designa och strukturera en hållbar certifikatsinfrastruktur som möter företagets nuvarande och framtida behov. Leda projekt för att modernisera och implementera PKI-lösningar, från analys till drift. Säkerställa att interna team får rätt vägledning och kunskapsstöd för att långsiktigt hantera och underhålla den nya infrastrukturen. &nbsp; Vi söker dig som har: Gedigen erfarenhet av att implementera PKI-lösningar på flertalet företag. Erfarenhet av att arbeta med certifikathantering och certifikatstrukturer. God kunskap om Microsoft PKI-lösningar och infrastruktur. Förmåga att bedöma tekniska lösningsförslag och leda moderniseringsprojekt inom IT-säkerhet. Starka kommunikations- och samarbetsförmågor – du kommer att agera expert och stöd till både interna team och externa leverantörer."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69894-senior-data-engineer-5/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Senior Data Engineer within their Engineering Data Hub. This role is based in Gothenburg, and you will be expected to work primarily from their Gothenburg office. Our client is making bold digital visions come true, aiming to lead the automotive world by creating a digital ecosystem designed to simplify customers&#8217; lives. They are looking for curious, creative individuals who want to make a difference through innovative thinking. On a journey to redefine the automotive customer experience through digital technology, the focus areas include Electrification, Autonomous Drive, and Shared Mobility, all aimed at enabling personal, sustainable, and safe mobility. Software engineering is playing an increasingly important role, with more development being done in-house for better integration and continuous improvement. Their data vision focuses on driving innovation and decisions with trusted data, tackling challenges through robust designs and flexibility. As part of the Engineering Data Hub, you will join a fast-paced, fun environment where the mission is to deliver trusted data and insights to improve product performance, processes, and customer experiences. The data engineering team bridges the gap between data producers and consumers, aiming to enhance efficiency in data product creation and platform capabilities. Main Responsibilities: Provide support, guidelines, and best practices for creating and operating data products. Create and maintain data products based on business requirements. Collaborate with the Product Owner to ensure proper functionality, break down tasks, and plan sprints. Maintain the technical design within architectural guidelines and collaborate with stakeholders and system architects. Tech they use daily: Programming Languages: Python, Apache Spark, Bash Table Formats: Delta Cloud Platforms: Azure Data Platforms: Databricks, Snowflake Other Tools: Docker, GitHub Required Qualifications: Minimum 8 years of experience in related fields. Fluent in English, both verbal and written. Deep knowledge of modern data architecture principles. Extensive hands-on experience in data pipeline design, development, and operation. Comfortable working independently and collaboratively in an agile environment. Strong understanding of data modeling, data access, and data storage techniques. Experience with cloud technologies (Azure, AWS). Knowledge of data privacy and protection tools. Pragmatic approach to balancing ideal and functional solutions. Additional Qualifications: Knowledge of Software Engineering, System Design, SQL, Orchestration Tools (Airflow/Prefect/Dagster), Data Streaming (Apache Kafka), CI/CD, IaC, GitOps, DevOps, and Networking. Experience applying product thinking to data projects. Experience with data governance and modern data architectures such as data mesh. Experience creating reports to convey business insights. Desired Attributes: Proactive, problem-solver, and flexible team player. Eager to learn and handle daily challenges with a service-minded approach. Adaptable to a high-paced, fast-changing environment, driven by a sense of urgency and curiosity. Ability to build trust and influence others with a company-aligned mindset. Strong communication, analytical, and organizational skills. Automotive industry experience is meritorious."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69890-data-engineer-25/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking two Data Engineers to join their AD and ADAS Analytics team within the AD and ADAS Functions department, part of Safe Vehicle Automation. In this role, you will analyze and optimize data related to autonomous driving (AD) and advanced driver-assistance systems (ADAS), contributing to business objectives, performance tracking, and identifying areas for improvement. Our client is committed to leading in innovation, safety, and electrification. You will help develop advanced data-driven insights that shape the future of mobility. Our client aims to redefine car ownership and driving experiences by combining advanced technology with innovative services. The AD and ADAS Analytics team collaborates with leading industry partners to provide essential insights into AD/ADAS performance. You&#8217;ll develop and maintain data pipelines and dashboards that support key business decisions, ensuring world-class safety and performance in AD/ADAS functions. Main Responsibilities: Develop, maintain, and optimize data pipelines to handle large-scale fleet data related to AD/ADAS functions. Create and deliver dashboards that track business KPIs (e.g., crash boards, functional usage) and provide real-time insights. Measure and report on AD/ADAS business objectives, fulfillment, and performance trends. Collaborate with cross-functional teams to capture analytics requirements and drive data engagements. Use data-driven insights to support the safe and efficient launch of AD/ADAS functionalities. Required Qualifications: Strong experience in data engineering, with proficiency in Python, SQL, and cloud platforms (e.g., AWS, Azure, or GCP). Expertise in building data pipelines, ETL processes, and handling big data technologies (e.g., Hadoop, Spark). Familiarity with data visualization tools (e.g., Tableau, PowerBI) and real-time analytics. Experience in the automotive industry, especially AD/ADAS systems, is a plus. Additional Qualifications: Experience with fleet data collection and analysis. Strong analytical and problem-solving skills, with a focus on safety and performance metrics. This consultancy role offers an exciting opportunity to work with our client on cutting-edge technologies and contribute to the future of autonomous driving. Apply now to help shape the future of safe vehicle automation!"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69887-safe-system-engineer/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking an experienced engineer with competence in robust and safe system design to set the foundations of the AD/ADAS platform. The system design will be the basis upon which the AD/ADAS functions are built. Main Responsibilities: Contribute system engineering expertise in a cross-functional team. Secure the complete AD/ADAS domain functionality. Drive AD/ADAS needs toward the rest of the vehicle (e.g., steering, braking, HMI). Balance and design a scalable system over time. Collaborate closely with internal teams and external partners. Dive into areas such as fault/mode handling, SW allocation, diagnostics, requirement handling, robust interface design, System Safety (ISO26262), and configuration. Qualifications: Competence in robust and safe system design for AD/ADAS platforms. Strong understanding of how various AD/ADAS functions work and their needs. Previous experience in coding, with a desire to take the next step in your career. Ability to collaborate with other teams and partners. Confidence in addressing areas such as fault handling, SW allocation, diagnostics, System Safety (ISO26262), and robust interface design. Desired Attributes: Strong interest or passion for AD/ADAS and autonomous driving technologies. Enthusiasm for being part of the shift toward autonomous vehicles and new customer experiences. Team player with a collaborative mindset. Curiosity and confidence in deep diving into complex technical areas. A proactive approach to having fun and enjoying everyday challenges."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69884-test-engineer-hil-and-ci/",
    "roles": [
      "Test Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignemnt Description Our automotive industry client is in search of a Test Engineer with expertise in HIL and Continuous Integration (CI). Main Responsibilities: As a Test Engineer specializing in HIL, your role will involve the following tasks: HIL Rig Design and Maintenance: You will be responsible for developing, implementing, and maintaining Hardware-in-the-Loop (HIL) test rigs. This includes ensuring that they are continuously updated and able to simulate the necessary operational conditions effectively. Test Case Development and Automation: You will create and automate test cases across various environments, such as HIL, Model-in-the-Loop (MIL), and laboratory settings, ensuring the accuracy and consistency of test results. Support for System Testing: You will assist in testing the full system within vehicles, ensuring all integrated components perform correctly and meet the required performance benchmarks. Beta Testing and Feedback Management: You will manage beta testing activities and create a feedback loop based on data to assess system performance. This involves working with dashboards and metrics to facilitate efficient data collection and reporting. Enhancing Testing Efficiency: You will ensure the optimal use of testing setups to fully assess developed functionalities, with a focus on evaluating battery cell performance in areas like range, charging, and energy efficiency, all while maintaining safety and system dependability. Required Qualifications: At least 5 years of experience in electrical engineering and software development within the automotive sector. A minimum of 2 years of hands-on experience with battery-related software. A degree in electrical engineering or a related discipline. Strong programming skills in Matlab/Simulink, Python, and Azure. Proficiency in HIL development, particularly with tools like ETAS, Vector, NI, and Speedgoat, both in hardware and software. Desired Attributes: High initiative, effective collaboration skills, and a strong ability to work across teams."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69874-senior-platform-engineer/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Senior Platform Engineer within the Engineering Data Hub. This role is based in Gothenburg, and you will be expected to work most of the time from their office there. About Our Client Our client operates in the automotive industry and is making bold digital visions come true. They aim to lead the automotive world by creating a digital ecosystem designed to simplify their customers&#8217; lives. Their ambition is to redefine the customer experience in the automotive sector through digital technology. Key enablers in this journey include Electrification, Autonomous Drive, and Shared Mobility, all supporting the purpose of providing freedom to move in a personal, sustainable, and safe way. Focus Areas Software engineering is becoming increasingly important in the automotive industry. Our client is bringing more of their software development in-house to better manage continuous integration and handle the complex interactions between various functions. Their data vision centers on driving innovation and empowering decisions with trusted data, overcoming obstacles through innovative, robust designs, and preparing for future changes. Engineering Data Hub Department This department within Software Engineering has a mission to: Provide trusted data and insights to understand product and process performance. Enhance customer behavior insights for improved efficiency and customer experience. The department is growing and looking for curious, creative individuals who want to contribute to innovative thinking and change the world. Platform Operations and Engineering Team The team works to accelerate and streamline the use of data, analytics, and AI. They innovate and collaborate to offer a great user experience, providing a unified self-service platform. Main Responsibilities: As a Platform Engineer, you will: Design and build a platform to support the data and analytics capabilities of the client’s Engineering organization. Configure and set up cloud infrastructure, deploying and operating data-oriented applications on Kubernetes. Collaborate closely with other teams and platform users to: Gather requirements. Maintain seamless operations. As the platform is in its early development phase, you will have the opportunity to: Contribute to the platform&#8217;s foundation. Shape its future growth and success. Daily Used Tech: Languages: Python, Go Cloud Infrastructure: Azure, Kubernetes DevOps Tools: Terraform, Crossplane, GitHub Actions, Flux, Helm, Prometheus, Grafana, Vault PaaS: Databricks, Snowflake Required Qualifications: Experience with public cloud infrastructure (Azure, AWS, or equivalent). Implementation of scalable infrastructure through Infrastructure as Code (IaC). Experience with CI/CD tools (e.g., GitHub Actions, ArgoCD). Deployment and operation of applications and services on Kubernetes. Expertise in designing and implementing internal developer platforms. A minimum of 7 years of experience in related fields. Familiarity with Agile methods. Fluent in English, both verbal and written. Additional Qualifications: Expertise in networking, security, and reliability in enterprise cloud solutions. Experience with Big Data tools and technologies, including: Event streaming (e.g., Kafka, MQTT). Large-scale data processing (e.g., Apache Spark, Ray). Storage solutions for Big Data (e.g., Apache Iceberg, Delta Lake). Knowledge of user and device authentication, data and resource access control, and data privacy protection. Desired Attributes: Proactive, with a solution-oriented mindset. [&hellip;]"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69871-camera-systems-development-engineer-2/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a talented and driven Camera Systems Development Engineer (Focus Area: Verification) to join their Exterior Vision team, specializing in camera systems. In this role, you will play a crucial part in system design, ensuring that stakeholder and internal requirements are met to support the camera perception stack. You will also be instrumental in verifying and enhancing the capabilities of their exterior camera data providers at component, system, and vehicle levels. Main Responsibilities: Product Verification: Conduct comprehensive verification of the exterior camera data provider&#8217;s capabilities at various levels, including component, system, and in-vehicle. Test Management &amp; Maintenance: Develop, implement, and maintain testing procedures to ensure the highest quality and performance of their camera systems. Requirements Understanding: Gather and analyze stakeholder and internal requirements for the camera platform, ensuring they are effectively integrated into the perception stack. System Development Insight: Maintain a comprehensive understanding of the entire system development process, ensuring coherence across different components and systems. Document and report product status. Required Qualifications: Proactive and Driven: Possess a highly engaged and proactive personality, capable of taking charge of projects and driving them to successful completion. Collaboration: Enjoy collaborating with diverse teams and stakeholders to achieve common goals. Lifelong Learner: Demonstrate a commitment to lifelong learning and continuously seek ways to improve work efficiency. Team members are expected to: Help each other proactively. Step outside specific role-related tasks when needed. Prioritize actions that contribute to the team&#8217;s success, including coaching, supporting, and sharing development information and tasks. Educational Background: A degree is not mandatory if you can demonstrate a driven personality and technical competency. Interdisciplinary Interest: Enthusiastic about working in a dynamic, interdisciplinary technology field, integrating knowledge from various domains. Driving License: Hold a European B driving license. Additional Qualifications: Experience in the automotive industry. System Designing Tools: Familiarity with tools like Carweaver, DOORS, etc. Verification Tools: Experience with DSA, DLT, Prompt Command, Git, WinSCP, etc. Network Protocols: Understanding of Ethernet, TCP/IP, CAN. Operating Systems: Proficiency in Linux. Automotive Diagnostic Concepts. Version Control and CI Tools: Experience with Git, Gerrit, Jenkins. NVIDIA Automotive Hardware/Software Tools. Note: Not all of the additional qualifications are prerequisites. However, a willingness to learn and grow in these areas is essential."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69857-senior-plattformsansvarig-autentiseringstjanster-region-skane-avrop-925/",
    "roles": [
      "Systemspecialist"
    ],
    "places": [
      "Lund"
    ],
    "description": [
      "Uppdragsbeskrivning: Vi söker dig med universitets- eller högskoleutbildning i kombination med en bred teknisk kompetens och lämplig arbetslivserfarenhet. Självklart har du ett särskilt intresse för katalog och autentiserings tjänster. Vi ser också att du har erfarenhet från tidigare plattformsansvar eller liknande ansvar. Meriterande är erfarenhet av olika autentiseringstjänster: IDP, ADFS, Single Sign On och federationslösningar samt grundkunskap inom e-legitimation, stark autentisering och elektronisk identitetshandling som används för säker identifiering av både personer och system. Då vi arbetar enligt ITIL4 är tidigare erfarenhet och/eller certifiering i detta också ett mervärde, tillsammans med erfarenhet från att framgångsrikt ha samordnat flera olika parter, interna såväl som externa. För framgång i arbetet vill vi att du är strukturerad och försedd med förmågan att se saker ur ett helhetsperspektiv. Genom ditt processtänk och genom att planera och prioritera löser du såväl det långsiktiga strategiska arbetet såväl som de akuta situationer som uppstår. Du gillar att förvalta en plattform och du är både nätverkande, kommunikativ, pedagogisk och förstår vikten av att kvalitetssäkra genom bl. a.  dokumentation. Det är inte du som utför de tekniska delarna av plattformen, det har du leverantörer som ansvarar för, men du leder och ser till att rutiner och processer fungerar och löser problemen när de inte gör det. Du kommer att ha dialog med olika parter som befinner sig kunskapsmässigt på olika nivåer vad gäller teknik och IT och vi värdesätter därför din kommunikativa förmåga att &#8221;prata IT&#8221; så att alla förstår. Du har förmågan att uttrycka dig väl i tal och skrift både på svenska och engelska. Du ser till att övriga Region Skåne har tillgång till tjänster inom autentisering, auktorisering, legitimering, spärr, samtycke och logg med målsättningen att åstadkomma säker åtkomst och säker hantering av information och resurser. I dialog med våra leverantörer, ansvarar du för utveckling av de berörda plattformarna samtidigt som du säkerställer att de är stabila och funktionella. Du har god kunskap kring hur digitala certifikat används, vilka som utfärdar dem och vad som händer om certifikaten inte är korrekta. Självklart jobbar du med kontinuerlig tjänsteförbättring samt vidareutvecklar tjänsterna till verksamheterna i Region Skåne. Arbetet innebär således att även hantera den långsiktiga, strategiska planeringen. Dina främsta ansvarsområden är att: planera, organisera och leda genomförandet av aktiviteter inom dina ansvarsområden. identifiera brister och ta fram nya lösningsförslag samt ansvara för att de implementeras ge stöd till projektledare och systemansvariga under och efter införande av autentiseringstjänster Du har ett tätt samarbete med såväl leverantörer som med den egna och andra förvaltningar inom Region Skåne. Administration och drift är outsourcat till vår leverantör men du kommer att ha huvudansvaret för plattformarna och det är du som ser till att processer och rutiner följs och fungerar. Då tjänsten innebär många kontaktytor är det viktigt att du gillar att vara spindeln i nätet i kommunikationen med bl a användare, leverantörer och certifikatutfärdare. Upgraded People tillsammans med Region Skåne agerar i enighet med och står bakom EUs och Sveriges sanktioner mot Ryssland och de som omfattas av dessa. Det medför att leverantörer [&hellip;]"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69840-applikationsspecialist-vardapplikationer-2/",
    "roles": [
      "Applikationsspecialist"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en Applikationsspecialist för vårdapplikationer. Huvudsakliga ansvarsområden: Arbeta med förvaltning av applikationer som stödjer vårdens processer. Hantera supportärenden. Delta i ett eller flera projekt och uppdrag. Koordinera olika aktiviteter. Planera och genomföra uppdateringar av IT-komponenterna. Delta vid tester av nya versioner samt medverka vid felsökning av uppkomna problem. Underhålla relationer med grupper inom kundens digitalisering, systemförvaltningsgrupper samt externa leverantörer. Obligatoriska kvalifikationer: Avslutad eftergymnasial utbildning inom IT eller likvärdig IT-kunskap inom vården genom praktisk erfarenhet. Erfarenhet av Windows Server. Erfarenhet av Windows 11. Meriterande kvalifikationer: Eftergymnasial utbildning med inriktning på IT. God förmåga att upprätthålla och underhålla relevant dokumentation. Kunskap och erfarenhet av IT inom hälso- och sjukvård. Kunskap om GDPR och PDL. Erfarenhet av agilt arbete. Erfarenhet av hantering av programpaketering, distribution samt uppgraderingar. Personliga egenskaper: Erfarenhet och god förmåga att arbeta självständigt och ta egna beslut. God förmåga att arbeta i ett agilt team. Kommunicerar obehindrat på svenska, både i tal och skrift. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69824-scrum-master-enhet-identitet-behorighet-organisation/",
    "roles": [
      "Scrum Master"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en Scrum Master/Agil Coach. Det finns ett behov av stöd i form av Scrum Master och agil coachning för teamen inom enheten Identitet, behörighet och organisation (IBO). Teamen består både av interna resurser och ett antal konsulter i olika roller, som har påbörjat en agil transformation men behöver ytterligare stöd och utbildning för att genomföra omställningen och implementera Scrum-ramverket från grunden. Denna etablering är i linje med Koncernstab Digitaliserings pågående agila transformation där SAFe är det valda ramverket. Huvudsakliga ansvarsområden: Initiera och leda etableringen av ramverken SAFe och Scrum inom teamen. Arbeta aktivt som Scrum Master, inklusive: Boka och facilitera alla möten och aktiviteter kopplade till ramverket. Stödja förfining av Product Backlog (Definition of Ready). Säkerställa att Definition of Done uppnås efter varje sprint. Agera som agil coach genom att kontinuerligt vägleda och utbilda teamen i de agila värderingarna och Scrum. Införa och implementera verktygsstödet Azure DevOps. Utföra allt arbete som Scrum Master i enlighet med det Agila manifestet och i samarbete med kundens Agila kompetenscenter, som arbetar enligt SAFe-ramverket. Arbeta nära teammedlemmar som produktägare, lösningsarkitekt, verksamhetsrepresentanter, testare och utvecklare. På längre sikt bli en del av det Agila kompetenscentret tillsammans med andra agila coacher och medarbetare inom koncernstaben, där du kommer att coacha, utbilda och fungera som mentor för andra team. Obligatoriska kvalifikationer: Minst fem års erfarenhet i rollen som Scrum Master. Minst åtta års erfarenhet av att arbeta i utvecklingsprojekt enligt Scrum-ramverket. Erfarenhet av att själv ha genomfört flera etableringar enligt SAFe- och Scrum-ramverken inom olika projekt/team, både inom offentlig och privat sektor. Gedigen erfarenhet av agil coachning, exempelvis genom att skapa pedagogiskt material, riktlinjer samt utbilda och vägleda Scrumteam. Erfarenhet av att arbeta med krav i user story-format. Certifiering som Professional Scrum Master eller motsvarande. Erfarenhet av verktyg som Azure DevOps, JIRA eller liknande. Erfarenhet från projekt inom hälso- och sjukvårdssektorn. Erfarenhet av att arbeta i offentliga regionala organisationer. Erfarenhet av SAFe. Referenser från tidigare relevanta uppdrag. Omfattande erfarenhet av att etablera Scrum-ramverket i redan existerande projekt eller förvaltningsteam. Vana vid att hålla utbildningar och handleda inom både Scrum-ramverket och de agila värderingarna. Stor erfarenhet av att arbeta i komplexa agila projekt med många beroenden och intressenter. Meriterande kvalifikationer: Erfarenhet inom IAM/IGA och katalogtjänster. Kännedom om katalogtjänsten HSA. Erfarenhet av IT Service Management enligt ITIL-modellen. Erfarenhet av Miro. Erfarenhet av att arbeta som administratör i Azure DevOps. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69820-junior-electrical-designer/",
    "roles": [
      "Junior Electrical Designer"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Assignment Description: You are a key player in a development team that designs control cabinets for machines. Within the development team, the electrical designer collaborates with other specialists, such as software developers, project managers, scrum masters, and subject matter experts. A technical interest, curiosity, the ability to work independently, and experience in driving projects forward are essential. You will be working on-site at the client&#8217;s location 3-4 days a week. Valuable Experience: Practical experience in electrical and instrumentation/automation. Commissioning. CE Compliance. Marine design. Electrical design for machines. Risk analysis, safety design according to EN 13849, or 3D CAD in systems like Inventor or Pro Panel. Requirements: Electrical engineering education Experience with ePlan (CAD tool) Curiosity, drive, and engagement Desired skills &#8211; (not mandatory but beneficial if familiar with): Electrical design for machinery CE marking of machinery Marine applications and related certification processes through classification societies Design of safety circuits (EN 13849)"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69816-applikationsspecialist-vardapplikationer/",
    "roles": [
      "Applikationsspecialist"
    ],
    "places": [
      "Borås"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en Applikationsspecialist för vårdapplikationer. Huvudsakliga ansvarsområden: Koordinera arbetet med avveckling av enhetens system som ska ersättas av ett nytt vårdinformationssystem. Arbeta med förvaltning av applikationer som stödjer vårdens processer. Mycket av arbetet kräver koordinering av flera olika aktiviteter och kompetenser. Delta i tester av nya versioner samt planera och genomföra uppdateringar av IT-komponenter, samt medverka vid felsökning vid uppkomna problem. Delta i olika projekt och uppdrag. Etablera och underhålla relationer med förvaltningsorganisationen i verksamheten samt med interna och externa leverantörer. Hålla ihop förvaltningsgrupper med representanter från olika förvaltningar och arbeta utifrån beslutade planer. Utföra beredningsarbete eller utredningar tillsammans med kollegor. Obligatoriska kvalifikationer: Avslutad eftergymnasial utbildning inom IT. Tidigare erfarenhet av Windows Server, SQL Server och allmän databaskunskap. Tidigare erfarenhet av avvecklingsarbete av IT-system. Meriterande kvalifikationer: God förmåga att upprätta och underhålla relevant dokumentation. Kunskap och erfarenhet av hälso- och sjukvården. Kunskap om GDPR och PDL. Personliga egenskaper: Kommunicerar obehindrat på svenska, både i tal och skrift. Erfarenhet och god förmåga att arbeta självständigt och fatta egna beslut. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69812-oracle-epm-developer/",
    "roles": [],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Assignment Description: Our clients are looking for a consultant with at least 2–5 years of experience in Oracle EPM, preferably with experience in FCCS (Financial Consolidation Close). The role focuses on maintaining and developing financial solutions. To succeed in this role you need a strong analytical and technical skills are required, along with a solid understanding of business and financial processes. Experience working with complex system solutions like Oracle EPM is essential. You will work as a specialist, responsible for both maintaining existing systems and implementing new solutions. The role is broad and includes managing incidents and addressing general inquiries. The team works in an agile way, and the entire environment follows an agile methodology. It is also important that you are a good team player and accustomed to working in teams. Requirements: Solid experience with Oracle EPM Comfortable working broadly, able to handle both communicative and technical aspects Previous experience working with various financial systems Previous experience working with financial functions Education in a relevant field, such as finance Not afraid to jump in and take initiative Fluent in English You will be working on-site at the client&#8217;s location Additional Merits: Experience with FCCS Good understanding of Swedish Experience with group accounting"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69806-business-analyst-within-it/",
    "roles": [
      "Business Analyst"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning: För kunds räkning söker vi nu en Business Analyst där du kommer spela en central roll i deras omställning till framtida betalningslösningar. Du samarbetar med flera team för att samla in och skriva krav tillsammans med olika intressenter. Du kommer att arbeta tvärfunktionellt med flera team och ha möjlighet att samarbeta med fler än 10 andra Business Analysts. Även om teamet har en öppen och samarbetsinriktad kultur, kommer du att kunna arbeta självständigt och styra ditt eget schema. Du kommer att vara på plats hos kundens lokaler 2–3 dagar i veckan för att säkerställa en nära och effektiv samverkan med deras team. Dina huvudsakliga ansvarsområden: Leda, koordinera och driva kravanalyser och förbättringsarbete. Samla in, analysera och översätta verksamhetsbehov till funktionella och systemkrav. Kommunicera med intressenter på alla nivåer (från verksamhets-/driftsexperter till produktledning, arkitekter, utvecklingsteam, QA och ämnesexperter) Kompetenskrav: Minst 15 års erfarenhet som Business Analyst inom IT, med erfarenhet från en agil miljö och vana vid att dokumentera krav strukturerat. Erfarenhet från finanssektorn, särskilt betalningsområdet Teknisk bakgrund, gärna tidigare arbetat som utvecklare eller testare Van vid att arbeta direkt med utvecklingsteam, med fokus på backend Erfarenhet av att samla krav direkt från intressenter, till exempel via workshops. Van vid att arbeta med flera initiativ/projekt samtidigt och i komplexa system/projekt. Stark problemlösningsförmåga, strukturerad, och med hög detaljmedvetenhet. Erfarenhet av att samordna och nätverka samt använda kommunikationsfärdigheter i stakeholder management. Du är drivande, tar initiativ och kan definiera uppgifter även när de är oklara Pragmatisk, flexibel och prestigelös Flytande svenska och engelska. Meriterande: Erfarenhet av att arbeta med krav under genomförandefasen av betalningar."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69675-handledare-till-utredningsenhet-barn-unga-och-familj/",
    "roles": [
      "Handledare"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning Beskriv behovet av konsultstöd Att handleda socialsekreterare inom utredningsenhet barn, unga och familj i Lidingö stad. Ärende- och processhandledning med kompetens inom Signs of Safety förhållningssättet. Uppskattad tid i timmar för uppdraget: 3 timmar per tillfälle. En gång var fjärde vecka. Handledare för socialsekreterare inom utredningsenhet barn, unga och familj i Lidingö stad. Ärende- och processhandledning med kompetens inom Signs of Safety förhållningssättet. Distansarbete Konsult behöver arbeta 100% på plats Handlingar som ska ingå i offert: &#8211; CV &#8211; Referensförteckning &#8211; Certifikat &#8211; Pris Skallkrav God och långvarig kunskap om socialtjänst och barn- och ungas utveckling Erfarenhet av processhandledning i ärenden med en grupp utifrån olika teman Kompetens inom förhållningssättet Signs of Safety Övriga krav Bifoga två (2) referenser &nbsp; För att kunna ansöka för detta uppdrag måste du vara en registrerad användare i vår portal som är helt kostnadsfri. Är du ny användare och vill registrera dig eller ditt bolag i Upgrades portal klicka här: https://portal.upgraded.se/"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69652-senior-software-developer-for-sw-platform-2/",
    "roles": [
      "Developer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Senior Software Developer for their software platform. Our client is at an exciting point in their transformation from traditional cars to a fully electric architecture. This will be a challenging journey, and they hope you would like to be part of it! They are developing new technologies to lead in safety, autonomous driving, and electrification. If you want to grow alongside talented individuals creating the future of automotive technology, this could be the right opportunity for you. Core System Components (ARTCSC) Department At the Core System Components (ARTCSC) department, within Software &amp; Electronics Platforms, they develop Zone Controllers for the new platform. This is the biggest challenge for the new platform, as they will launch the base software for new multi-function units. These units will include: Body Controllers I/O Controllers Electrical Power Distribution Units Gateways Electrical Power Supply Units They work with solutions from early concept stages to industrialization and follow-up in the field. The teams configure and develop the AUTOSAR-based software stack (BSW) in close cooperation with suppliers and external teams. They are involved in the entire process, from implementation to verifying and delivering the complete ECU for manufacturing. Main Responsibilities: As a Senior Software Developer for ARTCSC nodes, your key responsibilities will include: Creating the next generation of Zone Controllers/Body Controllers while maintaining current ECUs in production. Planning test activities and ensuring the necessary equipment for testing. Defining the Software Architecture and Implementation Strategy, from configuring the BSW to delivering applications for use in vehicles. Supporting teams in defining, exploring, and implementing enablers. Providing oversight and guidance while fostering a quality-first culture using modern tools and technologies. Leading software stack configuration development and ensuring integration with other ECU components. Contributing to the development of an automated workflow for continuous integration and testing of new software. Collaborating closely with internal and external experts to enhance long-term development and expand knowledge across various fields. Qualifications: To succeed in this role, you should have: Extensive experience as a Senior Software Developer, particularly in Core System Components. Fluency in English, both written and spoken. Expertise in AUTOSAR, which is the primary operating system. A broad and deep understanding of relevant technologies, including: Hardware (HW) Software (SW) Continuous Integration (CI) System Safety Additional Qualifications: Experience in the following areas is considered a plus: Embedded Software Development Configuration Management Software Software Release Processes Python Programming CAN and Automotive Ethernet Communications Hardware-in-the-Loop (HIL) Systems and Real-Time Simulation Continuous Integration, Verification, and Development Platform Development Proven ability to develop and maintain long-term roadmaps and technical evolution plans Desired Attributes: Curiosity, positivity, and a strong drive to engage with and support teams and individuals. Excellent communication skills, with the ability to balance the needs of different stakeholders. A passion for implementing architectural visions and the ability to build both formal and informal relationships inside and outside the organization. Strong technical ability and expertise to evaluate system and function alternatives, understanding the full consequences of different [&hellip;]"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69645-senior-systemutvecklare-3/",
    "roles": [
      "Systemutvecklare"
    ],
    "places": [
      "Norrköping"
    ],
    "description": [
      "Uppdragsbeskrivning På kunds räkning söker vi en senior systemutvecklare med dokumenterad erfarenhet enligt skall-kraven till plattformsteamet på digitaliserings- och utvecklingsavdelningen. Du kommer att ingå i ett team som ansvarar för att arbetet som systemutvecklare hos vår kund ska vara så friktionsfritt som möjligt. Teamet levererar delar av det man kan kalla ”IT for IT”. Fokus för teamet är att utveckla och underhålla plattformar för Continuous Integration/Continuous Delivery (CI/CD), verktyg för visualisering, källkodshantering, metoder för bättre testautomation samt den lokala utvecklingsmiljön som våra utvecklare använder. Vi arbetar med ett stort fokus på automation och kvalitetssäkring. Skall-krav 3 års arbetslivserfarenhet av DevOps 3 års arbetslivserfarenhet av agila metoder. 3 års arbetslivserfarenhet inom utveckling av mikrotjänster i en mikrotjänstarkitektur. 3 års arbetslivserfarenhet av containerplattformar (Kubernetes eller Docker). 3 års arbetslivserfarenhet av Continuous Integration/Continuous Delivery (CI/CD). 3 års arbetslivserfarenhet av Linux. 3 års arbetslivserfarenhet inom utveckling av plattformsprodukter och utvecklingsverktyg. Bör-krav Du bör ha arbetslivserfarenhet av JavaScript. Du bör ha arbetslivserfarenhet av utvecklingsverktyg för frontend-utveckling t.ex. lokal Kubernetes och WSI. Distansarbete Möjlighet till distansarbete kan finnas upp till 49% av uppdragstiden efter överenskommelse."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69630-senior-fpga-engineer/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Oslo"
    ],
    "description": [
      "Oppdragsbeskrivelse For vår kunde søker vi nå en erfaren Digital Designer med kompetanse innen VHDL/Verilog (FPGA). For å møte økt etterspørsel etter FPGA- og sikkerhetskompetanse i deres produkter, utvider de deres ekspertområde med en erfaren FPGA-utvikler. I denne rollen vil du inngå i et prosjekt- og utviklingsteam som jobber med egne produkter og løsninger, designet for å imøtekomme kritiske sikkerhetsinteresser både nasjonalt og internasjonalt. Du vil få utfordrende oppgaver innen digital design, produktutvikling og FPGA. Med et stadig mer komplekst trusselbilde og avanserte digitale angrep stilles det høye krav til sikkerhetsløsninger. Deres produkter, løsninger og tjenester beskytter nasjonale og internasjonale interesser mot dagens og fremtidens cybertrusler. De har over 60 års erfaring med å utvikle og levere helnorske sikkerhetsprodukter til forsvarssektoren, offentlig sektor og privat næringsliv. Nå har du muligheten til å bidra til utviklingen av fremtidens cybersikkerhetsløsninger. Arbeidsoppgaver: Støtte systemarkitekter og fungere som en løsningsressurs innen ditt ekspertområde Utarbeide løsningsbeskrivelser, kravspesifikasjoner og delsystemdesign for FPGA Design, implementering og verifisering av FPGA Videreutvikling av eksisterende produkter Systemmodellering Obligatoriske kvalifikasjoner: Mastergrad eller annen relevant høyere utdanning; erfaring kan kompensere for manglende utdanning Minst 10 års erfaring fra utviklingsprosjekter innen innebygd elektronikk (integrasjon av elektronikk, FPGA og programvare) Kjennskap til og interesse for kryptografi og sikkerhetskritiske funksjoner i FPGA er en fordel Evne til å arbeide selvstendig, samtidig som du trives med samarbeid og deling av kunnskap For å være kvalifisert for stillingen må du være norsk statsborger og kunne sikkerhetsklareres og autoriseres for nivået HEMMELIG og NATO SECRET med spesielle instrukser fra Nasjonal Sikkerhetsmyndighet. Ønskede kvalifikasjoner: FPGA fra Xilinx MPSoC og Microchip UVVM Questa Høyhastighetsdatabusser VHDL/Verilog – Detaljert FPGA-design og implementering Nettverksprotokoller og nettverksteknologi (IP) Personlige egenskaper: Gode kommunikasjonsevner, både skriftlig og muntlig, på norsk og engelsk Engasjert, fleksibel og pålitelig"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69637-senior-net-utvecklare-6/",
    "roles": [
      ".NET-utvecklare"
    ],
    "places": [
      "Uppsala"
    ],
    "description": [
      "Uppdragsbeskrivning På kunds räkning söker vi nu en senior .NET-utvecklare under minst ett år för att arbeta med utvecklingen av vår kunds nya system för provtagningsprogram. Systemet byggs i .NET med React som frontend, och är datatungt, vilket innebär att du bör ha gedigen erfarenhet av att hantera komplexa datamodeller. Uppdraget innebär nära samarbete med tre andra systemutvecklare och du kommer ingå i ett team bestående av en scrummaster, kravanalytiker och testare. För integrationer använder vår kund för närvarande Lobster Data som plattform. Skallkrav: Du ska ha kompetens nivå 4 eller 5 Djup kompetens och lång erfarenhet i .net Ha kompetens kring databaser (SQL) Flera års praktisk erfarenhet av React Meriterande: Erfarenhet av Lobster Data eller liknade plafformat Erfarenhet av att arbeta med integrationer är meriterande Kännedom om Azure Erfarenhet av förvaltningsarbete enligt PM3-modellen Erfarenhet av att arbeta med Data Warehouse"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69631-avtalscontroller-samhallsutvecklingsforvaltningen/",
    "roles": [
      "Avtalscontroller",
      "Controller"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning Avropet omfattar en (1) resurskonsult till 100 % av en heltidstjänst för utförande av beskrivet uppdrag (160 timmar per månad), under 12 månader, därefter med option att justera till en 50% tjänst i dialog mellan beställare och leverantör. Uppdraget förväntas pågå enligt nedan angiven kontraktstid men med uppsägningstid på 2 månader för beställaren. Uppdraget som avtalscontroller handlar om att koordinera och leda SUFs (Samhällsutvecklingsförvaltningen) arbete med avtal, i detta ingår löpande förvaltning och uppföljning av tilldelade avtal. Analysera genomförda upphandlingar för att hitta förbättringsområden samt bidra till utvärderingsprocessen vid pågående upphandlingar. Förväntat resultat Genomföra utredningar av leverantörer och säkerställa att de under avtalsperioden uppfyller t ex. kreditvärdighet, försäkringskrav och i avtalet överenskomna nivåer. Utifrån interna kontrollrutiner genomförs årligen stickprovskontroller på ingångna avtal mot en på förhand framtagen checklista. Leda och vara kallande i entreprenadupphandlingsrådet som samlar förvaltningens avdelningar. Vidare innefattar tjänsten att säkerställa att samtliga krav i avtalen uppfylls och att rutiner och processer internt på förvaltningen följs och att avvikelser hanteras på rätt sätt. Stötta vid uppföljnings- och driftsmöten. Ansvarig för indexering av ramavtal samt vår interna avtalsdatabas. Säkerställa att aktiva beslut om avtal tas av avtalsägaren, säga upp eller förlänga enligt respektive avtalsperiod. Vara ett stöd till avdelningarna vid direktupphandlingar och avrop från befintliga avtal. Stötta avtalsägare och avtalsförvaltare med frågeställningar med anledning av upphandlingar och tecknade avtal. Projektorganisation Konsulten rapporterar till administrativa chefen SUF. Säkerhetskrav Om konsult anser att uppgift(er) i offert omfattas av sekretess ska detta anges med utförlig motivering i offerten. I annat fall förutsätts att anledning till sekretess saknas. Uppgifter som anses sekretessbelagda kan med fördel lämnas i separata bilagor. Hantering av personuppgifter Sedvanliga personuppgifter som finns i avtal och inom en förvaltning vid kommunikation internt och externt, inga känsliga eller säkerhetsskyddade personuppgifter eller uppgifter kommer att hanteras. Handlingar som ska ingå i offert: &#8211; CV &#8211; Referensförteckning &#8211; Pris Skallkrav Relevant högskoleutbildning: Konsulten ska inneha en examen från högskola eller universitet inom områden som ekonomi, juridik, offentlig förvaltning eller annan relevant utbildning kopplad till avtalsförvaltning och upphandling Minst 1-3 års erfarenhet av liknande arbetsuppgifter: Konsulten ska ha arbetat som avtalscontroller, upphandlare eller liknande roll i minst 1-3 år. Under denna tid ska konsulten ha genomfört ett flertal uppdrag som innefattar avtalsuppföljning, upphandlingar och avtalsförvaltning Erfarenhet av uppföljning och förvaltning av avtal: Konsulten ska ha dokumenterad erfarenhet av att följa upp ingångna avtal, inklusive att säkerställa leverantörers efterlevnad av avtalade krav samt hantera eventuella avvikelser och förlängningar av avtal Kunskap om Lagen om offentlig upphandling (LOU): Konsulten ska ha goda kunskaper i LOU och kunna tillämpa denna lag i sitt dagliga arbete Erfarenhet av avtalsdatabas och system för avtalsadministration: Konsulten ska ha erfarenhet av att arbeta i TendSign och Kommers Börkrav Meriterande med utbildning inom upphandling eller avtalsrätt Meriterande med specifik utbildning eller kurser inom offentlig upphandling (LOU), avtalsrätt eller motsvarande Meriterande med certifieringar inom upphandlings- och avtalsområdet, såsom CIPS (Certified International Procurement Professional) eller liknande, är önskvärda men ej obligatoriska Meriterande med erfarenhet av offentlig sektor: Erfarenhet av arbete inom offentlig sektor [&hellip;]"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69624-software-engineer-111/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a professional for the role of SW &amp; Electronics Core System (ART CIS). In the execution of their development strategy, there is a need to focus on balancing and securing system characteristics for the Core System, including all applications (i.e., “SW-on-HW Core System”). The distributed way of working emphasizes the need for centralized guidance and quality assurance. This centralized guidance is hosted and driven by the SW &amp; Electronics Core System (ART CIS), with the following main responsibilities: Setting, guiding, driving, and safeguarding the coherence to the strategies and architecture to ensure Core System quality and performance. Managing and balancing shared Core System resources. Ensuring integration, testing, troubleshooting, and optimization for the shared Core System resources. Running release and lifecycle management. Main Responsibilities: As part of an agile team utilizing the SAFe methodology, your responsibilities will include: Managing the shared Core System resources (memory, CPU, wake-up times, etc.). Guiding, driving, and safeguarding the systemization of the “SW-on-HW Core System” (Platform + all Apps) by: Defining the architecture. Providing core-specific requirements. Offering a framework with design principles and patterns (including WoW). Nurturing and optimizing the Core System product. Defining and monitoring KPIs to measure trends and system characteristics. Managing quality indicators and handling technical debt. Initiating or motivating refactoring when necessary, with the goal of optimizing product performance. Required Qualifications: M.Sc. in Electrical or Software Engineering or equivalent relevant experience. Relevant experience in designing and/or defining software architecture, principles, and patterns for embedded systems. A genuine interest in technical areas related to Software and Electronics Architecture. Strong communication skills in both written and spoken English. Solid foundation in software design, with the ability to define and break down strategies into patterns or detailed requirements. Expertise in facilitating planning, tracking, and scheduling implementations/deliverables. Ability to develop strong working relationships with development teams, software engineers, and other stakeholders. Additional Qualifications: Strong technical background in Embedded Linux, QNX, and general POSIX, with excellent IT skills. Experience in coding, object-oriented design, and design patterns. Ability to develop a unified vision for software characteristics and functions. Experience working with platform features and throughout the full software development lifecycle, including problem definition, design, development, and release. Knowledge of memory, CPU, and wake-up time optimization for Core Systems. Experience defining and monitoring KPIs for system performance and quality indicators. Ability to handle technical debt and initiate or motivate refactoring when necessary."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69608-harness-design-engineer/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client, a leading company in the automotive industry, is seeking a Harness Design Engineer. They believe that curiosity and a commitment to understanding people are key drivers of future success. The company is made up of individuals who care about others, collaborating to develop new technologies and innovations that promote safe, sustainable, and convenient mobility. The EDS Uni &amp; Floor harness team is part of the broader Electrical Infrastructure Department. This team is responsible for the mechanical design and development of a vehicle&#8217;s electrical nervous system—specifically Uni &amp; Floor harnesses. As the ideal candidate for this position, you will have the opportunity to play a key role in the company&#8217;s success in this area. You’ll also gain hands-on experience with the tools, methods, and processes necessary for creating wiring harnesses that support the implementation of electrical vehicle features. Beyond increasing your technical expertise, you&#8217;ll have the chance to expand your industry network. Main Responsibilities As a Wiring Harness Design Engineer, you will: Define and develop future galvanic electrical structures for the company. Focus on the design and development of harnesses within the Cabin area. Mechanically route and physically connect electrical components using wiring bundles. Ensure compliance with electrical performance, EMC, and quality standards. Work on designs that are manufacturable by suppliers and easily assembled in vehicle assembly plants. Develop virtual harness models and create corresponding 2D/3D drawings for specification. Coordinate with suppliers to ensure top-quality harnesses are produced based on your designs. Verify harnesses to ensure robust functionality. Collaborate with a highly effective team, contributing to continuous development and finding new ways of working to remain industry leaders. In addition, you will: Lead and drive the design and development of wiring harnesses. Conduct investigations and verification of harnesses to meet reliability, cost, and performance goals. Contribute to team efforts in developing cross-platform solutions. Required Qualifications Proven experience in the design and mechanical installation of wiring harnesses, materials used in electrical distribution systems, and vehicle functions supported by specific harnesses. Competence in delivering major or complex development tasks, including harness design, in a cross-functional team environment. Extensive experience with the following software tools: Catia V5 (including Electrical Workbench), 3DPMI, Capital Design, TCe and TC Vis, System Weaver or Car Weaver, EiDB, KDP and PCT. Familiar with VPDS framework and release processes, ensuring smooth product flow and delivery. Degree in Electrical/Mechanical Engineering (BS or MS) or equivalent technical education in relevant fields such as Mechatronics, or experience of similar competency level. Additional Qualifications Knowledge of Electromagnetic Compatibility (EMC) principles and their application in harness design. Understanding of electrical performance, system design, and related complexity management. Experience with Routing Quality Assessment (RQA), FMEA, and validation processes for electrical systems. Skilled in Continuous Integration practices, test object builds (bench, riggs, prototype cars, etc.), and working in agile environments focused on ongoing improvements. Desired Attributes Ability to organize and lead teams, coaching team members, and working effectively across various functions and with external stakeholders. Capable of acting as a tutor or mentor [&hellip;]"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69596-software-test-engineer-11/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Software Test Engineer. As the industry evolves, competition now includes both traditional automakers and innovative tech companies. The client&#8217;s vision centers on maximizing the appeal of car ownership and use, enabling advanced connectivity in vehicles, and continuously enhancing the user experience for both new and existing models. This is an exciting opportunity to contribute to the development of the next-generation infotainment system built on Google’s Android Automotive OS. At our client’s company, quality is more than a metric—it’s a mindset deeply rooted in their culture and their respect for customers. If you&#8217;re passionate about delivering high-quality software products and meeting customer needs, we invite you to join their talented team of developers in Gothenburg! Main Responsibilities: As a Software Test Engineer, your key responsibilities will include: Creating and executing detailed test plans and test cases. Tracking and managing software bugs, collaborating with developers to resolve them. Conducting regression testing to ensure product stability. Building and maintaining automated test scripts. Participating in code reviews and improving testing methodologies. Working with continuous integration systems to enable seamless software deployment. Required Qualifications: A Bachelor&#8217;s degree in Engineering or equivalent professional experience. Proven experience in quality assurance of complex embedded systems. Familiarity with test automation tools such as Pytest, Robot Framework, and Selenium. A valid Swedish driver’s license (Category B). Knowledge of tools like CANoe and CANalyzer (advantageous). Additional Qualifications: Prior experience in the automotive and infotainment systems fields will be considered highly beneficial. Desired Attributes: Customer-focused: Passionate about creating solutions that enhance the lives of users. Strong analytical skills: Capable of evaluating complex problems and identifying effective solutions. Curious and creative: Eager to explore new ideas and think outside the box. Collaborative: Able to work harmoniously with cross-functional teams to achieve shared objectives."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69579-senior-software-developer-c-software-download/",
    "roles": [
      "C++ Developer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is looking for a Senior Software Developer C++ &#8211; Software Download. The vision of the client is to create a personal, sustainable, and safe mode of transportation for families, friends, and children. They are building a self-driving, fully electric, connected, and secure car. To contribute to this innovative journey, they are seeking curious and creative individuals who are eager to be part of their forward-thinking development. Software Download (SWDL) Team You will join the Software Download (SWDL) team, an agile development group with strong team spirit. This team is responsible for: Designing and verifying Software Download technologies Developing the One SWDL Engine (in C++), a unified software module used across various phases such as development testing, vehicle implementation (in the client&#8217;s new Core System Platform), production, and aftermarket services The team works closely with: Various system areas within the vehicle Customer service departments Manufacturing engineering Joining this dynamic team will provide you with access to long-term development opportunities in a continuously growing, fast-paced environment. The SWDL team is part of the Base Technology Solutions agile release train, which supports all electronic control units within the electrical system. Their mission is to provide common solutions for R&amp;D development departments, aimed at reducing complexity, lowering costs, and increasing development speed. Main Responsibilities: In this role, you will contribute to the mission of enhancing the customer experience by: Developing the One SWDL Engine software component Using your expertise to help shape the development of cutting-edge automotive technology Required Qualifications: Minimum 5 years of experience with C++, Linux, and GIT Proven skills in creating software architecture and developing technical roadmaps A M.Sc. or B.Sc. degree in Software Development, Software Engineering, or equivalent Additional Qualifications: Familiarity with agile development practices Experience with software development best practices Knowledge or experience in: Python C Gerrit Jenkins Android DoIP (Diagnostics over Internet Protocol) Software testing Continuous Integration (CI) Desired Attributes: Strong customer focus and results-oriented mindset Ability to deliver high-quality work even in uncertain situations Flexible and adaptable to changing environments Excellent communication and documentation skills Positive, collaborative attitude and a team-player mentality Analytical mindset, adept at solving complex problems with a clear understanding that there are multiple solutions to a problem Fluent in English with the ability to communicate effectively with diverse stakeholders"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69567-verification-and-integration-engineer/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry  is currently seeking a Verification and Integration Engineer to join their team. They believe that curiosity and a genuine commitment to understanding people are essential for future success. As a team that deeply values collaboration, they work to create new technologies and innovative solutions with a focus on human-centered design. Our client recently launched its first fully electric vehicle and is aiming to electrify its entire range by 2030. Electrification is a key element in the company’s strategy, and they are fully committed to sustainability. However, they also recognize that electric vehicles are just one piece of the sustainability puzzle. With this in mind, they aim to provide customers with optimized energy solutions for their homes, helping to reduce both carbon emissions and electricity costs. External Energy Systems Team The External Energy Systems team is responsible for developing innovative, out-of-vehicle solutions, including: Wall boxes Energy storage systems Vehicle-to-Grid (V2G) solutions This team is part of the broader Energy division and collaborates closely with various departments, including the Charging, Battery, App, and Cloud teams. Together, they are responsible for delivering both AC and DC charging solutions, as well as internal and external energy management systems for vehicles. Emerging technologies, such as V2X, smart charging, and wireless charging, are on the horizon and will soon be integrated into the product lineup. The External Energy Systems team is growing, and their work will become increasingly significant as the company moves forward. Their goal is to provide customers with safe and sustainable charging options, alongside seamless integration with smart energy management systems. To achieve this, they are dedicated to continuously improving their software and hardware capabilities—and this is where they need your expertise! Main Responsibilities As a Verification and Integration Engineer, you will: Lead the testing of components, systems, and the overall ecosystem. Bring your expertise in testing components such as wall boxes, electric converters, battery systems, and related communication systems. Collaborate closely with multiple teams and external suppliers, ensuring effective communication, flexibility, and openness. Take ownership and drive progress in a technology area that is still evolving, requiring high personal initiative and responsibility. Qualifications: Experience with OEMs in the home energy sector (EV charging, energy management, solar power, energy storage). A BSc/MSc degree or several years of relevant work experience. Background in software and/or hardware development. Knowledge of public and private charging solutions (highly valued). An innovative mindset. Fluency in English (both written and spoken). A valid driver’s license (B). Desired Attributes: Be passionate about energy solutions and vehicles from both technical and customer perspectives. Demonstrate high levels of engagement and enthusiasm. Excel in cross-functional collaboration, networking, and communication, as they will work with a range of internal and external stakeholders. Be organized and possess strong planning skills to guide development in the right direction."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69542-test-engineer-complete-vehicle-verification-2/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Borås"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Test Engineer – Complete Vehicle Verification. At our client’s engineering division, you will be a key contributor to the next generation of outstanding luxury cars. Alongside engineers from around the world, you and your team will create innovative, human-centric car technology that simplifies life and enhances enjoyment for people. Verification and validation at the proving ground is an integral part of the client’s development process. Durability, comfort, performance, reliability, and safety are continuously tested on their tracks, which operate around the clock. The Complete Vehicle Testing team currently consists of 23 people, including both engineers and technicians. They handle preparation, hardware and software updates, analysis, and reporting from verification activities related to complete vehicle testing, focusing on durability, function, and infotainment testing. Testing is conducted year-round on the Hällered Proving Ground tracks. Main Responsibilities: Collaborate closely with vehicle technicians and test drivers for fault reporting and analysis. Lead improvement initiatives based on data and develop new testing methods. Build a professional network within the company, running cross-functional initiatives to enhance vehicle testing efficiency. Prepare and coordinate vehicle testing activities on test tracks. Take technical responsibility for vehicle system areas, including high-voltage components (e.g., high voltage battery, inverter, DC/DC converter). Conduct first-level analysis of identified issues within your technical responsibility area. Create and manage fault reports based on issue analysis. Maintain close collaboration with technicians and test drivers regarding vehicle testing. Required Qualifications: B.Sc. in Mechatronics, Electronics, or a related field. Fluent in English, both spoken and written. Swedish Driving License (Class B). Experience working with automotive power electronics. Programming and application development experience (meritorious). Experience in data collection and handling (meritorious). Master’s degree in related areas (meritorious). Desired Attributes: Positive and proactive attitude. Ability to work in teams. Structured and organized approach. Strong sense of quality. Innovative mindset. Vision and Environment: At our client’s corporation, the vision is to become ”the world’s most progressive and desired luxury car brand” by simplifying people’s lives. The company is driven by bold goals related to innovation, sales, and customer satisfaction. They are seeking passionate, business-minded individuals who share this vision. You will be part of a dynamic, global, and respectful environment where creativity, energy, and a drive for innovation are highly valued. The company is committed to helping you reach your full potential and advance your career. Join them on this exciting journey into the future!"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69538-software-developer-15/",
    "roles": [
      "Developer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is seeking a Software Developer to strengthen their Core System Application Integration team within the field of test environment development. The role focuses on designing new test rigs, developing and maintaining CI infrastructure, and creating, executing, and analyzing automated tests for a newly developed platform within the Software &amp; Electronic Platform organization. If you are passionate about making a difference, enjoy the challenge of building Core System Application Integration from the ground up, and wish to influence your work in a dynamic team, this could be the perfect opportunity. Core System Application Integration The Core System Application Integration team is an agile, tightly-knit group focused on building test environments for new platforms and programs. The team designs hardware rigs and works on software and electronic integration to maximize test value. Their rigs are part of Continuous Integration (CI) processes, providing essential feedback to ensure high quality and system robustness. This helps to automate integration and visualize the status of the system under test. Main Responsibilities: Develop the test environment and automate test processes. Work with the entire process, from designing test infrastructure to analyzing test results when HIL (Hardware-in-the-Loop) rigs are running in the CI environment. Develop tool chains for test automation and test cases in Python, Groovy scripting, and Vector CAPL to verify software. Use automation tools such as Ansible to manage the rig park. Engage in continuous improvements, troubleshooting both hardware and software for better fault detection and test efficiency. Gain an in-depth understanding of the client’s vehicle systems and electrical functions. Qualifications: Several years of experience in test development, automation, and Continuous Integration. Strong skills in test automation with scripting languages like Python, Groovy, and Vector CAPL. Experience in managing and troubleshooting both software and hardware environments. Familiarity with automation tools, especially Ansible. A Bachelor’s degree in Computer Science, Computer Engineering, or a related field (or equivalent experience). Desired Attributes: Proactive, creative, and driven, with a strong sense of responsibility. Strong teamwork skills, enjoying problem-solving with colleagues. Passionate about software and hardware integration and improving product quality. Enjoy taking initiative and pride in both individual and team achievements. Focused on continuous learning and improvement."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69525-upphandlingsjuridiskt-stod/",
    "roles": [
      "Upphandlare",
      "Upphandling",
      "Upphandlingskonsult"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning PTS har behov av upphandlingsjuridiskt stöd för genomförande av en upphandling. Det kommer även finnas en option om upphandlingsjuridiskt för genomförandet av upp till fem ytterligare upphandlingar. Optionen är dock ömsesidig och aktiveras bara efter båda parters godkännande. Den upphandling som aktuellt uppdrag avser tar sikte på är teknik för mötesbokning och omfattar både hårdvara och mjukvara (skärmar och system). Kontraktsvärdet för upphandlingen uppskattas till ca 1 miljon kronor. Syftet med avtalet är att säkerställa att de anställda med enkelhet kan boka mötesrum på PTS kontor i Stockholm. Uppdraget ska påbörjas så snart som möjligt och ambitionen är att uppdraget ska vara slutfört, dvs upphandlingen genomförd och avtal på plats, senast januari 2025. Den preliminära uppskattningen är att uppdragets tidsmässiga omfattning kommer att motsvara en arbetsinsats om totalt cirka 130 timmar. Exakt omfattning kommer dock att fastställas i dialog med vald uppdragstagare i samband med uppdragets påbörjande. &nbsp; Uppdraget innebär att driva och utföra upphandlingsprojektet självständigt. Uppdraget omfattar samtliga moment för upphandlingens genomförande, såsom: • framtagande av upphandlingsdokument, • framtagande av avtal, • kontakt med leverantörer, • projektledning, • kontakt med beställare hos PTS, m.m. &nbsp; Uppdraget innebär ett helhetsansvar för de • juridiska, • upphandlingstekniska samt • affärsmässiga, aspekterna av upphandlingens genomförande. Det innebär bl.a. ett ansvar för att säkerställa att upphandlingen resulterar i ett avtal som överensstämmer med marknadens villkor, att de delar som är IT-specifika håller god kvalitet samt att upphandlingsprocessen möter samtliga relevanta regulatoriska krav och har en upphandlingsteknisk struktur som säkerställer ett ändamålsenligt och affärsmässigt resultat. Eventuella brister eller avvikelser i relation till dessa aspekter kommer att ses som fel i tjänsten. I uppdraget ingår också att rapportera till myndighetens tekniska förvaltningsledare och delvis ha kommunikation med utsedd person på upphandlingsenheten på PTS. Team eller enskild resurs Uppdragstagaren ska tillhandahålla en huvudansvarig för uppdragets genomförande, men får även involvera ytterligare roller om denne finner det påkallat för att fullfölja uppdraget på ett ändamålsenligt sätt. Den huvudansvarige ansvarar dock för att samtliga ovan angivna resultat realiseras. Vidare ska den huvudansvarige svara för samtliga kontakter med PTS inom ramen för uppdragets genomförande. Den huvudansvarige ska uppfylla samtliga skallkrav som är specificerade nedan. Utvärdering PTS kommer att genomföra intervjuer med de anbudsgivare som efter en första utvärdering, utan intervjupoäng, ligger närmast mest ekonomiskt fördelaktigt anbud. PTS kommer att genomföra intervju med den huvudansvarige hos anbudsgivaren och efter en samlad bedömning ge en poäng mellan 0–5. Bedömningen baseras på nedanstående områden: • förmåga att redogöra för uppdragets genomförande och utmaningar • förmåga att analysera och förstå de verkliga verksamhetsbehoven och hitta passande lösningar • pedagogisk och kommunikativ förmåga att uttrycka sig • samarbetsförmåga med team och beställare och slutanvändare, och • erfarenhet gällande obligatoriska krav och eventuella mervärdeskrav som angivits. Anbudsgivare som får totalpoängen 5 erhåller ett maximalt avdrag om 1500 SEK ifrån det av anbudsgivaren offererade priset. Anbudsgivare som får poängen 4 erhåller att avdrag om 800 SEK ifrån det av anbudsgivaren offererade priset. Anbudsgivare som får poängen 3 erhåller att avdrag om 600 SEK ifrån det [&hellip;]"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69495-automationsingenjor-5/",
    "roles": [
      "Automationsingenjör"
    ],
    "places": [
      "Malmö"
    ],
    "description": [
      "Uppdragsbeskriving För kunds räkning söker vi nu en automationsingenjör / IT/OT-ingenjör med erfarenhet av industriell automation. Rollen innebär att utveckla automationslösningar för branscher som tillverkning, textil och hälsovård. Du kommer behöva vara på plats i kundens lokaler 5 dagar per vecka Arbetsuppgifter: Konfigurera och anpassa styrsystem Implementera datautbyteslösningar Idrifttagning Rådgivning och projektledning Diskutera lösningar med kunder Kvalifikationer: PLC &amp; HMI Nätverk &amp; fältbussar Produktionsoptimering, OEE, Lean Databaser, Linux B-körkort krävs (resor inom Sverige) Flytande svenska och engelska"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69471-data-analyst-10/",
    "roles": [
      "Data Analyst"
    ],
    "places": [
      "Malmö",
      "Nearshore (ex Polen)"
    ],
    "description": [
      "Description Our client&#8217;s Digital organization is on an exciting transformation journey to advance their mindsets, ways of working and solutions. Their vision is to establish user friendly digital capabilities for the many people by unlocking the full potential of their co-workers and partners. As a Data Analyst, you will strengthen their Data Delivery function within the area of Data &amp; Analytics. You have a key role in the success of data product deliveries. Working in one of their agile Data Delivery teams, you will develop new and maintain existing data integration into their data platform for Finance, Compliance, and Risk. The data platform is hybrid on-prem and cloud build upon AWS, Informatica and Oracle technology. You will be acting as a subject matter expert in all aspects of business requirements, data availability and data quality of the enterprise data warehouse. You collaborate closely with Tech Leads, Data Engineers, Business Intelligence developers and Product Owners to develop features through the Agile Release Trains. Key Responsibilities Solution and Impact Analysis – Define implementation approach – Define validation approach Data Analysis – Analyzing data and process to complete functional and technical data requirements definition (input for data engineer) Implementation – Coordination with data engineers and source systems, other components, and data consumers Validation – Coordination and execution support of testing activities and mitigating actions Competency profile Strong understanding of banking processes and ability to discuss requirements with business stakeholders Proven experience of working with data analysis and data requirement management Excellent proficiency in mapping and analyzing data Experience in holding conversations with business stakeholders to understand business processes and related data. Ability to transform business requirements to technical requirements and specifications towards other developers and peers. Being structured and analytical and can conceptualize complex technical issues Experience working with Data Warehouses, is an added advantage Experience and knowledge of agile frameworks, preferably SAFe Excellent proficiency in SQL to analyze, validate and signoff data Strong analytical and problem-solving skills You are organized with strong time-management skills. Excellent English communication skills (written and verbal) &nbsp;"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69439-data-engineer-informatica-2/",
    "roles": [
      "Data Engineer Informatica"
    ],
    "places": [
      "Malmö",
      "Nearshore (ex Polen)"
    ],
    "description": [
      "Assignment Description  As a Data Engineer, you will strengthen our Data Delivery function within the area of Data &amp; Analytics. You have a key role in the success of data product deliveries. Working in one of our agile Data Delivery teams, you will develop new and maintain existing data integration into our Informatica based data platform. The Data Engineer will work closely with Scrum Master, Product Owner, Business Intelligence Architect, Data Analyst as well as business stakeholders. Responsibilities:  Develop the company&#8217;s common Enterprise Data Warehouse platform (iData)based on Informatica PowerCenter and Oracle database Design secure and reliable workflows for staging, cleansing and loading with high performance Work closely with business stakeholders to understand requirements, processes and products as input to solution specifications of a development task Design secure and reliable workflows for staging, cleansing and loading with high performance Populate ODS and data marts with quality data for use with BI solutions Maintain existing solutions Investigate and resolve reported defects. Support data quality routines &nbsp; Competence and experience requirements:  Min 5 years development experience using Informatica Power Center tool Experience working with different types of databases and file formats like csv, xml, json. Sound knowledge of Datawarehouse concepts Experience designing data warehouse solutions Is analytical and has ability to understand data from business context Competence in file/data handling scripts using shell or python is a plus. Experienced in implementing and capability to analyze and handle data quality issues Experience in Banking domain is strongly desired &nbsp; Personal skills: Is highly motivated, self-driven, collaborative, result oriented and structured Excellent English communication skills (written and verbal) &nbsp; Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till Kravmatris_Data_Engineer_Informatica &nbsp;"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69424-69424/",
    "roles": [
      "Data Engineer"
    ],
    "places": [
      "Malmö",
      "Nearshore (ex Polen)"
    ],
    "description": [
      "Assignment Description Our clients is on an exciting transformation journey to advance our mindsets, ways of working and solutions. Our vision is to establish user friendly digital capabilities for the many people by unlocking the full potential of our co-workers and partners. &nbsp; As a Data Engineer, you will strengthen our Data Delivery function within the area of Data &amp; Analytics. You have a key role in the success of data product deliveries. Working in one of our agile Data Delivery teams, you will develop new and maintain existing data integration into our data platform on AWS for Finance, Compliance, and Risk &nbsp; You will be developing high-quality and efficient data pipelines on the new AWS-based Data Platform, as an integral part of our “Data &amp; Analytics” team. You collaborate closely with Tech Leads, Data Analysts, other Data Engineers, Business Intelligence developers and Product Owners to develop features through the Agile Release Trains. Key Responsibilities:  Develop and support data pipelines on AWS-based Data Platform. Transform designs and requirements into efficient, easily maintainable, and reusable code. Automate as much as possible, from CI/CD pipelines to testing and to data quality. Collaborate with, help, and support team members and other stakeholders. Participate in the Solution Design process. As we strive to work according to DevOps practices, you will share the responsibility with the rest of the team for making sure that our solutions are developed, tested, deployed and run well. Competency profile Must Have experience/expertise: Having data engineering experience with minimum 2 years Redshift Datawarehouse development Experience with data technologies in AWS, i.e. S3, Python, IAM, AWS Glue, AWS Athena, Spark, Redshift, Airflow etc Strong SQL and PL/SQL skills Capable to conceptualize complex technical issues Ability to understand data from business context Desired Attributes: Experience in data modelling, particularly for Data Warehouses, is highly advantageous Experience in the technology of our current data platform technologies (Oracle RDBMS and Informatica) is an advantage Experience and knowledge of agile frameworks, preferably SAFe Personal skills: Is highly motivated, self-driven, collaborative, result oriented and structured Excellent English communication skills (written and verbal) &nbsp; Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan Länk till Kravmatris Data Engineer AWS"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69428-acquia-monsido-consultant/",
    "roles": [
      "Acquia Monsido"
    ],
    "places": [
      "Distans"
    ],
    "description": [
      "Our client is currently seeking a consultant with deep expertise in the Acquia Monsido platform to assist in achieving compliance with the European Accessibility Act (EAA). The consultant will play a pivotal role in ensuring that our digital assets meet the necessary accessibility standards outlined by the EAA directive. Requirements: -Former experience in implementing and configuring Acquia Monsida. The duration of the assignment will be determined in accordance with the end client and evaluated together with the consultant."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69352-system-application-consultant-2/",
    "roles": [
      "System Application"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Consultant in Core System Application Integration (CSAI). Are you interested in working as a consultant and contributing to building Core System Application Integration (CSAI) from the ground up? As a CSAI consultant, you’ll have broad knowledge in both software and hardware integration, and you will work within a team where you can significantly influence your work. Core System Application Integration (CSAI) At CSAI, the team operates as a tight, agile unit focused on building test environments for new platforms and programs. They design hardware rigs while working on software and electronic integration, striving to maximize the value of testing. Their work is part of the Continuous Integration (CI) process, where the rigs provide vital system feedback that contributes to high-quality development and system robustness. The team’s efforts enhance quality by automating integration and visualizing the status of the system under test. They are now looking to strengthen their rig team, particularly in the area of test environment development. The role will involve designing new rigs, developing and maintaining CI infrastructure, and creating, writing, running, and analyzing automated tests for a newly developed platform in the Software &amp; Electronic Platform organization. Main Responsibilities: As a consultant in the rig team, your key responsibilities will include: Further development of test rigs and activities that enable test automation and Continuous Integration (CI). Working through the entire process, from designing test infrastructure to analyzing test results when HIL rigs are operational within the CI environment. Developing toolchains for test automation and test cases to verify software using Python, Groovy scripting, and Vector CAPL. Utilizing Ansible to orchestrate the rig park. Continuously improving test automation processes and fault tracing for both hardware and software. Gaining a broad understanding of the client’s vehicle systems and electrical functions. Qualifications: Working knowledge of rig construction, onboarding, and fault tracing. Expertise in developing electrical wiring diagrams (schematics) for rigs according to hardware specifications. Experience working with automated test systems in Vector. Ability to design proof of concept for developing new rigs. Proficiency with Ansible, Python programming, or CAPL. Experience in testing within a CI context. Experience working in a large-scale software company. Have several years of experience in test/rig development and rig automation. Meritorious Qualifications: Experience working with version control and revision control systems (e.g., Git). Knowledge of Jenkins or similar automation tools. Experience with Agile development processes (e.g., Scrum). Cisco networking knowledge or equivalent. Familiarity with Linux systems. Desired Attributes: Have a genuine interest in combining hardware and software. Be committed to continuously improving products by analyzing fault slips and focusing on product stability and robustness within CI flow. Take an active role in test activities, enjoy influencing processes, and take pride in both individual and team achievements. Enjoy teamwork, be proactive, creative, driven, well-organized, and take responsibility for problem-solving within the team."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69347-machine-learning-software-engineer/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client is seeking a Machine Learning Software Engineer for one of their product teams. As a member of this team, you will contribute to building a new AI-powered toolchain for product development within the automotive industry. The team is developing AI-based solutions to enhance automotive product development processes. Main Responsibilities: Develop generative AI/ML models, such as GANs, VAEs, transformers, etc. Build robust modules for evaluation and drift detection. Develop and maintain machine learning pipelines and MLOps procedures to support production processes. Process and transform source data for use in machine learning pipelines, leveraging distributed computing environments and parallel processing techniques. Ensure the reliability, scalability, and fault tolerance of AI systems in production environments. Stay updated on the latest AI/ML research and advancements in life sciences and healthcare technologies to drive innovation within the company. Take full ownership and accountability for project deliverables in a fast-paced startup environment. Collaborate with cross-functional teams, including researchers, product managers, and designers, to ensure seamless integration of AI solutions into vehicle architectures and digital systems. Focus on building reliable, secure, and scalable systems for AI applications, including smart cabin and smart drive technologies. Lead end-to-end integration of AI-driven features such as in-navigation systems, recommender systems, and other intelligent in-car solutions. Qualifications: 2+ years of relevant development experience and demonstrated knowledge of machine learning technologies (RecSys/NLP/CV). 4+ years of experience with data structures, algorithms, and software engineering best practices. Hands-on experience utilizing Generative AI technology for marketing texts, images, and videos, with familiarity in LLMs and model fine-tuning (instruct tuning, SFT, RLHF, etc.). Strong proficiency in programming languages such as Python, C/C++, or Java. Bachelor’s or Master’s degree in Computer Science, Artificial Intelligence, or a related field (PhD is a plus). 4+ years of experience designing and/or building distributed systems at scale. 3+ years of experience with the full ML development lifecycle using open-source AI/ML frameworks and public cloud platforms. Experience with AI frameworks such as LangChain, AutoGPT, AutoGen, MetaGPT, etc. Knowledge of prompt engineering, RAG, and fine-tuning. Experience in developing and maintaining CI/CD pipelines for application deployment. A commitment to ethical AI practices and robust security protocols to safeguard application data and user privacy. Experience working in an Agile environment. Desired Attributes: Passion for new technologies and software development. Interest in contributing to the formation of a brand-new development organization with strong values, mindset, and culture. Ability to thrive in a fast-paced startup environment. Proven capability in analysis and problem-solving. Eagerness to help build the most attractive workplace in Gothenburg."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69341-generative-ai-fullstack-developer/",
    "roles": [
      "Developer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client is currently seeking a Generative AI Full Stack Developer to join one of their product teams. As a member of this team, you will participate in building a new AI-powered toolchain for product development in the automotive industry. The client is focused on developing AI-based solutions for product design and engineering within the automotive sector. Main Responsibilities: Develop and implement generative AI models, including GANs, VAEs, and transformers. Work in an Agile/Scrum environment, completing user stories and delivering within sprint deadlines. Participate in designing and creating scalable, AI-enabled products. Leverage modern cloud-native application technologies and AI to build high-quality, innovative software solutions. Apply advanced AI/ML algorithms and techniques to address complex challenges in automotive product development. Collaborate with cross-functional teams, including researchers, product managers, and designers, to integrate AI solutions into vehicle architectures and digital systems. Focus on building reliable, secure, and scalable systems for AI applications such as smart cabin and smart drivetechnologies. Manage end-to-end integration of AI-driven features like navigation systems, recommender systems, autonomous driving, and other intelligent in-car systems. Utilize tools and technologies like TensorFlow, PyTorch, OpenAI, and Transformer models to develop robust AI systems. Required Qualifications: 2+ years of relevant development experience with demonstrated expertise in machine learning technologies(RecSys, NLP, CV). 4+ years of experience with data structures, algorithms, and software engineering best practices. Hands-on experience with Generative AI technologies in marketing texts, images, and videos, as well as familiarity with LLMs and model fine-tuning techniques (Instruct Tuning, SFT, RLHF, etc.). Strong proficiency in programming languages such as Python, C/C++, or Java. A passion for new technologies and strong analytical/problem-solving skills. Bachelor’s or Master’s degree in Computer Science, Artificial Intelligence, or a related field. A PhD is a plus. Additional Requirements: 4+ years of experience in designing and/or building distributed systems at scale. 3+ years of experience with the full ML development lifecycle using open-source AI/ML frameworks and public cloud platforms. Experience with AI frameworks such as LangChain, AutoGPT, AutoGen, MetaGPT, etc. Knowledge of Prompt Engineering, RAG, and Fine-Tuning. Experience working in an Agile environment. Desired Attributes: Passion for cutting-edge technology and software development. Interest in contributing to the formation of a new development organization with forward-thinking values, mindset, and a strong software development culture. Desire to help create the most attractive workplace in Gothenburg. Strong problem-solving skills with the ability to work cross-functionally in a diverse team environment. Capability to lead projects or mentor junior developers."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69332-embedded-software-tester-for-base-software-and-sw-architecture/",
    "roles": [
      "Tester"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking an Embedded Software Tester for Base Software and SW Architecture. Their human-centric focus is what makes them different from all other car companies, and it’s at the heart of everything they create. If you want to join them in their mission to make people’s lives less complicated, they offer you a chance to grow together with talented people who want to make a true difference. This is an exciting role as a software developer working on software development in C/C++ for active chassis functions. They are looking for an Embedded Software Developer to strengthen their team. The Suspension Software and Function teams are cross-functional, working with the full software stack development. The teams develop control algorithms and toolchains needed for their development to achieve the best active chassis functions for their vehicles. Main Responsibilities: Work within the in-house software team developing software for the suspension system, both for the Suspension ECU and Central ECU of the vehicle. Collaborate closely with other developers, test engineers, system engineers, and safety engineers. Take on cross-functional tasks depending on project needs. Test and develop application software in C++ and middleware in C. Qualifications: At least 3 years of experience in C++ (version 11 or 14). At least 3 years of experience in C (version 90 or 99). At least 3 years of experience in real-time embedded system development. Experience in the automotive industry. Experience working with AUTOSAR. Knowledge of automotive communication protocols, including CAN and Automotive Ethernet. Knowledge of UDS (Unified Diagnostic Service). Experience with Vector tools such as CANOE, CANalyzer, VTEST. Experience with HIL systems and real-time simulation. Familiarity with cybersecurity standards in the automotive industry. Ability to work in a multi-cultural environment. Strong communication skills, especially in initiating communication when needed. Additional Qualifications: Contributions to side projects or open-source software. Knowledge of System Safety Implementation compliant with ISO26262. Suspension knowledge. Experience working with Agile software development methodologies. Desired Attributes: A motivated and self-driven software developer who takes the initiative to improve the product. Someone who embraces teamwork and collaboration. Eager to learn and develop new competences. Experience in the automotive industry, especially within the vehicle dynamics arena, will be a clear advantage for success in this role."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69326-sw-system-design-engineer/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a SW &amp; System Design Engineer. As a System Design Engineer for Cameras, you will play a pivotal role in component development. You will be responsible for designing and maintaining the Camera System Architecture, defining its interfaces, and ensuring smooth integration with the main Core Computing system. You have previous experience working with SW architecture &amp; design, and you will strengthen the team by: Creating a flexible SW platform. Supporting developers and suppliers to optimize SW delivery. Handling the breakdown and handshake of functional and non-functional requirements into modules, components, and interfaces. You will work in a structured way, adopt new tools (such as Carweaver, Team Center), and maintain effective communication and collaboration with stakeholders and dependencies like Solution Architects, sensor suppliers, and the Function and AD/ADAS Software Development teams. Main Responsibilities: Design and maintain the system/SW architecture for the exterior camera platform. Define system interfaces to ensure seamless integration with the Core Computing system. Collaborate with Solution Architects, sensor suppliers, and AD/ADAS Software Dev teams to ensure alignment and proper communication. Ensure the system meets functional safety and cyber security standards. Define both internal and external SW processes. Conduct necessary cyber security investigations. Optimize sensor integration and system performance. Gather, define, and document system requirements. Ensure quality SW delivery through ASPICE assessments. Work with memory-intensive applications and sensor data processing in the NVIDIA Core Computing system. Required Qualifications: Experience in Software Architecture Design within complex embedded systems. Proficiency in real-time fault-tolerant software design. Programming experience in C/C++ and Python. Expertise in Object-Oriented Development. Experience with functional safety standards, such as ISO 26262, SOTIF, and Cyber Security. At least a Bachelor of Science in Electronics, Mechatronics, Software, or related fields. More than 5 years of SW design experience. Proficient in English (written and spoken). A valid EU Driver&#8217;s License (&#8221;B&#8221;) is a merit. Additional Qualifications: Knowledge of Ethernet, TCP/IP, CAN. Familiarity with Linux. Understanding of Automotive Diagnostic Concepts. Experience with tools such as Git, Gerrit, Jenkins. Experience working with NVIDIA automotive HW/SW tools. Experience with Core System Platform/Components. Desired Attributes: Strong leadership skills with the ability to delegate tasks effectively. High attention to detail and organizational skills, especially when working on complex system designs. Strong communication skills to collaborate across teams and stakeholders. Ability to work efficiently under deadlines and ensure project functionality and delivery."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69311-scrum-master-11/",
    "roles": [
      "Scrum Master"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Scrum Master. At Core System Components (ARTCSC), within the Software &amp; Electronics Platform, they develop body controllers, I/O controllers, electrical power distribution units, and electrical power supply – both hardware and software – for all current and future vehicle platforms. They work on solutions from early concept through industrialization and follow-up in the field. They are dedicated to building cross-functional and empowered teams in an agile environment where they learn every day, challenge each other, and provide continuous feedback. They are now looking for a manifesto-minded Scrum Master to lead two development teams on their exciting agile journey! Team Responsibilities: The teams you will lead are responsible for developing and delivering two complete I/O controller ECUs. These units are a central part of the new SPA2 and SPA3 software &amp; electronic platform, realizing important software functionality at both system service and customer function levels. The teams are focused on: Developing software to integrate supplier-developed hardware and basic software with in-house developed application software Verifying and delivering the complete ECU for manufacturing Main Responsibilities Your primary focus will be on flow and continuous improvement, leading and supporting the teams in their development efforts. Key tasks include: Helping teams deliver on their commitments and grow as empowered agile teams Removing impediments and ensuring a productive work environment Maintaining dialogue with relevant stakeholders regarding the teams&#8217; status and needs Protecting the teams from external disturbances and unplanned work Ensuring the teams’ work situation remains manageable, motivating, and fun Qualifications: Proficiency in English A minimum of a B.Sc. or equivalent in a technical field relevant to the teams’ work tasks (e.g., Computer Science, Electrical Engineering, Engineering Physics) Previous leadership roles and experience as a Scrum Master Experience in automotive software design and development, system engineering, and embedded software testing Additional Qualifications: Are an avid VIRA user Have experience with Data Driven Transparency and its implementation Desired Attributes: Is a self-driven team player with leadership ambitions Has experience in software development and enjoys taking responsibility and ownership Knows when to delegate tasks Takes a structured approach to work and has technical expertise applied to complex engineering tasks Values collaboration and open communication Actively seeks inspiration and strives for continuous improvement Is not afraid to ask for help or share expertise Can set high standards and expectations while articulating your own opinions You take initiative You have the ability to inspire You are willing to try new approaches We look forward to receiving your application!"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69305-application-engineer/",
    "roles": [
      "Application Engineer",
      "Data Engineer"
    ],
    "places": [
      "Hybrid",
      "Stockholm"
    ],
    "description": [
      "Assignment Description On behalf of our client we are looking for a hands on Application Engineer. You will work closely with our clients business partners and help them to get better insight in our customers demands. Work will mainly relate to cloud services and use Microsoft Azure as a cloud platform. As part of the team you will take part in the development cycle (requirement analysis, design, development, test, deployment, hand over). Design, build and integrate data from various sources. Write complex data queries and create data infrastructure in a simple and efficient matter. Requirements Ability to integrate data from a variety of sources using integration and orchestration tools as Azure Data Factory and Databricks Good knowledge of Microsoft Azure Data lake, Azure SQL database and data warehouse solutions Familiarity with Azure Monitor or Log Analytics for real-time monitoring and troubleshooting of data pipelines, ensuring optimal performance and uptime. Experience in continuous integration and continuous deployment (CI/CD) practices using Azure DevOps, especially for automating data pipeline deployments. Experience in data exploration and data modeling e.g. Azure Analysis Services Develop and maintain Power BI reporting and self-service solution Self-motivated and self-going Swedish and English is a must You need to be situated in Stockholm and work from our clients office in Stockholm 2 days per week."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69299-data-engineer-24/",
    "roles": [
      "Data Engineer"
    ],
    "places": [
      "Hybrid",
      "Stockholm"
    ],
    "description": [
      "Assignment Description On behalf of our client we are looking for a Data Engineer where you will work closely with the teams&#8217;s Solution designer to make sure you build an effective and sustainable solution. Work will mainly relate to cloud services and use Microsoft Azure as a cloud platform. As part of the team you will take part in the development cycle (requirement analysis, design, development, test, deployment, hand over). Design, build and integrate data from various sources. Write complex data queries and create data infrastructure in a simple and efficient matter. Design and develop Power BI dashboard solutions for the business to make it possible to e.g. increase decision accuracy and improve process efficiency. Work closely with our clients business partners and help them to get better insight in our clients customers’ demand Requirements: At least 5 years’ experience in software development Experience in designing, implementing, and supporting enterprise-scale ETL / ELT pipelines Strong skills in data exploration and data modeling e.g. Azure Analysis Services Good knowledge of Microsoft Azure Data lake, Azure SQL database and data warehouse solutions Ability to integrate data from a variety of sources using integration and orchestration tools as Azure Data Factory and Databricks Design, develop and maintain Power BI reporting and self-service solution Strong in stakeholder management Self-motivated and self going Swedish and English is a must &nbsp; You need to be situated in Stockholm and work from our clients office in Stockholm 2 days per week."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69290-data-engineer-23/",
    "roles": [
      "Data Engineer"
    ],
    "places": [
      "Hybrid",
      "Stockholm"
    ],
    "description": [
      "Assignment Description On behalf of our client we are looking for an experienced Data Engineer, you will act as the bridge towards the business. The team is located in Germany, Netherlands and Sweden. You need to be situated in Stockholm and work from our clients office in Stockholm 2 days per week, as well as be available ASAP. Requirements You need experience within the following systems: Azure DataBricks Data Factory Function Apps Python SQL PowerBI DevOps"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69253-it-sakerhetskonsult-5/",
    "roles": [
      "IT-säkerhet"
    ],
    "places": [
      "Hybrid",
      "Örebro"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en IT-säkerhetskonsult som ska arbeta på kundens IT-avdelning som en temporär förstärkning. Vår kund förväntar sig att du arbetar på plats i deras lokaler i Örebro 2–3 dagar i veckan. Huvudsakliga ansvarsområden: Arbeta med IT-säkerhet för hela vår kunds organisation i både små och stora frågor. Arbeta både självständigt och tillsammans med andra i säkerhetsrelaterade frågor. Fungera som kommunikatör och verka för att öka medvetenheten om säkerhetsfrågor. Samarbeta med säkerhetschef, IT-chef och andra inom säkerhetsorganisationen. Delta i projekt och aktivt driva samt bidra till att lösa IT-säkerhetsrelaterade frågor. Obligatoriska kvalifikationer: Minst 3 års erfarenhet inom IT-säkerhet. Minst 3 års erfarenhet av IT-säkerhetsarbete samt god förankring inom säkerhetsskydd inom offentlig förvaltning. Erfarenhet av projektarbete som kräver kännedom om krav baserade på exempelvis: Säkerhetsskyddslagen NIS/NIS2 GDPR OSL MSB föreskrifter om informationssäkerhet Minst 3 års erfarenhet från praktiskt arbete med ramverk för säker systemutveckling, t.ex. OWASP. Minst 3 års arbete med IT-arkitektur med fokus på utveckling. Meriterande kvalifikationer: Erfarenhet av att utnyttja AI i systemlösningar, minst 2 olika systemlösningar. Minst 2 års erfarenhet av design avseende arkitektur för uppbyggnad av säkerhetsskyddad miljö. Minst 2 års erfarenhet av design avseende containermiljöer (Docker och Kubernetes). Erfarenhet av minst två projekt rörande SOC/SIEM-lösningar."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69242-senior-integrationsutvecklare-50-region-skane-avrop-919/",
    "roles": [
      "Integrationsutvecklare"
    ],
    "places": [
      "Lund"
    ],
    "description": [
      "Uppdragsbeskrivning Projektet utvecklar och underhåller en plattform för integrationer av ett flertal olika miljöer baserat på teknologi såsom: Ms Applikations server (BizTalk) Ms SSIS Ms .NET Ms Visual Studio Ms SQL Server Kvalifikationer: Du behöver naturligtvis inneha en mycket god kompetens och erfarenhet av Ms SSIS och utveckling i BizTalk. Bör även kunna dokumentera och överlämna arbetet till förvaltning. Erfarenhet av BizTalk-utveckling och goda kunskaper i Windows servermiljöer. Erfarenhet av BizTalk Deployment Framework, BTDF Erfarenhet av .NET-utveckling och att skriva webservices. Erfarenhet av C#- utveckling. Goda kunskaper i xpath, xslt, xml schema samt Ms SQL Server. Erfarenhet av testförfaranden och speciellt skapande av automatiserade tester i BizTalk. Erfarenhet av att ha arbetat med agila metoder. Erfarenhet av projektarbete. Meriterande: Utbildningar inom området Microsoftcertifieringar inom Biztalk Erfarenhet av HL7 för BizTalk/HL7 Accelerator for BizTalk (BTHLA7) Erfarenheter i BizUnit Arbetet bedrivs i projektform, i samarbete med andra mycket kompetenta medarbetare. Den del som du ska leverera inom projektet är: Utveckling av BizTalk integrationer Utveckla SSIS paket som använder sig av både databaser och webservices som källa/destination. Utveckling av .NET applikationer Vana av att dokumentera den utvecklade integrationer Eventuellt möjlighet för utökad tid utöver 50% lite längre fram. Tillhör kategori: Integrationsutvecklare &nbsp; Upgraded People tillsammans med Region Skåne agerar i enighet med och står bakom EUs och Sveriges sanktioner mot Ryssland och de som omfattas av dessa. Det medför att leverantörer som svarar på anbud för att leverera kompetens via Upgraded People till Region Skåne ger egen garanti om att leverantören ej omfattas av sanktionerna, och sedermera står bakom dessa med samma ståndpunkt."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69230-it-sakerhetskonsult-4/",
    "roles": [
      "IT-säkerhet"
    ],
    "places": [
      "Hybrid",
      "Örebro"
    ],
    "description": [
      "Uppdragsbeskrivning På kunds räkning söker vi nu en IT-säkerhetskonsult. Uppdraget innebär att du kommer att arbeta med IT-säkerhet för vår kund, i små som stora frågor, både självständigt och tillsammans med andra. I rollen ingår även att vara en kommunikatör och verka för att öka medvetenheten om säkerhetsfrågor. Arbetet sker tillsammans med vår kunds säkerhetschef, IT-chef och övriga personer inom säkerhetsorganisationen. Deltagande i projekt kan förekomma och i rollen förutsätts att man aktivt och självständigt driver och bidrar till att lösa IT-säkerhetsrelaterade frågor. Du kommer att behöva arbeta på plats i vår kunds lokaler i Örebro cirka 2-3 dagar i veckan. SKA-KRAV: Minst 3 års erfarenhet inom IT-säkerhet Minst 3 års erfarenhet av IT-säkerhetsarbete samt god förankring inom säkerhetsskydd inom offentlig förvaltning, projektarbete som kräver kännedom och erfarenhet om krav baserade på på t.ex. säkerhetsskyddslagen, NIS/NIS2, GDPR, OSL samt MSB:s föreskrifter om informationssäkerhet. Minst 3 års erfarenhet från praktiskt arbete med ramverk för säker systemutveckling t.ex. OWASP. Minst 3 års Arbete med IT-arkitektur med fokus mot utveckling. BÖR-KRAV: Erfarenhet av utnyttjande av AI i systemlösningar, minst 2 olika systemlösningar. Minst två års erfarenhet av design avseende arkitektur för uppbyggnad av säkerhetsskyddad miljö. Minst 2 års erfarenhet av design avseende containermiljöer (docker och kubernetes). Erfarenhet av minst två projekt rörande SOC/SIEM-lösningar."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69218-mainframe-stordata-utvecklare/",
    "roles": [
      "Utvecklare"
    ],
    "places": [
      "Hybrid",
      "Oxelösund"
    ],
    "description": [
      "Uppdragsbeskrivning På kunds räkning söker vi nu efter en utvecklare till deras mainframe/stordata team. Kvalifikationer Vi ser gärna att du har kunskap inom följande tekniker: COBOL DL/I DB2 MQ IBM Du behöver kunna arbeta på plats i kundens lokaler i Oxelösund ca 2ggr/veckan, resterande tid kan du arbeta remote. Uppdraget pågår initialt året ut, men det finns möjlighet till förlängning."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69217-ordersupport-medarbetare/",
    "roles": [],
    "places": [
      "Västerås"
    ],
    "description": [
      "Uppdragsbeskrivning Ordersupportmedarbetare, ta emot ordrar från butik och omsätta detta till leveransorder. Administrativt arbete med kundsupport på telefon. Krav: Gymnasie utbildning eller högre, fokuserad snabb och effektiv i admin arbete, lyhörd och socialt kompetent. Behöver förstå vad inköp avrop och kundorder är och vad som är kritiskt."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69199-testledare-16/",
    "roles": [
      "Testledare"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en erfaren och flexibel testledare som kommer att spela en nyckelroll i företaget och ett viktigt projekt med utmanande tidsramar. Du kommer att arbeta över flera affärsenheter och projekt för att säkerställa att vår teststrategi implementeras effektivt och konsekvent. Det krävs att du är både flexibel och beslutsam, med förmågan att driva igenom förändringar och förbättringar i testprocessen, särskilt i en komplex miljö med många system och kommunikationsflöden. ‌ Ansvarsområden: ‌Utveckla, implementera och övervaka teststrategier och testplaner i projekt och Agil utveckling som spänner över flera affärsenheter och affärssystem. Säkerställa kvalitet genom hela flödet, trots användning av olika testverktyg och teknologier mellan enheterna. Skapa och upprätthålla ett översiktligt samarbete mellan traditionella vattenfallsprojekt och Agila utvecklingsarbeten för att uppnå önskad kvalitet. Identifiera och hantera risker relaterade till testning och kvalitetssäkring. Utföra kontinuerlig förbättring av testprocesser och verktyg för att öka effektiviteten och kvaliteten. Rapportera testresultat och kvalitetsindikatorer till ledningen och andra intressenter. Integrera sig med utvecklare, produktägare, projektledning och andra intressenter för att säkerställa att testkrav och kvalitetsstandarder uppfylls &nbsp; Kvalifikationer: ‌Lång erfarenhet av testledning (7-10 år) – Kandidaten bör ha omfattande erfarenhet av att leda tester inom mjukvaruutveckling, gärna i komplexa miljöer som bank och finans. Erfarenhet av end-to-end-testning – Kunskap om att hantera tester i stora organisationer med komplexa applikationslandskap, vilket innebär att man tar ett helhetsgrepp över hela testprocessen. Djup förståelse för testmetodik och processer – En stark förståelse för både manuella och automatiserade testprocesser, inklusive erfarenhet av kravinsamling, testdesign och hantering av testdata. Erfarenhet av olika utvecklingsmetoder (Agil och traditionell) – Kandidaten bör ha arbetat med agila utvecklingsmetoder, såsom SAFe, men också ha erfarenhet från traditionella utvecklingsprojekt. Starka kommunikations- och samarbetsförmågor – Förmågan att arbeta nära olika team och intressenter är avgörande för att kunna driva fram tester och säkerställa kvaliteten. Flexibilitet och anpassningsförmåga – Personen måste kunna hantera snabba förändringar och vara flexibel i en dynamisk arbetsmiljö. Strategiskt tänkande och beslutsamhet – En förmåga att inte bara hantera tester utan också driva strategiska förändringar och initiativ. Erfarenhet av moderna testverktyg – Kandidaten bör ha praktisk erfarenhet av verktyg som Azure DevOps Test Plans, Selenium och Playwright. Certifieringar – Certifieringar som ISTQB ses som en fördel och stärker kandidatens trovärdighet och kompetens inom testning &nbsp; Personliga egenskaper: ‌Du är en person som arbetar självständigt och tar ansvar för ditt arbete och låter oss snabbt veta om du behöver hjälp från andra. Du är en engagerad och samarbetsvillig lagspelare som brinner för kontinuerlig förbättring. Du är självmotiverad och proaktiv med analytiska färdigheter och tycker om att arbeta i grupp. Du är strukturerad och har goda analytiska färdigheter, kan hantera flera projekt samtidigt och prioritera arbetsuppgifter effektivt. Du har en helhetssyn och förståelse för komplexa flöden. Du är noggrann, ansvarsfull, prestigelös och proaktiv. Du har förmågan att demonstrera senioritet och ledarskap inom ditt område, samt utmärkt kommunikationsförmåga. Du talar svenska (modersmål) och engelska (flytande i engelska, kontakt med offshore-team förväntas) Du bor i Stockholmsområdet och kan vara närvarande hos kunds kontor dagligen [&hellip;]"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69172-software-engineer-maps-developer-platform-web/",
    "roles": [
      "Developer",
      "Software Enginer"
    ],
    "places": [
      "Malmö"
    ],
    "description": [
      "Assignment Description Our client in the Maps Developer Platform team is looking for technically minded and communicative software engineers to contribute to our popular Maps Developer products. MapKit powers experiences across platforms, including Native, the Web and Android. As a member of this team, you will build new APIs and tools powering the Maps Developer experience. You will take new features from ideation, through design and implementation, all the way to announcing them at our client’s Developer Conference. You will partner directly with a wide range of clients to build highly impactful mapping solutions. Main day to day activities Eliciting requirements from our clients and translating them into scalable, reliable code Designing APIs enabling developers both inside and outside of our client to build mapping features into their apps Collaborating cross-functionally with Human Interaction Design, Services, and other Engineering and Data teams Developing, launching, and maintaining cross-platform features that integrate Maps with the ecosystem Working with QA (and sometimes bootstrapping them) by developing and maintaining test tools and test cases &nbsp; Key Qualifications 6+ years of hands-on software engineering experience Ability to explain complex problems clearly and succinctly Passion to collaborate and iterate on ideas on a cross-functional team A keen eye for software design and architecture Expected to be proficient in either Swedish or English Onsite presence required at the Malmö/Hyllie office on Tuesdays, Wednesdays, and Thursdays. Remote work is possible on Mondays and Fridays. &nbsp; Web (MapKit JS) Responsible for MapKit APIs on the web. Proficient in functional programming style. Languages: modern JavaScript/TypeScript, HTML, CSS CI/CD: Experience with Continuous Integration/Continuous Deployment (Docker) &nbsp; Additional Skills API Design: Designing and building public APIs Rendering experience: Computer Graphics APIs, e.g. OpenGL, Metal, WebGL Technical writing: Contributing to or authoring developer documentation"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69155-devops-engineer-18/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a DevOps Engineer to work alongside their team of engineers in developing and maintaining the Zuul, Jenkins, and Conan/Bazel workflow at ARTCSC. The build chain includes applications, integrations, and testing at various levels. ARTCSC strives for a high level of automation to ensure a quality-assured workflow that enables fast and reliable integration. Main Responsibilities: Work with Jenkins and Zuul workflows. Script using Python and other tools to automate processes. Troubleshoot and solve problems with both static and dynamic build slaves. Qualifications: Proficiency in Python programming. Hands-on experience with DevOps, particularly in managing build servers and workflows. Ability to troubleshoot and resolve issues related to build chains. No specific automotive background required. Desired Attributes: Initiative and the ability to work independently. Fast learner, able to adapt quickly and contribute to scripting and programming tasks. Capable of maintaining smooth operations while learning and improving processes."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69128-verksamhetsarkitekt-qualiwareadministrator/",
    "roles": [
      "Verksamhetsarkitekt"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en Verksamhetsarkitekt/Qualiwareadministratör där syftet med arbetet är att kartlägga vår kunds verksamhetsarkitektur och definiera förmågor. Detta för att skapa en nulägeskarta som kunden kan modellera kring i samband med exempelvis utvecklings- och förändringsprojekt. Vår kund har under 2023 genomfört en datakartläggning som är dokumenterad i Visio. Denna, tillsammans med annan övergripande integrationsdokumentation, behöver överföras till Qualiware med lämplig metodik. Strukturen i Qualiware behöver byggas utifrån att hela kundens IT- och verksamhetsarkitektur ska kunna rymmas och vara strukturerad på ett enhetligt sätt. Det långsiktiga målet är sedan att dokumentera alla kundens processer och delprocesser i Qualiware. Kunden har idag identifierat vissa förmågor, i uppdraget 4 (7) ingår att verifiera dessa samt identifiera/dokumentera flera. Målet är då att kartlägga nuläget utifrån system, information, process och förmågor. SKA KRAV Du behöver ha relevant utbildning alternativt 3 års yrkeserfarenhet, dvs kompetensnivå 1 Erfarenhet av dokumentation i Qualiware 3 års erfarenhet av verksamhetsarkitektur, gärna certifiering Erfarenhet från modelleringsspråk som BPMN, UML eller Archimate samt från modelleringsverktyg Kompetens inom ramverk och metoder kopplat till verksamhetsarkitektur (EA) Agilt arbetssätt Du ska ha minst tre (3) års erfarenhet samt förmågan att kunna dokumentera och presentera arbetsresultatet på ett pedagogiskt och ändamålsenligt sätt. Meriterande om du behärskar verktyg m.m. i den IT-miljö som staden har. I IT-miljön ingår; Utvecklingsplattformar E-tjänsteplattform Integrationsverktyg m.m."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69087-frontend-utvecklare-react/",
    "roles": [
      "Frontend-utvecklare"
    ],
    "places": [
      "Lund"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en engagerad och erfaren Frontend-utvecklare med fokus på React och en stark känsla för webbutveckling. Du kommer att vara en del av ett dynamiskt team som arbetar med att migrera och bygga nya applikationer för SharePoint-plattformen, med särskilt fokus på SharePoint Framework (SPFX) och molnlösningar. Ansvarsområden: Bygga och förvalta SPFX-appar för SharePoint som utvecklas i React. Migrera befintliga applikationer till den nya molnplattformen. Minst 5 års erfarenhet av att jobba med både frontend och backend, med en tyngd på frontend (75% React/TypeScript, 25% .NET API och Azure). Säkerställa att applikationerna möter verksamhetens behov och matchar kraven för olika projekt. Krav: Stark erfarenhet av React och TypeScript. Grundläggande förståelse för backend-utveckling, särskilt med .NET API och Azure Functions. Erfarenhet av att utveckla moderna webbapplikationer med hög prestanda och skalbarhet. &nbsp; Meriterande: Erfarenhet av SharePoint Framework (SPFX) eller viljan att snabbt lära sig det. Kunskap om FluentUI och erfarenhet av att utveckla komponenter för SharePoint. Erfarenhet av att arbeta i molnmiljöer, särskilt inom Azure. Tidigare erfarenhet av att migrera applikationer från äldre system till molnet. Personliga egenskaper: Vi söker dig som är öppen, ärlig och har en god samarbetsförmåga. Att vara en del av teamet och bidra till en positiv arbetsmiljö är viktigt. Du ska vara villig att arbeta på kontoret minst tre dagar i veckan, då rollen inte lämpar sig för helt distansarbete. Rollen kräver en lösningsorienterad och kreativ person som trivs med att ta sig an komplexa uppgifter och bidra till utveckling."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69078-handledare-till-socialsekreterare-familjeavdelning/",
    "roles": [
      "Handledare"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning En (1) handledare efterfrågas till Danderyds kommun. Uppdragets omfattning: Två tillfällen/var tredje vecka, a 2,5 timme. Eventuell möjlighet till förlängning kan finnas om utvärderingen visar önskemål om förlängning. Konsult ska handleda två grupper socialsekreterare inom familjeavdelningen. Ge handledning i att analysera enligt risk- och skyddsfaktorer, koppla in teori med ärenden, utmana och ställa fördjupande frågor. Kommunen efterfrågar en handledare som har ett systemteoretiskt perspektiv på det sociala arbetet, samt att handledningstillfällena utöver ärendehandledning även fokuserar på processhandledning. Projektorganisation Handledaren rapporterar till gruppchef Maria Gullholm Handledare handleder två av våra arbetsgrupper. Den ena 7 socialsekreterare (mottag+barnutredare). Den andra gruppen 8 socialsekreterare (ungdomsutredare+insatshandläggare). Handlingar som ska ingå i offert: &#8211; CV &#8211; Referensförteckning &#8211; Pris Skallkrav Konsulten ska ha handledarutbildning Konsulten ska ha flera års erfarenhet av att handleda socionomer/socialsekreterare inom myndighetsutövning barn och unga Börkrav Meriterande om konsult har kunskap om kommunens olika metoder, exempelvis SAVRY, SDQ, iRisk och Signs of safety. Meriterande med erfarenhet av både utredning/insatser- och mottagningsarbete Övriga krav Två (2) referensuppdrag där det framkommer vad uppdraget inneburit samt resultat För att kunna ansöka för detta uppdrag måste du vara en registrerad användare i vår portal som är helt kostnadsfri. Är du ny användare och vill registrera dig eller ditt bolag i Upgrades portal klicka här: https://portal.upgraded.se/"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69025-software-engineer-with-focus-on-complete-integration-and-release/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Software Engineer with a focus on Complete Integration and Release. You will be part of a team driving the continuous delivery and release of the complete electrical system. You will be part of the Integration, Verification, and Orchestration team within Complete Software and Integration. This team coordinates testing, integration, and release processes at the complete software and electronics system level across all of our client&#8217;s platforms. They are now looking for a colleague who can help streamline the process from functional requirements to well-defined release candidates for car products, through continuous integration and automated testing workflows. Main Responsibilities: Orchestrating the organization’s efforts to assemble all deliveries and ensure readiness for release. Aligning integration and software release activities with the team&#8217;s future vision. Empowering, synchronizing, and controlling the function and software implementation at the complete electrical system level, across integration points and sequences in project plans and the maintenance phase. Prioritizing the resolution of issues found during the process. Participating in fault tracing and troubleshooting activities. Collaborating closely with various stakeholders, both inside and outside R&amp;D. Required Qualifications: M.Sc. in Electrical or Software Engineering, or similar relevant experience. Hands-on experience in software development. Excellent communication, collaboration, and leadership skills. Fluency in English (written and spoken). Desired Attributes: Courageous with a high level of energy. Known for high integrity and professionalism. Able to maintain a holistic view of projects and challenges. Skilled at leading people, listening, and coaching. Analytical and structured in their approach."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/68989-ux-designer-14/",
    "roles": [
      "UX-designer"
    ],
    "places": [
      "Brønnøysund",
      "Distans"
    ],
    "description": [
      "Oppdragsbeskrivelse På vegne av vår kunde søker vi nå en UX-designer, hvem skal jobbe i et tverrfaglig team som løser oppgavene med å lage løsningen for et nytt digitalt våpenregister og en ny digital våpenforvaltning. Du vil også samarbeide med andre team som arbeider med saksbehandlingsløsningen og integreringsløsninger mot det nye våpenregisteret. Ved behov skal du også kunne bistå i andre satsninger, prosjekter eller oppgaver. Kvalifikasjoner: Vi forutsetter gode kommunikasjonsevner og evne til å etablere og opprettholde gode relasjoner innad i prosjektet og med prosjektdeltakere. Vi forventer også at du deler kompetanse med prosjektdeltakerne. Du må videre kunne håndtere og jobbe i et hektisk miljø hvor hverdagen er styrt av høy aktivitet og samarbeid med andre prosjektdeltakere Du skal snakke og skrive godt norsk. Det vil bli behov for totalt 10-12 reiser til Brønnøysund i avtaleperioden à 4-5 dager (mandag – torsdag/fredag). Hvis avtalen blir forlenget, vil det bli behov for ytterligere 4-6 reiser à 4-5 dager pr. periode à 6 måneder. Under oppstarten kan det bli aktuelt med inntil 2 sammenhengende ukers opphold i Brønnøysund (mandag – torsdag/fredag)."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69002-junior-admin-support/",
    "roles": [
      "Support"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description: Our client in the automotive industry is currently seeking a Junior Admin Support. In this role, you will provide administrative support to the Program Office management team. Main Responsibilities: Sending meeting invitations. Taking and distributing meeting minutes. Updating various intranet systems related to the Program Office. Supporting and maintaining shopping carts in the RTM system. Handling other administrative tasks as needed."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/68998-software-developer-car-cloud-system-ci-cd/",
    "roles": [
      "Developer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is seeking a passionate Software Developer &#8211; Car Cloud System CI/CD. You will be part of a team with colleagues in the same role, where you can share and discuss experiences and problem-solving strategies. In the Connectivity and Cloud Platform team, they build products that enhance the car ownership experience. They work on platforms such as: Connected Car Cloud Platform Telematics Platform Mobile Network Access These platforms connect vehicles globally and allow other product teams to efficiently build customer applications on top. Main Responsibilities: Streamline and enhance CI/CD pipelines using GitLab. Assist developers with project setup, debugging, and access management to ensure a smooth development process. Configure GitLab Runners, manage infrastructure, and deploy resources using Terraform and Ansible. Write scripts to automate repetitive tasks and improve workflow efficiency. Create and manage dashboards to monitor systems and provide real-time insights into infrastructure performance. Actively contribute to brainstorming sessions, propose new ideas, and drive innovative solutions for automation and infrastructure improvements. Work closely with colleagues to ensure infrastructure and security align with industry best practices. Toolchain Used: Frameworks: Docker, Kubernetes Infrastructure: AWS Development &amp; GitOps Tools: GitLab, CI/CD Pipelines, ArgoCD, Harbor, SonarQube, Dependency Tracker, Git Support Tools: Splunk, PagerDuty, Apica, Grafana, Slack, Confluence, Jira Programming Languages &amp; Tools: Python, Java, JavaScript, TypeScript, Terraform, Ansible Qualifications: 2-10+ years of experience in cloud infrastructure and implementing Continuous Integration and Continuous Delivery (CI/CD) Pipelines. Strong understanding of technical architecture, development, design, and project implementation across various domains. BSc degree or higher in Computer Science Engineering or an equivalent field. Desired Attributes: Curious: Open to learning and embracing change. Self-driven: Able to work autonomously and take initiative."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/68966-uppdrag-for-kravstallning-och-inforande-av-nytt-fastighetssystem/",
    "roles": [
      "Projektledare",
      "Projektledning",
      "Projektledning/Management"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning Uppdragstagaren ska ansvara för genomförande av behovsanalys inkluderat kartläggning av processer och arbetssätt hos Fastighetsavdelningen i syfte att identifiera effektiviseringspotential. Arbetet ska därefter omfatta att leda framtagning av krav på nytt system utifrån de effektiviseringar som önskas hos avdelningen. Krav ska övergripande omfatta funktioner och kringliggande tjänster samt villkor för implementering och införande av systemet. Arbetet sker även i samarbete med utsedd upphandlare för genomförande av upphandlingen. Uppdraget omfattar även att efter genomförd upphandling ansvara för att införa systemet i stadens verksamhet i rollen som stadens projektledare, i samarbete med systemleverantörens projektledare och stadens IT-avdelning. I uppdraget ingår därför att under behovsanalysen och genomgående därefter identifiera, analysera och ta fram en plan för vilken information som idag hanteras i andra system som ska överföras till det nya fastighetssystemet. Planen ska även tydliggöra vilken information som istället kommer att hanteras i annat system, så som nytt projektstyrningsverktyg som är ett parallellt projekt som också pågår inom området. Även behov av integrationer omfattas i uppdragstagarens utredningsansvar och ska säkerställas i kravbild i upphandlingen av nytt system samt vilka kostnader detta kan innebära för staden i integrationsprojekt med externa systemleverantörer. Krav på leverans Projektgenomförande och projektdokumentation i enlighet med stadens projektmodell. Som komplettering till stadens projektmodell ska uppdragstagaren ha en egen väl etablerad och beprövad metodik för införande och etablering av system, så som en genomförandeplan där ansvarsfördelning, leveransvillkor mm regleras och följs upp. Team Uppdraget omfattar projektledning med sakkunskap och erfarenhet från fastighetsförvaltning. Erfarenhet från kravfångst, LOU-upphandling, systeminförande och verksamhets- och processutveckling. För uppdraget ska uppdragstagaren tillhandhålla en huvudprojektledare och minst en delprojektledare i ett organisationsteam. Uppdragstagaren och organisationsteamet ska uppfylla samtliga efterfrågade krav, både på individnivå för specifikt beskriven roll samt tillsammans. Uppdragstagaren ska med ett organisationsteam säkra att det finns kompetens att tillgå vid redundans i uppdraget, för att säkra trygghet i leverans av tillgängliga resurser för uppdragsgivaren. Krav på konsult 1. Uppdraget är komplext och kräver bred och djup kompetens. Genomförandet ska ske i team där det är viktigt att samtliga resurser är samspelta. Uppdragstagaren ska kunna offerera ett konsultteam som gemensamt uppfyller alla nedan ställda krav. a. Uppdragstagaren ska bifoga konsultprofiler som gemensamt uppfyller de ställda kraven 2. Uppdragstagaren ska kunna leverera projektledarfunktion med redundans. a. Uppdragstagaren ska ha genomfört projektledning inom offentlig fastighetsverksamhet b. Uppdragstagaren ska med anbudet lämna 4 referensuppdrag avseende under de senaste 7 åren 3. I uppdraget ingår att utveckla processer, vilket ställer krav på god förståelse och arbetslivserfarenhet från verksamhetsutveckling i fastighetsförvaltande verksamhet (förvaltning, drift och ekonomi). a. Uppdragstagaren ska genomfört processutveckling i offentlig fastighetsverksamhet b. Uppdragstagaren ska ha arbetslivserfarenhet från verksamhetsutveckling i fastighetsförvaltande verksamhet c. Uppdragstagaren ska med anbudet lämna 4 referensuppdrag under de senaste 7 åren 4. I uppdraget ingår kravfångst, framtagning av upphandlingsunderlag, upphandling, villkor för implementering samt införande av fastighetssystem utifrån bolagens verksamhetsprocesser. a. Uppdragstagaren ska ha kravställt och infört fastighetssystem i offentlig fastighetsverksamhet b. Uppdragstagaren ska med anbudet lämna 4 referensuppdrag som avslutats inom de senaste 7 åren Hantering av personuppgifter o Hyresavtal o Bilplatsavtal o Användare [&hellip;]"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/68956-projektledare-projekt-forandringsledning-2/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en erfaren projektledare som ska leda två förändringsinitiativ inom vår kunds organisation. Projekten omfattar upphandlingsstöd för patientflödeshantering samt digitalisering av närsjukhus. Som projektledare ansvarar du för att leda upphandlingen och hantera integrationer till befintliga system. Du kommer även att säkerställa en fungerande teknisk miljö för att möjliggöra digitalisering inom närsjukhusen. En viktig del av uppdraget är att ha en kontinuerlig dialog med projektägare och verksamhetsrepresentanter för att klargöra krav och förväntningar. Huvudsakliga ansvarsområden: Leda och koordinera upphandlingen inom patientflödeshantering. Ansvara för integration av upphandlade lösningar med andra system. Säkerställa teknisk miljö för ökad digitalisering av närsjukhus. Klargöra krav och förväntningar genom dialog med projektägare och verksamhetsrepresentanter. Ansvara för upphandlingens alla delar, inklusive budget, planering, uppföljning och dokumentation. Obligatoriska kvalifikationer: Minst 10 års erfarenhet som projektledare för komplexa digitaliseringsprojekt. Minst 10 års erfarenhet av förändringsledning och verksamhetsutveckling. Erfarenhet av att verka i ledande befattningar. Mycket god förmåga att dokumentera och presentera på svenska. Erfarenhet av att förstå vårdpersonalens arbetssätt och behov för att kartlägga processer och informationsflöden. Minst 5 års erfarenhet av projekt inom hälso- och sjukvårdssektorn. Minst 2 års erfarenhet av arbete med IT-lösningar. Erfarenhet av offentlig upphandling (LoU) och integrationsarbete. Svenskt medborgarskap för eventuell säkerhetsklassning. Meriterande kvalifikationer: Erfarenhet av att driva och moderera workshops med olika intressenter. Hög egen drivkraft och förmåga att navigera i komplexa organisationer. Personliga egenskaper: Drivande och resultatfokuserad. Kommunikativ med en god förmåga att samarbeta. Agil och flexibel i sitt arbetssätt. Förmåga att ta ansvar och leda projekt till framgång. God på att hantera krav och förväntningar från olika intressenter. &nbsp; Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/68946-projektledare-systemstod-egenmonitorering/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en projektledare till två uppdrag inom portföljen &#8221;Invånare och patient&#8221;. Dessa uppdrag, Egenmonitorering och Patientinformation, är i linje med strategin &#8221;Interaktion med invånare och patient&#8221; och syftar till att realisera behov inom detta område. Projektet Egenmonitorering är planerat att avslutas 2024-12-31, medan projektet inom Patientinformation successivt skalas upp. Egenmonitorering omfattar införandet av ett upphandlat systemstöd för generell monitoreringstjänst inom kundens förvaltningar. Målet är att bredda användningen inom både specialist- och primärvård samt att nå stora kronikergrupper, mindre nischade målgrupper och patienter i alla ålderskategorier senast 2024-12-31. Arbetet är kopplat till Framtidens Vårdinformationsmiljö, med en stegvis integrering mot journalsystemet Millennium. Projektet Patientinformation syftar till att tillhandahålla kvalitetssäkrad, relevant, jämlik och tillgänglig information i det format som patienten föredrar. Detta förväntas leda till högre kvalitet och effektivare tidsanvändning i vården. Obligatoriska kvalifikationer: Minst 15 års erfarenhet inom hälso- och sjukvården Minst 10 års erfarenhet av projekt inom hälso- och sjukvårdssektorn Gedigen erfarenhet och djup kunskap om egenmonitorering Högskoleutbildning inom hälso- och sjukvård, minst 3 år Erfarenhet av att leda i ledande befattningar Erfarenhet av förändringsledning och verksamhetsutveckling Erfarenhet av att driva stora och komplexa projekt Förmåga att förstå och anpassa sig till vårdpersonalens behov och arbetssätt, samt att kartlägga processer och informationsflöden Agil arbetsmetodik med erfarenhet av att arbeta i dynamiska och föränderliga miljöer Erfarenhet av att planera och leda workshops och samskapande aktiviteter Innovativt tänkande med förmåga att arbeta normkritiskt och nytänkande Mycket god förmåga att dokumentera och presentera på svenska Svenskt medborgarskap för eventuell säkerhetsklassning Meriterande kvalifikationer: Mycket god verksamhetsförståelse och erfarenhet av digitalisering inom hälso- och sjukvårdssektorn Erfarenhet av att arbeta med patientinformation ur ett hälsolitteracitetsperspektiv Personliga egenskaper: Initiativrik och resultatinriktad Kommunikativ och samarbetsinriktad Innovativ och öppen för nya lösningar Strukturerad och organiserad i sitt arbete Anpassningsbar och flexibel i en föränderlig miljö Öppen för normkritiska perspektiv och nytänkande"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/68942-sakerhetskonsult-2/",
    "roles": [
      "Säkerhet"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en säkerhetskonsult som ska ta sig an strategiska och operativa utmaningar inom stora och komplexa organisationer. Du ska ha förmågan att tänka strategiskt, vara en stark ledare och ha en god analytisk förmåga. Vidare krävs det att du kan kommunicera säkerhetskoncept både till tekniska och icke-tekniska intressenter. Du kommer att arbeta nära kundens verksamhet, där du bidrar med expertis inom informations- och IT-säkerhet på en övergripande nivå. I rollen ingår att omvandla säkerhetskrav och lagstiftning till praktiska IT-säkerhetsåtgärder. Du kommer även att bidra till att skapa och förvalta styrande dokument, stötta uppföljningen av säkerhetsarbetet samt implementeringen av regler och reglementen. En central del av uppdraget är att driva strategiska frågor inom informations- och cybersäkerhet samt att delta i arbetet med uppdateringen och implementeringen av NIS-direktivet och NIS2 under 2024. Huvudsakliga ansvarsområden: Konsultation och stöd inom informations- och IT-säkerhet på en övergripande nivå Implementering av säkerhetsåtgärder baserade på säkerhetskrav och lagstiftning Skapande och förvaltning av styrande säkerhetsdokument Uppföljning och implementering av säkerhetsreglementen Driva strategiska säkerhetsfrågor och integrera informations- och cybersäkerhet med IT-säkerhet Bidra till arbetet med uppdatering och implementering av NIS och NIS2-direktivet Obligatoriska kvalifikationer: Dokumenterade certifieringar inom informations- och cybersäkerhet (inom de senaste 5 åren) Erfarenhet av arbete med NIS-direktivet Erfarenhet från offentlig sektor Erfarenhet av arbete i större IT- och informationsmiljöer Utbildning och erfarenhet inom informationssäkerhet, med stark koppling till IT-säkerhet Bevisad förmåga att självständigt driva frågor framåt Meriterande kvalifikationer: Tidigare erfarenhet inom de sektorer uppdraget avser Erfarenhet av arbete inom politiskt styrda organisationer Erfarenhet av att leda implementeringen av ledningssystem för informationssäkerhet Erfarenhet från stora och komplexa IT-miljöer Personliga egenskaper: Strategiskt tänkande: Förmåga att tänka långsiktigt och se helheten i säkerhetsarbetet Stark ledarskapsförmåga: Kapabel att leda och motivera andra i säkerhetsprojekt God analytisk förmåga: Förmåga att analysera och förstå komplexa säkerhetsproblem och finna lösningar Kommunikativ förmåga: Kan förklara säkerhetskoncept för både tekniska och icke-tekniska intressenter Initiativtagande: Drivande och självgående i säkerhetsarbetet Problemlösningsförmåga: Förmåga att hantera och lösa utmaningar i stora och komplexa organisationer Flexibilitet: Anpassningsbar i arbete med olika typer av organisationer och säkerhetsutmaningar Noggrannhet: Strävar efter precision i säkerhetsdokumentation och implementering &nbsp; Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/68888-mechanical-design-engineer-2/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description  Our client is currently seeking a Mechanical Design Engineer as part of their growing development team. They are hiring at both junior and senior levels, and while this ad focuses on a more junior role, senior engineers are encouraged to apply for other available positions. The company offers an exciting opportunity to work on developing high-tech products, particularly antennas for the next generation of autonomous devices. You will be part of the journey from start-up to mass production, contributing to innovative antenna solutions. The working environment is open and collaborative, allowing employees to grow in areas that align with their interests and strengths. Role Overview As a Mechanical Design Engineer, you will be part of a development team of 5-7 engineers, collaborating with a project manager. Your role will involve taking customer projects from concept to complete product, engaging directly with customers to understand their requirements, and working closely with electrical engineers to ensure optimal mechanical and electrical performance. You will also liaise with suppliers to find the best manufacturing solutions and ensure the design meets performance standards. Main Responsibilities: Mechanical design and verification of antennas and other components. Establish mechanical drawings and system designs for new mechanical concepts. Ensure designs are manufacturable at high volumes. Serve as the technical interface with suppliers, manufacturers, and customers. Required Qualifications: University degree in Mechanical Engineering or a similar field. Experience with mechanical CAD work. Proficiency in English and basic computer programming. Strong interest and drive towards technical excellence. Additional Qualifications: Experience with components and antennas in waveguide technology. Knowledge of manufacturing processes such as injection moulding, metallisation, die-casting, stamping, and etching. Experience in the automotive industry. Familiarity with high-volume production and mechanical specification drawings. Knowledge of Six Sigma or similar statistical tools. Experience in using SolidWorks. Desired Attributes: Ability to drive tasks forward in an organized and methodical way. Prestigeless team player who motivates others and readily seeks help from co-workers. Able to handle a dynamic environment in a young, growing company."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/68904-projektledare-process-incident-hantering/",
    "roles": [
      "Incidenthanterare",
      "Projektledare"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en senior IT-projektledare med många års erfarenhet inom IT, förändringsarbete, process &amp; incident-hantering. ‌Krav: Erfarenhet av projektledning i stora, komplexa organisationer Stakeholder management Erfarenhet av projektledning mellan flera länder Flytande engelska Meriterande om man vart på bolag inom energi- och drivmedelssektorn. ‌ Kompetenser: Projektledning, coaching, ledarskap Change Management Förändringsledning Processanalys &amp; processtyrning ITIL-expertis Kvalitetsarbete &amp; Processutveckling Incidenthantering ‌ Personliga egenskaper: Snabbfotad, problemlösare, stresstålig och initiativtagande Kan komma in och projektleda själva arbetet och det verksamma, och inte de tekniska bitarna Organiserad, ordningsam och strukturerad. Orädd, vilja att komma in och styra upp, flexibel till att stötta även i andra processer. Prestigelös, redo att ta sig an utmaningar och djupdyka i problem. Fokus på att skapa struktur och ordning."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/68799-cloud-developer-for-energy-cloud-services/",
    "roles": [
      "Developer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Cloud Developer for Energy Cloud Services. At the Energy Management department within Propulsion and Energy, the team makes life easier for electric vehicle owners. The Energy Cloud Services group optimizes distributed energy resources and smart devices with advanced algorithms, forecasting, and innovative energy management strategies. They also develop APIs for partners and connect hardware, such as wallboxes and home batteries, to the cloud. Their mission is to increase energy efficiency on multiple levels—ranging from individual homes to local grids, and up to the national grid—ultimately benefiting customers, the energy system, and the planet. Main Responsibilities As a Cloud Developer, you will contribute to the future of the company&#8217;s energy ecosystem. You’ll join one of five self-organized teams with a high degree of freedom in both technology and ways of working. Work on backend development, optimizing charging sessions, building backends for wallboxes and home batteries, and aggregating vehicle fleets. Develop third-party APIs and manage cloud integrations for smart devices. Participate in full-stack development for the support dashboard and demo app (for the fifth team). Take ownership of all aspects of development: code writing, requirement gathering, testing, infrastructure management, etc. Work primarily with .NET and AWS as key technology tools. Qualifications: 4+ years of experience as a Cloud Developer. Proficient in .NET, C#, AWS, Kubernetes, MongoDB, Terraform, Grafana, Kafka, and related technologies. Experience in developing and maintaining cloud systems. Skills in AWS management and DevOps practices. Familiarity with cloud security in distributed systems. Experience with event-driven architecture and Infrastructure as Code (IaC) to automate and manage cloud infrastructure. Helpful but not required: Driver’s license (level B). Desired Attributes: Experience with energy systems and an understanding of vehicle technology is a bonus. Passionate about sustainability with a strong analytical mindset. Organized, structured work style. Curiosity-driven, continuously seeking improvement and challenging the status quo. Effective communicator and collaborator, thriving in fast-paced environments. Enthusiastic about exploring new technologies and working in diverse teams."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/68787-senior-surface-designer-2/",
    "roles": [
      "Designer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Senior Surface Designer with excellent skills in ICEM Surf/Alias for the Digital Modelling Exterior Team. The task will be to develop exterior surface models in the late phases of the design process. Main input will be sketches, rough alias models from designers, and scan data from clay models combined with technical input from their studio engineers. Main Responsibilities: Develop exterior surface models during the late phases of the design process (Class-A Surfacing). Work with sketches, rough alias models, and scan data from clay models. Collaborate closely with designers and studio engineers to combine technical input and design requirements. Deliver DSM (Digital Surface Models) in the final stages of the design process, meeting internal DSM gate requirements. Qualifications: Minimum 6 years of experience in Class-A modeling within the automotive industry. Expertise in using ICEM Surf/Alias software. Strong understanding of the technical prerequisites of car design. Experience with both interior and exterior modeling. Additional Qualifications: Experience with both interior and exterior car modeling is a merit. Desired Attributes: A good sense of form and attention to design detail. Ability to build models to Class-A quality standards. Positive and flexible mindset with a &#8221;nothing is impossible&#8221; attitude. Ability to work independently as a top-level modeler. Strong communication skills in verbal and written English."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/68782-cloud-fault-tracing-engineer-4/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Cloud Fault Tracing Engineer. After multiple levels of support, the most challenging issues will reach you and your team. You will be responsible for identifying, diagnosing, and resolving faults within the automotive cloud platform. You will have direct access to the cloud system running on AWS, utilizing the latest tech stack (Kubernetes, Kafka, Docker), as well as access to monitoring and fault tracing tools (such as Splunk). Additionally, you’ll have access to vehicles and test rigs to reproduce issues from the start. You will also work closely with DevOps teams to continuously improve products. The cloud expert support team consists of six people working across three time zones (US, EU, China), allowing you to share experiences and collaborate on market-specific implementations. This role requires a proactive individual who thrives in a fast-paced environment and is skilled at collaborating with cross-functional teams to solve complex technical challenges. Main Responsibilities: Providing customer satisfaction by improving the user experience. Serving as a subject matter expert on cloud support for internal support teams. Engaging with various stakeholders to understand the inner workings of cloud services. Setting up test equipment such as cars and rigs to reproduce issues. Staying well-connected with ongoing changes to anticipate future issues. Building solid documentation to resolve identified misconfigurations. Contributing to the design of interfaces and tools to streamline support processes. Required Qualifications: BSc degree or higher in engineering, or equivalent experience. 1-5 years of experience with cloud technologies and problem-solving in a technical support role. Proficiency in both spoken and written English. Technical Skills: AWS, Docker, Kubernetes, Envoy, Istio Jira, GitLab, GitHub, Maven, GitOps, Argo CD Splunk, Linux/SSH/Bash, Grafana Desired Attributes: A passion for helping people and solving technological challenges. Strong communication skills, with the ability to articulate complex ideas clearly to both technical and non-technical audiences. A collaborative mindset and the ability to work effectively with cross-functional teams. A structured and analytical approach to problem-solving, with a focus on results."
    ]
  }
]