[
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72899-projektledare-56/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning Vi söker en projektledare för vår kunds räkning. Arbetet kommer att utföras både på kundens kontor och delvis på distans. Vid resor mellan kontor används främst kollektivtrafik. Huvudsakliga ansvarsområden: Driva och koordinera olika IT-projekt som initieras av kundens olika verksamheter. Ansvara för projekt som relaterar till användarnära IT-infrastruktur samt fastighetstekniska system där IT-stödet spelar en central roll. Föra dialog med beställare och kunder för att klargöra krav och förväntningar, samt säkerställa att dessa möts under projektets gång. Ansvara för genomförandet av projekt, oavsett om det rör sig om små eller större uppdrag med varierande komplexitet. Sköta projektens budget, planering, uppföljning och dokumentation på ett professionellt sätt. Beroende på projektens storlek förväntas du hantera flera projekt samtidigt. De flesta projekten är IT-relaterade, men vissa kan vara mer koordinerande eller förändringsorienterade. Obligatoriska kvalifikationer: Minst 5 års erfarenhet som IT-projektledare, med erfarenheter som är högst 10 år gamla. Djup och bred kunskap inom användarnära IT-infrastruktur och generell IT-infrastruktur. Gedigen erfarenhet av att leda virtuella team med varierande kompetens. Mycket god förmåga att dokumentera och presentera på svenska. Trivs i en drivande och självständig roll. Svenskt medborgarskap krävs för att kunna genomgå säkerhetsprövning. Ett detaljerat CV som tydligt beskriver din erfarenhet inom området. B-körkort krävs. Meriterande kvalifikationer: Tidigare erfarenhet inom de specifika sektorer som uppdraget omfattar. Erfarenhet av arbete i större organisationer med politisk styrning. Erfarenhet av att leda förändringsarbeten med agila metoder. Erfarenhet av arbete i stora och komplexa IT-miljöer. Ett agilt förhållningssätt i ditt arbetssätt. Bred IT-kompetens som sträcker sig över flera områden. Personliga egenskaper: Stark samarbetsförmåga men också bekväm med att arbeta självständigt. Prestigelös och generös med att dela med dig av din erfarenhet och idéer. Engagerad, drivande och lyhörd i din kommunikation och ditt arbetssätt."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72892-teknisk-specialist-med-mim-kompetens/",
    "roles": [
      "Teknisk specialist"
    ],
    "places": [
      "Göteborg",
      "Hybrid"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en teknisk specialist med kompetens inom Microsoft Identity Manager (MIM). Vår kund vill fortsätta arbetet med att etablera och förbättra en plattform för att möjliggöra tillgång till applikationer inom Identity Fabric. Teamet kommer att utveckla en modern plattform som en tjänst, där både utvecklare och ansvariga för tjänster får tillgång till de tekniska verktyg som krävs för effektivt arbete. Huvudsakliga ansvarsområden: Ansvara för övervakning och hantering av MIM-installationens livscykel. Analysera och felsöka incidenter genom att granska loggar och samarbeta med kollegor för att identifiera och lösa problem. Obligatoriska kvalifikationer: Djupgående erfarenhet och kompetens i att drifta Microsoft Identity Manager (MIM) i stora organisationer. Erfarenhet av att installera och hantera MIM i offentlig sektor. Kunskap om DevOps-metodik, infrastruktur som kod samt plattformar för identitetshantering och åtkomstkontroll. Svenskt medborgarskap krävs då uppdraget kan bli säkerhetsklassat. Personliga egenskaper: Självständig och tekniskt kunnig med lång erfarenhet inom området. Förmåga att arbeta självständigt och lösa komplexa tekniska utmaningar. Erfarenhet av systemövervakning och hantering av systemens livscykel. Ansvarstagande, noggrann och resultatorienterad med en problemlösande inställning. God samarbetsförmåga och stark kommunikationsförmåga, flytande på både svenska och engelska i tal och skrift. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72878-projektledare-ibc-hotlab/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en projektledare med ansvar för att leda och koordinera införandet av IBC Hotlab. Projektet innebär nära samarbete med en leverantör baserad i Nederländerna, vilket kräver god kommunikationsförmåga på engelska. Projektledaren kommer att ha en central roll i kontakten med både verksamhetens och IT-avdelningens intressenter. Bakgrund: Kundens plattform för digitalisering stödjer verksamheterna i anskaffning, utveckling och implementering av IT-tjänster. Enheten för projekt- och förändringsledning arbetar med att driva projekt som följer kundens digitaliseringsstrategi och tekniska utveckling. Denna enhet ansvarar även för att kvalitetssäkra IT-leveranser. Projekt- och förändringsledarna driver digitaliseringsprojekt som har initierats utifrån olika behov inom organisationens förvaltningar. Enheten fokuserar främst på nyutvecklingsprojekt, men det förekommer även vidareutvecklingsprojekt och avrop av kompetens från externa leverantörer. Kunden har idag en föråldrad metod för hantering av radiofarmaka inom nuklearmedicinska laboratorier. Detta system uppfyller inte längre moderna krav på patientsäkerhet eller myndighetskrav. IBC Hotlab-systemet har upphandlats för att skapa ett integrerat och säkert system för hantering och registrering av radioaktiva läkemedel, vilket kommer att förbättra patientsäkerheten och öka spårbarheten genom att eliminera manuell hantering. Huvudsakliga ansvarsområden: Leda och driva införandet av IBC Hotlab. Vara huvudansvarig för kontakterna med verksamheten och IT-avdelningen. Regelbunden uppföljning med projektägare och säkerställande av projektets framdrift. Ansvara för att kommunicera och koordinera med leverantören baserad i Nederländerna. Säkerställa att projektet följer de krav som ställs från myndigheter som Strålskyddsmyndigheten och Läkemedelsverket. Obligatoriska kvalifikationer: Minst 5 års erfarenhet som projektledare inom digitalisering och verksamhetsutveckling. Gedigen erfarenhet av att leda virtuella team och använda digitala verktyg som Microsoft365. Mycket god förmåga att dokumentera och presentera komplex information på svenska för olika målgrupper. Förmåga att fatta beslut och driva projektet framåt med stort ansvar. Svenskt medborgarskap, för möjlighet att säkerhetsklassas vid behov. Erfarenhet av att leda IT-projekt inom offentlig sektor. Stark förmåga att kommunicera på engelska. Meriterande kvalifikationer: Erfarenhet av att leda IT-projekt inom digitalisering inom hälso- och sjukvårdssektorn. Kunskap och erfarenhet av agila arbetsmetoder. Erfarenhet av förändringsledning. Personliga egenskaper: Konsulten bör vara engagerad, drivande och lyhörd. Förmåga att vara prestigelös och lyssna in olika parter, samtidigt som man delar med sig av sina erfarenheter och idéer. Stark förmåga att hantera flera intressenter och balansera olika behov i projektet. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72858-teknisk-specialist-plattformar-brandvaggsomrade/",
    "roles": [
      "Teknisk specialist"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nuen teknisk specialist inom brandväggsplattformar. I denna roll kommer du att vara en viktig del av teamet och bidra med utbildning av kundens personal samt stötta tekniska teamet under detaljplanering, installation och migrering till den nya brandväggslösningen. Eftersom det rör sig om en ny produkt för kunden, kommer du att agera som rådgivare och expert vid övergången till den nya plattformen. Du kommer att spela en central roll i att utforma och konfigurera den framtida brandväggsmiljön samt överföra de befintliga regelverken från den nuvarande brandväggsplattformen till den nya. Huvudsakliga ansvarsområden: Utbilda kundens personal och stödja teknisk personal under implementering och migrering till ny brandväggsplattform. Fungera som rådgivare och expert vid övergången till den nya plattformen. Detaljplanera och konfigurera den framtida brandväggsmiljön. Flytta och migrera befintliga brandväggsregelverk till den nya plattformen. Obligatoriska kvalifikationer: Djup erfarenhet av Fortigate. Gedigen kunskap om FortiAnalyzer och FortiManager. Erfarenhet av att implementera Fortinet-produkter i storskaliga IT-miljöer. Erfarenhet av Cisco Security Manager och Cisco ASA-brandväggar. Stark erfarenhet av att arbeta med brandväggskonfigurationer och komplexa nätverk, inklusive redundans. Eftersom konsultuppdraget kan vara säkerhetsklassat, krävs att du är svensk medborgare. Meriterande kvalifikationer: Erfarenhet av att sätta upp BGP i Fortigate-miljöer. Personliga egenskaper: Du har mycket god förmåga att arbeta i team och är tekniskt kompetent inom nätverks- och brandväggsområdet. Du är skicklig på att förmedla din expertis och stödja både kundens och teamets personal under utbildnings- och implementeringsprocessen. Du är noggrann, van vid att ta ansvar och är drivande och lösningsorienterad. Du har stark kommunikativ förmåga och kan arbeta effektivt med både svenska och engelska, i tal och skrift. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72846-teknisk-specialist-drift-adc/",
    "roles": [
      "Teknisk specialist"
    ],
    "places": [
      "Skövde",
      "Vänersborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en teknisk specialist för att ansluta till deras ADC-team. I denna roll kommer du att arbeta med att implementera, hantera och utföra beställningar samt säkerställa stabil drift av lastbalanserare och applikationer. Arbetsuppgifterna inkluderar konfigurering av F5 BIG-IP och andra lastbalanseringsprodukter, samt support och felsökning inom dessa områden. Huvudsakliga ansvarsområden: Implementering och konfigurering av lastbalanserare, särskilt F5 BIG-IP och Loadbalancer eller motsvarande system. Hantera teknisk support och utföra felsökning för att lösa problem relaterade till nätverks- och applikationsdrift. Arbeta i miljöer med hög säkerhet och komplexa integrationer, där förståelse för lastbalanseringens mekanismer är avgörande. Obligatoriska kvalifikationer: Nätverkslösningar: Erfarenhet av att arbeta med nätverkskomponenter, inklusive lastbalanserare, brandväggar och nätverkssäkerhet. Nätverksprotokoll: Djup förståelse för grundläggande nätverksprotokoll som TCP/IP, DNS, med flera. Lastbalansering och F5 BIG-IP: Praktisk erfarenhet av att implementera och konfigurera lastbalanserare som F5 BIG-IP eller Loadbalancer, eller liknande produkter. Support och felsökning: Förmåga att snabbt identifiera och åtgärda problem relaterade till nätverk och applikationer för att säkerställa stabil drift. Dokumentation: Erfarenhet av att skapa teknisk dokumentation och förmåga att kommunicera effektivt på svenska, både skriftligt och muntligt. Meriterande kvalifikationer: Nätverkskompetens: Erfarenhet som nätverkstekniker eller specialist inom IT-infrastruktur, med omfattande kunskap om nätverk och säkerhet. Kundfokus: Förmåga att arbeta nära både interna och externa intressenter för att identifiera och möta deras behov och krav på nätverkslösningar. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72816-projektledare-55/",
    "roles": [],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning: Vår kund söker nu en erfaren delprojektledare som ska ta ansvar för implementationsprojektledning med särskilt fokus på kundens åtaganden. Uppdraget kräver nära samarbete med leverantören och kontinuerlig dialog med kundens interna resurser inom IT, verksamhet och externa leverantörer. Du kommer verka inom projektet och rapportera till huvudprojektledaren. Projektet syftar till att designa och implementera en ny butiks- och kassalösning för kund. Du har en holistisk förståelse för processer och kan navigera i en föränderlig miljö. (Erfarenhetsnivå 4-6 år) &nbsp; Ansvarsområden: Leda samarbetet mellan kunden och leverantören och övriga intressenter. Säkerställa lösningens omfattning, framgångskriterier, och budgetuppföljning. Beskriva alternativa lösningar baserat på krav och begränsningar. Leda arbetet kring integrationer och förändringar i kringliggande system. Säkerställa kommunikation och genomförande med intressenter Inom projektet finns ansvariga för övergripande kvalitet &amp; test samt förändringsledning, det är viktigt att förankra och samarbeta med dessa för att vara framgångsrik i din roll. Projektledarbetet kräver att du är ihärdig, hittar vägar att ta sig fram och att du är duktig på att driva frågor hela vägen i mål. Personliga egenskaper: Lätt för att uttrycka dig skriftligt, illustrativt och muntligt. Du har goda kunskaper i Office-paketet (PowerPoint, Excel, Word). Flytande i svenska och engelska Ledaregenskaper och kan ta ansvar för projektledning ur alla aspekter mellan leverantören och specifikt i programmet. Du har förmågan att leda både dig själv och andra projektdeltagare effektivt. Definiera projektmedlemmar och säkra förväntningar (både mot individer och mellan projektmedlemmar) Kommunikativ och öppen Saklig och professionell Planera, Mäta och övervaka progress samt kommunicera status till intressenter. Driva ägandeskap för beslut och skapa förutsättningar för beslut. Främja förändringshantering Förmåga att motivera projektmedlemmar och intressenter. Du är proaktiv, orädd och redo att ta initiativ. Önskemål om tidigare erfarenhet: Erfarenhet från Retail (krav). Erfarenhet av POS-lösningar och betalningar (meriterande). Tidigare arbetat som projektledare i vattenfalls- och/eller agila miljöer, gärna en hybridmodell. Deltagit i större transformationsprojekt/program. SAP-erfarenhet är ett plus Erfarenhet av stora program och komplexa relationer mellan legacy- och nya system Erfarenhet från en större organisation och kunna navigera sig fram i en dynamisk miljö"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72820-systemutvecklare-sharepoint/",
    "roles": [
      "Utvecklare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en systemutvecklare med erfarenhet av SharePoint. Du kommer att ingå i ett team av utvecklare och applikationsspecialister. Större delen av teamet är baserat i Göteborg, men några medlemmar finns även på andra platser i Göteborgsområdet. Det finns inga krav på resande. Kundens tjänst är en kritisk komponent för att säkerställa en effektiv dokumenthantering inom organisationen. Därför behövs en systemutvecklare med djup kunskap inom dokumenthanteringssystem och frontend-design. Tjänsten involverar arbete med en hybridlösning av SharePoint 2019 och SharePoint On-premise, där en förståelse för hur integrationer med andra system fungerar är central. Huvudsakliga ansvarsområden: Förvalta och vidareutveckla ett dokumenthanteringssystem byggt i SharePoint. Arbeta med frontend-utveckling, buggrättningar och förbättringar för att säkerställa att systemet är i linje med gällande lagstiftning och organisationens behov. Hantera och utföra automatiserade tester i Cypress för att garantera systemets kvalitet och stabilitet. Utveckla och underhålla lösningar i SharePoint 2019, med fokus på integrationer och samverkan med stödjande system. Obligatoriska kvalifikationer: Minst 5 års erfarenhet av frontend-utveckling inom M365/SharePoint. 3–5 års erfarenhet av arbete enligt agila metoder. God förståelse för integrationer mellan dokumenthanteringssystem och andra system. Gedigen erfarenhet av frontend-utveckling. Erfarenhet av att arbeta med automatiserade tester, särskilt i Cypress. Meriterande kvalifikationer: Erfarenhet av att arbeta inom stora politiska organisationer. Håller sig uppdaterad med den senaste utvecklingen inom M365. Förmåga att kommunicera effektivt med användare, samt hålla i presentationer och demonstrationer. Personliga egenskaper: Du är självgående och har god samarbetsförmåga, både inom ditt team och med externa parter."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72815-projektledare-54/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Distans",
      "Gävle"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en projektledare som har kunskap inom verksamhetsutveckling. Rollbeskrivning: Du kommer att ha ansvar för att driva, samordna och leda projektet genom dess livscykel. Det ingår arbete med bl.a. förändringsledning, tjänstedesign, agila arbetssätt, nytta- och effektmätning i olika omständigheter. Skallkrav: B-körkort Du ska ha relevant eftergymnasial utbildning Du ska ha minst 5 års dokumenterad erfarenhet av projektledning Du ska ha minst 5 års dokumenterad erfarenhet av arbete i ledande positioner Du ska ha erfarenhet av att driva projekt inom IT-verksamhet och/eller digitalisering Du ska ha erfarenhet av att driva arbete med national digital infrastruktur tex Säker Digital Kommunikation, Digitala Nationella, KLASSA prov mfl Du ska ha erfarenhet och förståelse av IT-tekniska lösningar Du ska ha erfarenhet av arbete med systemintegrationer Du ska ha erfarenhet av att ta fram och dokumentera krav och behov Du ska ha certifiering eller vara diplomerad förändringsledare Du ska ha dokumenterad kompetens av agil projektledning Du ska ha erfarenhet av IT-projekt i stora och komplexa IT-miljöer Du ska ha erfarenhet av samverkan med intressenter från flera olika organisationer i projekt/uppdrag tex SKR, DIGG mfl Du ska ha erfarenhet av att samordna utredningsarbete gällande juridiska frågeställningar Du ska ha erfarenhet av att samordna utredningsarbete gällande informationssäkerhet Du ska ha erfarenhet från att ta fram och presentera tydliga beslutsunderlag Du ska ha god planeringsförmåga och vara strukturerad i sitt arbetssätt Du ska ha god samarbetsförmåga samt kommunikationsförmåga i så väl i tal och skrift på svenska Du ska ha erfarenhet av uppdrag där fokus är på att leverera resultat och uppfylla kundförväntningar Du ska utföra ditt uppdrag delvis på plats i vår kunds lokaler i Gävle. Beroende på arbetsuppgifter och uppdrag så förekommer arbete fysiskt på plats i Gävle."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72802-arkitekt-4/",
    "roles": [
      "Architect",
      "Arkitekt"
    ],
    "places": [
      "Kalmar",
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu ett flertal arkitekter. Ditt uppdrag kommer att omfatta exempelvis utredning, analys och modellering av intressenter, verksamhet, processer, information, applikation och teknik. Områden som kan bli aktuella för utredning är bland annat: Identitet, behörighet och spårbarhet Ombud Spärr och samtycken Grunddata: person, personal och organisation Adressering och informationslokalisering Kliniskt informationsutbyte Terminologi Invånaringång Skallkrav: Du ska uppfylla minst kompetensnivå (3). Vilket innebär att du besitter hög kompetens inom aktuellt område/roll och har arbetat i 4-8 år inom området/rollen. Du ska ha minst (4) års erfarenhet av IT-arkitektur som kan omsättas till hållbara lösningar. Du ska ha relevant universitets- eller högskoleutbildning eller arbetslivserfarenhet som bedöms likvärdig. Börkrav: Du bör ha minst (2) års erfarenhet av att ha arbetat som IT-arkitekt inom vårdsektorn. Du bör ha certifiering inom IT-arkitektur. Du bör ha erfarenhet av ramverket SAFe. &nbsp; Du kommer att behöva arbeta på plats i vår kunds lokaler i Stockholm eller Kalmar 2 dagar i veckan. Du måste kunna närvara i Kalmar på PI-planning 11-13 november. &nbsp;"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72775-junior-cloud-engineer/",
    "roles": [
      "Cloud Engineer"
    ],
    "places": [
      "Lund"
    ],
    "description": [
      "Assignment Description: The Car Cloud Platform organization within Software Digital develops and maintains cloud services globally to contribute to the overall connected experience for our customers. We build, provide and operate a highly secure run-time ecosystem for functions and applications serving our connected cars, and their users. We aim to optimize functional and organic growth by using standard cloud technologies with high level of synergies and re-use. With our car cloud solution, we provide cloud infrastructure, platform core &amp; services to support software development lifecycle (DevOps) by providing tools for fast feedback &amp; built-in quality. What you´ll do You can work in an ever-evolving agile way of working where you will be part of an empowered product team that strives for continuous learning and improvement. You and your team are, among many other things, responsible for the DevOps of the ingress gateways globally to the car cloud platform clusters. You will collaborate with your Product Owner to ensure the right functionality is being developed and estimate the size and complexity of the work to be able to plan upcoming sprints. You will determine and maintain the technical design in our area within the given architectural guidelines. Tech we use daily: SW Languages: Java (Spring), GolangFrameworks: Docker, Kubernetes, Spring, Istio Infrastructure: AWS Databases: Cassandra or similar (NoSQL), MySQL, Oracle, MongoDB Middleware: Kafka, JMS, IBM MQ, MQTT Tools: CI/CD Pipelines, GIT or similar Test automation: Unit test frameworks, Component test frameworks Monitoring: Splunk, Grafana, Prometheus Architecture: Micro Service Architecture Development methodology principles: gitOps, Scrum, DevOps Automation: Python Do you fit the profile? We believe you have a BSc degree or higher in computer science or equivalent. We believe that you are a fast learner who will thrive in an environment with experienced developers and cloud engineers. We believe that you have a strong interest in exploring various aspects of software development. Software development skills are important, but particular experience with all tech that you will use in this position is not expected. The ability and interest to learn is. For you to fully enjoy this opportunity, we believe that you have a genuine interest of working and developing in a product area. You embrace teamwork, collaboration and are eager to learn and develop new competences. If both parties are satisfied, the contract will transition into a permanent employment position, ensuring a continued and stable working relationship."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72770-teknisk-systemforvaltare/",
    "roles": [
      "Systemförvaltare"
    ],
    "places": [
      "Göteborg",
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en Teknisk Systemförvaltare. Rollen innebär arbete med olika plattformar, där ett centralt system att förvalta är Antura. Det är fördelaktigt om du har erfarenhet av andra byggprojektsystem som Byggnet, Dalux, Drofus, Ibinder, Interaxo och tidplaneringssystem. Du bör även ha gedigna kunskaper inom M365, SharePoint och Teams, samt en bred förståelse för Windowsmiljö, Power BI-tjänster, AD och Azure Entra ID. Erfarenhet av ritningssystem och en viss förståelse för BIM och CAD är också önskvärd. Huvudsakliga ansvarsområden: Ansvara för teknisk förvaltning av IT-system inom byggprojekt. Leda implementeringen av en ny projektportal och avveckla befintliga system. Migrera data och säkerställa att den nya lösningen uppfyller alla funktionalitetskrav. Planera och koordinera systemutveckling och uppgraderingar. Hantera teknisk support, incidenthantering och säkerhetsåtgärder (ex. backup, MFA, redundans). Arbeta nära tillsammans med systemförvaltare och systemägare inom verksamheten. Obligatoriska kvalifikationer: Erfarenhet av teknisk systemförvaltning eller erfarenhet av arbetssätt och systemanvändning inom byggprojekt. Stark IT-kompetens, inklusive systemförståelse och integrationer. Förståelse för verksamhetsbehov och förmåga att översätta dessa till digitala lösningar. Förmåga att ge råd kring tekniska lösningar och föreslå lämpliga åtgärder. Erfarenhet av projektledning och att leda tekniska uppdrag, såsom exempelvis dokumentmigrering och avveckling av system. Meriterande kvalifikationer: Erfarenhet från byggprojekt eller fastighetsförvaltning. Gedigna kunskaper inom M365, SharePoint och Teams, samt en bred förståelse för Windowsmiljö, Power BI-tjänster, AD och Azure Entra ID, ritningssystem och viss kunskap om BIM och CAD."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72774-handledare-till-mottagning-barn-unga-och-familj/",
    "roles": [
      "Handledare"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Lidingö stad söker en handledare för uppdrag om att handleda socialsekreterare inom mottagning barn, unga och familj. Uppdraget omfattar ärende- och processhandledning med särskild kompetens inom förhållningssättet Signs of Safety. Uppskattad tid i timmar för uppdraget: två timmar per tillfälle, en gång per månad. Krav på leverans God och långvarig kunskap om socialtjänstens uppdrag och om barn och ungas utveckling. Process och grupphandledning utifrån olika teman samt kompetens om Signs of Safety. Handlingar som ska ingå i offert: &#8211; CV &#8211; Referensförteckning &#8211; Certifikat &#8211; Pris Skallkrav Erfarenhet att handleda socialsekreterare Erfarenhet av ärende och proceshandledning Kompetens inom Signs of safety Handledarutbildning samt socionomexamen Övriga krav Bifoga två (2) referensuppdrag samt kontaktuppgifter till referenspersoner Bifoga certifiering om färdigställd handledarutbildning samt socionomexamen &nbsp; För att kunna ansöka för detta uppdrag måste du vara en registrerad användare i vår portal som är helt kostnadsfri. Är du ny användare och vill registrera dig eller ditt bolag i Upgrades portal klicka här: https://portal.upgraded.se/"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72753-systemforvaltare-lucene-solr-och-apelon/",
    "roles": [
      "Systemförvaltare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en systemförvaltare med erfarenhet inom Lucene Solr och Apelon. Kunden har under flera år utvecklat sina söktjänster utifrån en gemensam teknisk plattform, som består av flera komponenter, däribland Solr/Lucene, Elasticsearch, i3, Kibana, och Zookeeper. Plattformen är utformad för att möta användarnas specifika behov och krav. Rollen kräver djupgående kunskap om hantering av dessa komponenter samt sökexpertis inom relevans, statistik och vidareutveckling av sökfunktioner. Huvudsakliga ansvarsområden: Förvalta och underhålla alla komponenter i sökplattformen, exempelvis genom att: Uppgradera till nyare versioner. Optimera kod. Skapa vyer för sökordsstatistik. Dokumentera arbetsprocesser och tekniska lösningar. Vidareutveckla sökfunktioner och tjänster i linje med verksamhetens krav och behov. Ge support på tredje linjen för KSD (kundservice-delen). Delta i projekt och uppdrag som rör sökmotorns plattform. Ha en helhetssyn på hur informationskällor hanteras och integreras i sökmotorn. Koordinera arbetet i sökteamet och ha en samordnande roll i utvecklingsprocessen. Obligatoriska kvalifikationer: Djup teknisk kompetens inom: Lucene/Solr i3 ELK/Kibana Elasticsearch Erfarenhet av hantering av informationskällor såsom: SharePoint/SOFIA Public360 Optimizely Gedigen erfarenhet av att arbeta agilt. Erfarenhet av arbete inom offentlig sektor. Förmåga att översätta kund- och användarkrav till tekniska lösningar. Meriterande kvalifikationer: Erfarenhet av att ha arbetat inom offentlig sektor. Flerårig erfarenhet av teknologier som Lucene/Solr, i3, ELK/Kibana och Elasticsearch. Kompetens inom hantering av ytterligare informationskällor, exempelvis: Optimizely Apelon Datakatalogen Erfarenhet av gränssnittsutveckling, särskilt för att skapa sökfilter. Personliga egenskaper: Pedagogisk och strukturerad, med god förmåga att dokumentera och presentera tekniska lösningar. Stark kommunikationsförmåga, särskilt när det gäller att förklara komplexa sökfunktioner. Förmåga att följa upp arbetsprocesser och säkerställa att mål uppnås. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72740-testledare-17/",
    "roles": [
      "Testledare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en Testledare. I denna roll kommer du att leda testarbete i projekt inom offentlig sektor, särskilt med fokus på hälso- och sjukvård. Du förväntas säkerställa kvaliteten genom hela projektet och arbeta nära olika intressenter för att uppnå projektmålen. Obligatoriska kvalifikationer: För att vara kvalificerad för rollen krävs följande: ISTQB-certifiering. Minst 3 års dokumenterad erfarenhet som testledare. Erfarenhet av att leda projekt inom offentligt styrd hälso- och sjukvård. Mycket god förmåga att dokumentera och presentera på svenska. Goda kunskaper i engelska, både i tal och skrift. Praktisk erfarenhet av att använda ledande testverktyg, såsom ReQtest. Meriterande kvalifikationer: Följande kvalifikationer är meriterande: Erfarenhet av och kunskap om projektorganisationer inom offentlig sektor. Praktisk erfarenhet av att arbeta med testverktyget Azure DevOps. Vana vid stora och komplexa projektmiljöer. Mycket goda kunskaper om agila arbetsmetoder. Erfarenhet av medicintekniska produkter och tillhörande regelverk. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72731-fullstack-utvecklare-9/",
    "roles": [
      ".NET-utvecklare"
    ],
    "places": [
      "Lund"
    ],
    "description": [
      "Uppdragsbeskrivning: Vår kund söker nu en driven och erfaren .NET-utvecklare för att stärka device Manager-teamet, en Windowsapplikation som används av våra största kunder för att hantera och samla in data on-prem. Vi har stort fokus på modernisering och planerar att uppgradera applikationen till .NET 8. Du kommer vara på plats i Lund 4 dagar i veckan Kvalifikationer: 5-10 års erfarenhet inom .NET-utveckling. 2 år inom React utveckling Tidigare erfarenhet av att arbeta med moderna .NET-teknologier och projekt. Stark analytisk och problemlösande förmåga. Teamorienterad, med god kommunikationsförmåga. Flytande svenska eller engelska som språk."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72727-devops-engineer-24/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en DevOps Engineer till kundens digitaliseringssatsning inom IOC och plattformar. Du kommer att vara en viktig del i utvecklingen av framtidens tjänster för patienter, invånare och medarbetare. Rollen innebär att bygga nya förmågor och utveckla tjänster för att bättre förstå och möta aktuella och framtida behov. Kunden erbjuder en flexibel arbetsmiljö, där du har möjlighet att arbeta både på distans och från deras kontor i Göteborgsområdet, beroende på verksamhetens förutsättningar. Huvudsakliga ansvarsområden: Som DevOps Engineer kommer dina huvudsakliga ansvarsområden att vara: Vidareutveckla och drifta vår kunds hostingplattform tillsammans med teamet. Arbeta i en agil och öppen organisation som befinner sig i en kreativ och intensiv utvecklingsfas. Bidra till att teamet utvecklar lösningar som möter deras behov av serverlösningar. Minska tiden det tar för applikationsteam att produktionssätta ett system genom optimering och automatisering. Standardisera och automatisera hostingplattformen för att öka effektiviteten. Arbeta med &#8221;Infrastructure as Code&#8221; (IaC) och säkerställa återanvändbara funktioner och en enhetlig serverpark. Implementera processer som förbättrar effektiviteten och minskar risken för fel. Tillhandahålla en hostingplattform som underlättar för användare att konsumera och drifta standardiserade servrar. Obligatoriska kvalifikationer För att kvalificera dig för rollen krävs följande: Minst 5 års erfarenhet av att arbeta i stora organisationer inom offentlig sektor. Gedigen erfarenhet av serveradministration inom stora Windows-miljöer. Omfattande erfarenhet av serveradministration inom Linux-miljöer. Erfarenhet av att implementera automatiserade processer och självbetjäningslösningar. Erfarenhet av agila arbetsmetoder. Förmåga att uttrycka dig väl i både tal och skrift på svenska och engelska. Svenskt medborgarskap, då tjänsten kommer att säkerhetsklassas. Praktisk erfarenhet av att arbeta med stora serverparker. Förmåga att skapa återanvändbara funktioner och självbetjäningslösningar genom script och API, för att minimera manuell inblandning i det dagliga arbetet. Meriterande kvalifikationer: Det är meriterande om du har erfarenhet av följande: Ansible/AWX. Microsoft Endpoint Configuration Manager (MECM/SCCM). OP5 och Systems Center Operations Manager (SCOM). Active Directory (AD) och Group Policies. Säkerhetsarbete för att säkra serverplattformar. Virtualisering med hjälp av VMWare. Automatisering genom script såsom PowerShell, Python eller shellscript. Erfarenhet av Scrum. Personliga egenskaper: Vi söker dig som: Är självgående och samtidigt en god lagspelare. Är nyfiken och har ett starkt driv att ständigt utvecklas. Har en vilja att dela med dig av kunskap och stötta dina kollegor. Har god kommunikations- och samarbetsförmåga då rollen innebär kontakt med olika delar av organisationen. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72698-projektledare-for-inforande-av-m365-pa-taby-kommun-3/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdraget består i att leda införandet av Microsoft365 till kommunens alla medarbetare. Det innebär att lösningen ska konfigureras, implementeras till användarna samt att avveckla gamla miljön i de fall det blir aktuellt. I arbetet ingår att ta fram övergripande planering, aktivitetsplan med en föreslagen utrullningssekvens. I projektet ingår också att leda framtagande av stödmaterial, så som manualer, övergripande kommunikation, med mera. Konsulten kommer att projektleda arbetet, föredra till styrgrupp och i vissa fall själv utföra moment vid behov tillsammans med kommunens medarbetare. Uppskattad tid i timmar för uppdraget: 50%-30%, beroende på takt och behov under projekttiden. Mer tid förväntas för uppstart och avslut, och mindre för det löpande genomförandet. Möjlighet till förlängning: till och med 30 oktober 2025. Förväntat resultat Välfungerande M365 miljö för kommunen. Projektorganisation Avropad konsult kommer att leda arbetet och själv utföra moment vid behov tillsammans med kommunens medarbetare, och vid behov ta in konsultstöd. Avropad konsult rapporterar till styrgrupp. Hantering av personuppgifter a) Vilka typer av personuppgifter får behandlas: personuppgifter så som känsliga personuppgifter. b) Vilka kategorier av registrerade personer kommer behandlas: medarbetare i kommunen samt konsulter. c) Vilka eventuella loggningskrav gäller för personuppgiftsbehandlingen samt vilka ska ha tillgång till dem: Loggning i ärendehanteringssystem. Handlingar som ska ingå i offert: &#8211; CV &#8211; Referensförteckning &#8211; Certifikat &#8211; Tidplan Skallkrav Har minst två års erfarenhet av att ha arbetat konsultativt Har ansvarat för framtagande av analyser/utredningar Har erfarenhet av att ha arbetat med frågor om analys med personer i ledande befattningar Har relevant akademisk utbildning omfattande åtminstone 120 poäng enligt det gamla poängsystemet eller åtminstone 180 poäng enligt det nya poängsystemet på svenska högskolor och universitet. Kravet är även uppfyllt om konsulten genomfört motsvarande studier vid ett utländskt lärosäte. Åtminstone 60 poäng enligt det famla poängsystemet eller åtminstone 90 poäng enligt det nya poängsystemet ska vara inom företags- och/eller nationalekonomi Personliga egenskaper God förmåga till kommunikation, planering och logistik Meriterande med erfarenhet av liknande uppdrag på Täby kommun Övriga krav Erbjudna resurser ska ha utfört minst två (2) likvärdigt uppdrag (utrullning som berör alla medarbetare) hos en kommun det två (2) senaste åren Minst en (1) kontaktperson och kontaktuppgifter för referenstagning i kommun Bifoga certifiering inom projektledning Bifoga tidplan. Konsulten bifogar ett förslag på beläggning över projektets löptid och timkostnad &nbsp; För att kunna ansöka för detta uppdrag måste du vara en registrerad användare i vår portal som är helt kostnadsfri. Är du ny användare och vill registrera dig eller ditt bolag i Upgrades portal klicka här: https://portal.upgraded.se/"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72686-projektledare-for-inforande-av-m365-pa-taby-kommun-2/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdraget består i att leda införandet av Microsoft365 till kommunens alla medarbetare. Det innebär att lösningen ska konfigureras, implementeras till användarna samt att avveckla gamla miljön i de fall det blir aktuellt. I arbetet ingår att ta fram övergripande planering, aktivitetsplan med en föreslagen utrullningssekvens. I projektet ingår också att leda framtagande av stödmaterial, så som manualer, övergripande kommunikation, med mera. Konsulten kommer att projektleda arbetet, föredra till styrgrupp och i vissa fall själv utföra moment vid behov tillsammans med kommunens medarbetare. Uppskattad tid i timmar för uppdraget: 50%-30%, beroende på takt och behov under projekttiden. Mer tid förväntas för uppstart och avslut, och mindre för det löpande genomförandet. Möjlighet till förlängning: till och med 30 oktober 2025. Förväntat resultat Välfungerande M365 miljö för kommunen. Projektorganisation Avropad konsult kommer att leda arbetet och själv utföra moment vid behov tillsammans med kommunens medarbetare, och vid behov ta in konsultstöd. Avropad konsult rapporterar till styrgrupp. Hantering av personuppgifter a) Vilka typer av personuppgifter får behandlas: personuppgifter så som känsliga personuppgifter. b) Vilka kategorier av registrerade personer kommer behandlas: medarbetare i kommunen samt konsulter. c) Vilka eventuella loggningskrav gäller för personuppgiftsbehandlingen samt vilka ska ha tillgång till dem: Loggning i ärendehanteringssystem. Handlingar som ska ingå i offert: &#8211; CV &#8211; Referensförteckning &#8211; Certifikat &#8211; Tidplan Skallkrav: Har minst två års erfarenhet av att ha arbetat konsultativt Har ansvarat för framtagande av analyser/utredningar Har erfarenhet av att ha arbetat med frågor om analys med personer i ledande befattningar Har relevant akademisk utbildning omfattande åtminstone 120 poäng enligt det gamla poängsystemet eller åtminstone 180 poäng enligt det nya poängsystemet på svenska högskolor och universitet. Kravet är även uppfyllt om konsulten genomfört motsvarande studier vid ett utländskt lärosäte. Åtminstone 60 poäng enligt det famla poängsystemet eller åtminstone 90 poäng enligt det nya poängsystemet ska vara inom företags- och/eller nationalekonomi Personliga egenskaper: God förmåga till kommunikation, planering och logistik Meriterande med erfarenhet av liknande uppdrag på Täby kommun Övriga krav: Erbjudna resurser ska ha utfört minst två (2) likvärdigt uppdrag (utrullning som berör alla medarbetare) hos en kommun det två (2) senaste åren Minst en (1) kontaktperson och kontaktuppgifter för referenstagning i kommun Bifoga certifiering inom projektledning Bifoga tidplan. Konsulten bifogar ett förslag på beläggning över projektets löptid och timkostnad För att kunna ansöka för detta uppdrag måste du vara en registrerad användare i vår portal som är helt kostnadsfri. Är du ny användare och vill registrera dig eller ditt bolag i Upgrades portal klicka här: https://portal.upgraded.se/"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72665-projektledare-53/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning Vi söker nu en Projektledare på uppdrag av en kund. Rollen innebär främst att driva och koordinera olika IT-projekt som beställs och initieras av kundens olika avdelningar. Ett av de viktigaste projekten handlar om att sammanföra och utreda cirka 150 applikationer inom ett universitetssjukhus. Arbetet utförs delvis på kundens kontor, men det finns möjlighet till distansarbete. Vid resor mellan olika kontor föredras i första hand användning av kollektivtrafik. Bakgrund: Avdelningen för digitalisering arbetar för att stötta verksamheterna med att anskaffa och utveckla IT-tjänster. Inom avdelningen för Infrastruktur och cybersäkerhet drivs interna projekt och uppdrag med fokus på att strategiskt följa den globala tekniska utvecklingen. Dessutom ansvarar en specifik enhet för att följa upp och kvalitetssäkra IT-leveranser inom projekten. De tekniskt inriktade projekten drivs inom fem olika team, där de flesta projekt rör utveckling och implementering av ny teknik inom infrastrukturområdet. Ofta anlitas experter från linjeverksamhet och externa leverantörer för dessa projekt. Huvudsakliga ansvarsområden: Säkerställa att dialoger med beställare och kunder klargör krav och förväntningar inom de olika projektuppdragen. Ansvara för genomförandet av både stora och små projekt med varierande komplexitet. Arbeta med stöd av etablerade arbetsmetoder och team för att leverera projekt på ett professionellt sätt. Hantera projektbudget, planering, uppföljning och dokumentation. Koordinera flera projektuppdrag, där antalet kan variera beroende på projektens omfattning. Nästan alla projekt är IT-relaterade, men det kan förekomma projekt som även kräver koordination eller förändringsledning. Obligatoriska kvalifikationer: Minst 3 års erfarenhet som IT-projektledare, med aktuell erfarenhet inom de senaste 10 åren. Bred och djup kunskap om IT-infrastruktur nära användaren. Erfarenhet av att leda virtuella kompetensteam. Förmåga att dokumentera och presentera på svenska. Självständig och drivande i sin arbetsroll. Svenskt medborgarskap, nödvändigt för säkerhetsklassning. Körkort (B). Ett detaljerat CV som beskriver erfarenheter inom relevanta områden. Meriterande kvalifikationer: Erfarenhet från arbete inom större politiskt styrda organisationer. Erfarenhet av agila arbetsmetoder. Kunskap om större, komplexa IT-miljöer. Erfarenhet av system inom hälso- och sjukvård samt medicintekniska system. Erfarenhet av IT-säkerhet och IT-infrastrukturarbete. Erfarenhet av att arbeta i en agil miljö. Personliga egenskaper: Engagerad och drivande i sitt arbete. Lyhörd och bra på att samarbeta med andra. Trivs både med att arbeta i grupp och självständigt. Prestigelös och villig att dela med sig av sina erfarenheter och idéer. Flexibel och anpassningsbar i olika arbetsmiljöer."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72623-projektledare-utredare/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en Projektledare/Utredare. Arbetet kommer att utföras både på plats i kundens lokaler, med viss möjlighet till distansarbete. Vid behov av resor mellan kontoren kommer i första hand kommunala färdmedel att användas. Vår kunds digitaliseringsplattform har som mål att stödja verksamheterna i deras anskaffning och utveckling av IT-tjänster. Avdelningen Infrastruktur och Cybersäkerhet ansvarar för att driva interna projekt, strategiskt följa den globala tekniska utvecklingen samt säkerställa kvaliteten på IT-leveranser i dessa projekt. Enheten Förändring och Möjliggörande, som ingår i avdelningen Infrastruktur och Cybersäkerhet, ansvarar för tekniskt inriktade projekt och är organiserad i fem team som fokuserar på specifika kundgrupper. Deras uppdrag omfattar ofta utveckling och implementering av ny infrastrukturteknik, där de använder resurser från både interna avdelningar och externa leverantörer. Huvudsakliga ansvarsområden: Ansvara för att driva och samordna olika IT-projekt som initieras av kundens verksamheter. Hantera utredningen av cirka 150 applikationer inom Sahlgrenska som huvudprojekt. Föra dialog med beställare/kunder för att klargöra krav och förväntningar inom ramen för projektuppdragen. Genomföra projekt med varierande komplexitet, från mindre uppdrag till större, mer omfattande projekt. Hantera projektbudget, planering, uppföljning och dokumentation. Koordinera och leda projekt, främst inom IT, men även inom förändringsledning och annan relevant verksamhet. Antalet projekt varierar beroende på deras storlek. Projektuppdragen är nästan uteslutande IT-relaterade, men kan även inkludera koordinerande eller förändringsledda uppgifter. Obligatoriska kvalifikationer: Minst 3 års erfarenhet som IT-projektledare, ej äldre än 10 år. God och bred kunskap inom användarnära IT-infrastruktur. God och bred kunskap inom IT-infrastruktur i allmänhet. Erfarenhet av att leda virtuella kompetensteam. Svenskt medborgarskap (för säkerhetsklassning). Ett CV som tydligt beskriver erfarenheter inom relevanta områden. Du ska inneha ett B-körkort. Meriterande kvalifikationer: Erfarenhet från arbete i större politiskt styrda organisationer. Erfarenhet av agila arbetssätt. Erfarenhet av arbete inom stora, komplexa IT-miljöer. Erfarenhet av hälso- och sjukvårdssystem samt medicintekniska system. Erfarenhet av arbete inom IT-infrastruktur och IT-säkerhet. Erfarenhet av större, komplexa IT-miljöer. Ett agilt förhållningssätt. Bred IT-kompetens. Personliga egenskaper: God förmåga att dokumentera och presentera på svenska. Trivs i en drivande roll och har förmågan att arbeta självständigt. Engagerad, drivande och lyhörd, med förmåga att samarbeta effektivt, men också kunna arbeta självständigt. Prestigelös och villig att dela med sig av erfarenhet och idéer. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72620-devops-engineer-23/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a DevOps Engineer. In this role, you will be responsible for developing an automated system for building and testing software using model-based design as well as C/C++ programming. Their CI/CD infrastructure relies on OpenStack&#8217;s Zuul, along with Git and Gerrit, to automate the entire process, from software creation to delivering a binary file ready for deployment in their vehicles. You will be joining a team tasked with evolving their Software Factory, which supports the efforts of thousands of embedded software developers through its CI/CD pipeline. Main Responsibilities: Design, implement, and maintain automation processes to ensure software meets quality standards. Update and enhance existing tools and scripts to adapt to ongoing software changes. Research and integrate new tools to support developers in their workflows. Required Qualifications: Master’s degree in Computer Science, Computer Engineering, or a related field. Proficiency in C/C++ and Python. Hands-on experience with continuous integration tools. Strong understanding of software development methodologies and workflows. Additional Qualifications: Proficiency with Zuul. Embedded systems software development experience. Knowledge of Git and Gerrit. Experience with Ansible, cloud infrastructure, Docker, and Linux. Familiarity with MATLAB, Simulink, and TargetLink. Experience with issue tracking tools and Agile development processes. Desired Attributes: Strong communication skills and ability to work effectively in a team. Analytical mindset with a structured and methodical approach to problem-solving. Capability to juggle day-to-day tasks while maintaining a long-term vision. Eagerness to learn and adopt new tools and technologies."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72610-system-architect-functional-safety/",
    "roles": [
      "Architect"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a System Architect / Functional Safety. Main Responsibilities: Govern the software and electronics architecture with a focus on Functional Safety. Contribute to defining: Systems, functions, modules and interfaces. Validate technology assumptions. Evaluate alternatives. Govern shared computer resources. Guide and support development teams in making technical decisions. Take on broad responsibility. Team Involvement: Be a part of their Global Architect Team, known as CESA (Complete Electrical System Architects). CESA operates both: Strategically for future platforms and products. Operationally, supporting product development organizations in delivering software and hardware solutions into the system."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72603-product-manager-12/",
    "roles": [
      "Product Manager"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking an experienced and dynamic Product Manager to lead a transformative software development project. In this role, you will be responsible for fostering innovation, implementing cutting-edge technologies, and guiding development teams through a significant technology transition in automotive software development. Main Responsibilities: As a Product Manager, you will: Assess and migrate development tools from a Windows-based to a Linux-based environment. Streamline source code integration processes by transitioning from CMake and Conan to Bazel. Optimize build and deployment pipelines to enhance efficiency and reduce time-to-market. Investigate and implement solutions for model-based development and automated code generation. Qualifications: To be successful in this role, you should have: Extensive experience working with both Windows and Linux development environments. Strong proficiency in build automation tools such as CMake, Bazel, and Conan. In-depth knowledge of version control systems, particularly Git and Gerrit. Familiarity with model-based development tools like Matlab/Simulink. Knowledge of continuous integration and delivery (CI/CD) practices. Experience with cloud technologies (AWS or Azure preferred). Desired Attributes: Excellent communication skills, both written and verbal. A proactive approach to problem-solving and the ability to get things done, even in complex, multi-team environments. The ability to navigate ambiguity and facilitate decision-making. An analytical mindset focused on continuous improvement and optimization. Adaptability and a willingness to embrace new technologies and methodologies. A proven track record in change management and aligning stakeholders across various levels. If you&#8217;re passionate about driving technological advancements and have a unique combination of technical expertise and leadership abilities, we’d love to hear from you!"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72592-it-projektledare-ioc/",
    "roles": [
      "IT Projektledare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en erfaren projektledare med fokus på verksamhetsutveckling och en stark IT-bakgrund. Du förväntas ha djupgående förståelse för komplexa IT-miljöer samt erfarenhet av att utveckla och implementera affärsmodeller inom IT-området. Personen bör även ha arbetat i stora organisationer, gärna med politiska beslutsstrukturer, och vara kapabel att leda och engagera både interna och externa intressenter för att säkerställa en framgångsrik implementering av kundens nya service offering-modell. Obligatoriska kvalifikationer: Dokumenterad erfarenhet av affärsutveckling eller verksamhetsutveckling inom IT de senaste fem åren. Förmåga att uttrycka sig flytande i både svenska och engelska, i både skrift och tal. Erfarenhet av att leda utvecklingsprojekt med ett flertal intressenter. Beprövad kompetens i att utveckla och implementera affärsmodeller eller servicekoncept inom IT. Erfarenhet av att arbeta i större organisationer, helst med politisk styrning. Förmåga att arbeta självständigt och vara initiativrik. Meriterande kvalifikationer: Tidigare erfarenhet av att utveckla affärsmodeller eller servicekoncept inom områden som IT-infrastruktur och cybersäkerhet anses vara en stor fördel. Du bör ha erfarenhet av att leda projekt och förändringsarbete i miljöer där politiska beslutsprocesser påverkar organisationens struktur och riktning. Det är meriterande om konsulten har arbetat med agila metoder för att leda utvecklings- eller förändringsprojekt, vilket möjliggör en anpassningsbar och flexibel arbetsmetodik. Referenser från tidigare kunder, där liknande uppdrag har genomförts med framgång, stärker konsultens trovärdighet och förmåga att leverera. Personliga egenskaper: Förmåga att kommunicera effektivt och tydligt, både inom teamet och med externa aktörer. Drivkraft att genomföra projekt från start till mål. Bekväm med att utmana och ifrågasätta existerande strukturer för att driva förbättring. Lösningsorienterad med en stark vilja att nå uppsatta mål. Anpassningsbar och öppen för förändring i dynamiska miljöer."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72582-embedded-software-engineers/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client  in the automotive industry is currently seeking experienced Senior and Mid-level Embedded Software Engineers with strong skills in C, C++, Python, and Java, as well as a solid understanding of system architecture. Main Responsibilities: As part of an agile team, your key responsibilities will include: Optimizing performance and CPU usage Identifying and resolving memory leaks Visualizing boot times for software processes Qualifications: Proficient in C, C++, or Python for developing complex embedded software products Experience with Embedded OS, Linux, or QNX Familiarity with test automation tools (e.g., Pytest) Previous experience working in a Continuous Integration (CI) environment Expertise in embedded software optimization and resource utilization Familiarity with automotive communication protocols such as FlexRay and LIN (preferred) University degree in Computer Science, Electrical Engineering, Electronics, or a similar field Fluency in both spoken and written English Additional Qualifications: Knowledge of Android testing frameworks Experience with Android Automotive Platform A valid driver’s license (B-level) is ideal but not mandatory Desired Attributes: Self-driven with a proactive approach to problem-solving Capable of leading investigations and making informed conclusions"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72570-test-leader-with-focus-on-hw/",
    "roles": [
      "Test Lead/Manager"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is seeking a Test Leader with a focus on hardware (HW) to enhance their test leadership team within the mechatronics HW follow-up team and test object analysis. You will be part of the Integration, Verification, and Orchestration team, which falls under the Complete Software and Integration department. This team is responsible for coordinating and planning tests related to integration and release of the complete software and electronic systems across all platforms within the organization. Additionally, the team orchestrates all releases to customers, starting from integration through to deployment. Main Responsibilities: As a member of the HW team, your primary tasks will include: Leading and managing the daily follow-up of mechatronic hardware changes. Analyzing the impact of changes on CSIR test objects. Summarizing the hardware needs for CSIR as a whole. Collaborating closely with testers, test architects, and developers both within the CSIR team and the broader R&amp;D department. Maintaining documentation and progress tracking in Excel, while also managing multiple baselines for mechatronics planning. Qualifications: To succeed in this role, you should have: Experience in software (SW) development and/or software administration. Familiarity with software processes (beneficial but not required). Excellent communication and collaboration skills. Fluency in English, both spoken and written. Desired Attributes: Courageous, with a high level of energy and enthusiasm. High standards of integrity and professionalism. Ability to maintain a holistic view of the work and its impact. Strong analytical and structured thinking."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72560-c-software-developer-android-automotive/",
    "roles": [
      "Developer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is looking for an experienced C++ Software Developer with expertise in Android Automotive. Are you excited about working on next-generation infotainment systems, developed in close collaboration with Google, based on Android Automotive? If so, they have an exciting opportunity for you. They are searching for a motivated, inquisitive, and detail-oriented team player to join their team, focusing on Navigation and Positioning. Main Responsibilities: Work as part of a small, cross-functional team that emphasizes quality and continuous improvement. Collaborate with team members to develop and improve the car’s navigation features, ensuring an excellent user experience. Engage in full-stack development using Java, Kotlin, C++, and Android development tools. Utilize the latest tools and technologies, working closely with partners and other teams to deliver cutting-edge software. Write automated test cases that run in a Continuous Integration (CI) environment to verify the developed features. Participate in real-world testing and troubleshooting in actual vehicles, providing hands-on insight into product performance. Required Qualifications: A Master’s or Bachelor’s degree in Electronics, Software Engineering, or a related field. At least 5 years of relevant experience in software development using languages such as C++, Python, Java, etc. Proven experience in Android platform development and Continuous Integration. Familiarity with Agile methodologies. Strong proficiency in English, both written and verbal. A valid driver’s license (B-level). Additional Qualifications: Android Automotive platform development. Automotive Infotainment systems. Working in the Navigation or Positioning domain. Desired Attributes: A naturally curious problem solver who thrives in a team-oriented environment. Ability to collaborate effectively with others to achieve shared goals. Flexibility in managing multiple tasks simultaneously. A self-driven individual who is quality-focused and excited by technical challenges."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72540-projektledare-52/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning Vi söker nu en projektledare för att stötta vår kund under en period med ökad arbetsbelastning, till följd av både införande och avveckling av IT-system. Eftersom ordinarie resurser för närvarande är engagerade i nya projekt, behövs en konsult för att avlasta inom IT-tjänsterna kopplade till Mellanarkiv. Den här rollen innebär att arbeta tillsammans med Mellanarkiv-teamet, som i dagsläget består av en teamledare, systemförvaltare, applikationsspecialister och flera systemutvecklare. Mellanarkiv-teamet ansvarar för att förvalta runt 50 applikationer, fördelade mellan tre olika mellanarkiv samt stödsystem och överföringstjänster. Applikationerna utgörs både av inköpta system och egenutvecklade lösningar. Som applikationsspecialist i teamet för Mellanarkiv arbetar man tätt ihop med andra experter, både internt och hos leverantörer. Huvudsakliga ansvarsområden: Teknisk support Hantering av ärenden (incidenter och beställningar) i Service Now Användarstöd och detaljkonfigurering av förvaltningssystem Felsökning i loggar, databaser och andra systemfiler, dvs traditionell systemanalys Livscykelhantering Utföra livscykeluppgifter som uppgraderingar av applikationer och servrar inom E-arkivet Beställning och installation av certifikat Administrera och uppdatera kunskapsartiklar Testadministration för applikationer och operativsystem Paketering och licenshantering av programvara Hantering av skannerhårdvara Dokumentering Skapa teknisk dokumentation som lathundar, kunskapsartiklar och rapporter inom relevanta förvaltningsområden Obligatoriska kvalifikationer: Kandidatexamen i systemvetenskap, datavetenskap, systemutveckling eller motsvarande Minst tre års erfarenhet som systemanalytiker eller applikationsspecialist Minst tre års erfarenhet av teknisk support, felsökning, tester och ärendehantering i stora system Minst tre års erfarenhet av att producera teknisk dokumentation på svenska och engelska God social förmåga och skicklighet i att kommunicera komplex information till olika grupper inom organisationen Minst tre års erfarenhet från större företag eller organisationer Analytisk förmåga att identifiera behov och förbättringar inom system och processer Praktisk erfarenhet av systemlivscykelhantering och support för mellanarkiv för skannad journal Teknisk kompetensprofil: Databaser: Erfarenhet av SQL Server Management Studio (Kunskapsnivå: 2) Databasprogrammering: Kunskaper i SQL-Script (Kunskapsnivå: 2) Klient/Server: Kunskap om SCOM, IIS och Remote Endpoint Manager (Kunskapsnivå: 2) Meriterande kvalifikationer: Erfarenhet av agila arbetsmetoder som Scrum eller Kanban Kunskap om ITIL-processer Erfarenhet av systemförvaltning av IT-system inom mellanarkivering Personliga egenskaper: Teamorienterad och samarbetsvillig, med en lyhörd inställning Prestigelös och villig att dela med sig av kunskap Kvalitetsmedveten och prioriterar noggrannhet över kvantitet Kommunikativ och har lätt att uttrycka sig i både tal och skrift på svenska Flexibel, med förmåga att hantera olika situationer och flera parallella prioriteringar Självgående och proaktiv i att se behov inom förvaltningen samt planera och strukturera sitt arbete &nbsp; Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72525-applikationsspecialist-5/",
    "roles": [
      "Applikationsspecialist"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en Applikationsspecialist. Du kommer att ingå i teamet Mellanarkiv, där man samarbetar tvärfunktionellt med andra specialister, både internt hos vår kund och hos leverantörer. Enheten Information och Arkivering (I&amp;A) är en del av deras digitaliseringsplattform och ansvarar för att förvalta och utveckla kundens mellanarkiv. På grund av ökande arbetsbelastning, främst vid införande och utfasning av IT-system, behövs nu en konsult som kan avlasta det befintliga teamet. Ordinarie resurser fasas in i nya projekt, vilket skapar behov av avlastning inom de IT-tjänster som ingår i Mellanarkiv. Konsulten kommer att arbeta tillsammans med teamledare, systemförvaltare, applikationsspecialister och systemutvecklare i Mellanarkiv-teamet. Teamet förvaltar runt 50 applikationer fördelade mellan tre olika mellanarkiv, stödprogram och överföringstjänster. Applikationerna består av både inköpta leverantörssystem och egenutvecklade applikationer. Du kommer även att driva mindre uppdrag, i samarbete med leverantör, med syfte att till exempel uppgradera programvara. Huvudsakliga ansvarsområden: Teknisk Support Ärendehantering (incidenter och beställningar) i ServiceNow. Användarstöd och detaljkonfigurering av förvaltningsmjukvaror. Felsökning i eventloggar, databaser och loggfiler, dvs. traditionell systemanalys. Livscykelhantering Administrera generella livscykelaktiviteter, till exempel uppgradering av applikationer och servrar i E-arkivsviten. Beställning och applicering av certifikat. Uppdatering och administration av kunskapsartiklar. Testadministration (applikationer/OS). Paketering av mjukvaror. Licenshantering. Administration av skannerhårdvara. Dokumentation Producera teknisk dokumentation inom olika förvaltningsområden, inklusive lathundar, kunskapsartiklar och rapporter. Obligatoriska kvalifikationer: Minst kandidatexamen inom systemvetenskap, datavetenskap, systemutveckling eller motsvarande. Minst 3 års erfarenhet som systemanalytiker/applikationsspecialist. Minst 3 års erfarenhet av teknisk support, felsökning, testerfarenhet och ärendehantering i större system. Minst 3 års erfarenhet av att producera teknisk dokumentation på svenska och engelska. Erfarenhet av att arbeta i större organisationer/företag i minst 3 år. Självständig, med förmåga att planera och strukturera sitt eget arbete. Analytisk, med förmåga att identifiera behov och förbättringar i system och processer. Praktisk erfarenhet av systemlivcykelhantering av mellanarkiv för skannad journal. Praktisk erfarenhet av supporthantering av ärenden relaterade till mellanarkiv för skannad journal. Kompetensbeskrivning: Databaser: SQL Server Management Studio – Nivå 2 Databasprogrammering: SQL-Script – Nivå 2 Klient/Server: SCOM, IIS, Remote Endpoint Manager – Nivå 2 Meriterande kvalifikationer: Erfarenhet av agila arbetssätt, såsom Scrum eller Kanban. Kunskap om ITIL processer. Erfarenhet av systemförvaltning av IT-system inom mellanarkivering. Personliga egenskaper: Teamfokuserad: Samarbetsvillig och lyhörd – arbetar för teamets bästa. Prestigelös: Delar gärna med sig av kunskap och information. Kvalitetsfokuserad: Sätter kvalitet före kvantitet. Kommunikativ: Har en social personlighet och uttrycker sig väl i både text och tal på svenska. Flexibel: Klarar av att hantera många olika situationer, exempelvis akuta incidenter och kundkontakt. Självgående: Ser behov inom förvaltningen och kan planera och strukturera sitt eget arbete."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72518-6st-testledare/",
    "roles": [
      "Testledare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu sex stycken Testledare som kommer att ingå i kundens enhet för krav och test. Obligatoriska kvalifikationer: ISTQB-certifiering Minst 3 års dokumenterad erfarenhet som testledare Dokumenterad erfarenhet av projekt inom offentligt styrd hälso- och sjukvård Mycket god förmåga att dokumentera och presentera på svenska Goda kunskaper i engelska, både muntligt och skriftligt Praktisk erfarenhet av ledande testverktyg, specifikt ReQtest Meriterande kvalifikationer: Praktisk erfarenhet av testverktyget Azure DevOps Erfarenhet av att arbeta i stora och komplexa projektmiljöer Mycket goda kunskaper om agila arbetssätt Erfarenhet av medicintekniska produkter och dess regelverk Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72499-systemutvecklare-servicenow-5/",
    "roles": [
      "Utvecklare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en Systemutvecklare ServiceNow som ska stärka kundens agila utvecklingsteam. Rollen är en del av kundens pågående 5G-projekt, och innebär att stödja deras utvecklingsbehov inom detta område. Plexus är kundens centrala IT-plattform, som stöder deras uppdrag och leveransprocesser. Plattformen är ett kärnsystem för verksamheten, och kunden är ledande i sin användning av dess moduler. Utveckling av nya moduler och vidareutveckling av plattformen sker i snabb takt. Huvudsakliga ansvarsområden: Systemutveckling och konfiguration av ServiceNow, kundens centrala digitaliseringsplattform Bidra till utvecklingen av effektiva lösningar i ServiceNow-plattformen Arbeta inom ett utvecklingsteam som ansvarar för att förvalta och utveckla verktyg anpassade efter verksamhetens behov Delta i en agil systemutvecklingsprocess med nära samarbete med kravställare Vidareutveckling av funktionalitet för ServiceNow, inklusive: Utveckling av användarvänliga serviceportaler och servicekataloger Utveckling av workflows och integrerade flöden Skapande av externa integrationer med stöd av integrationsplattformen Användning av moduler som ITBM, ITOM, ITAM och ITSM Obligatoriska kvalifikationer: Erfarenhet av att arbeta med och utveckla i HTML, CSS och JavaScript Minst 3 års erfarenhet som systemutvecklare inom ServiceNow-plattformen Goda kunskaper i systemutveckling Erfarenhet av att arbeta inom stordrift av IT-miljöer Utmärkt förmåga att uttrycka sig på svenska, både i tal och skrift Meriterande kvalifikationer: Certifieringar inom ServiceNow Erfarenhet av arbete inom politiskt styrda organisationer Minst 3 års erfarenhet av att arbeta i agila team Goda kunskaper inom infrastruktur Erfarenhet av att hantera större och komplexa systemimplementeringar Personliga egenskaper: God kommunikationsförmåga och förmåga att omvandla behov till lösningar Strukturerad och ordningsam God samarbetsförmåga och självgående Positiv och lösningsorienterad i sitt bemötande"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72465-senior-projektadministrator-sdv-utrullning-region-skane-avrop-958/",
    "roles": [
      "Projektadministratör"
    ],
    "places": [
      "Lund"
    ],
    "description": [
      "Uppdragsbeskrivning Region Skåne implementerar med hjälp av Oracle Health ett digitalt vårdsystem för att ersätta ett antal applikationer som stödjer regionens vårdaktiviteter. Detta är det mest omfattande förnyelsearbetet i Region Skånes historia. För mer information se https://vardgivare.skane.se/tema/skanes-digitala-vardsystem-sdv/ SDV söker en projektadministratör för en koordinerande roll inom SDV utbildning. Rollen innebär att administrera bokningsbara utbildningsplatser som kan nyttjas av verksamheten för att genomföra sin systemutbildning av det nya journalsystemet. I rollen kommer man följa upp bokningar, säkerställa att rätt uppgifter finns, vara behjälplig vid mer komplexa bokningar och övervaka en funktionsbrevlåda. Rollen kommer även att ansvara för uppföljningen av den utbildningstakt som varje förvaltning håller av sina medarbetare. Rollen innebär även att man kommer ha en koordinerande roll för lokalerna där våra utbildningsplatser kommer finnas. Det innebär att följa upp med respektive fastighetsförvaltare och säkerställa att rätt förutsättningar finns i lokalerna. Detta kan innebära samarbete med väldigt många olika organisationer och leverantörer och rollens uppdrag blir att koordinera detta arbete för att hålla ihop helheten. Du kommer att ingå i ett härligt team där behovet av samarbete är lika stort som att kunna arbeta självständigt. För rollen krävs det att du har: Goda kunskaper i excel Erfarenhet av att arbeta i stora komplexa projekt och kunna koordinera mellan olika intressenter Kommunikativ och serviceinriktad Goda kunskaper i svenska i såväl tal som i skrift För rollen krävs det också att du är strukturerad, arbetar proaktivt och är lösningsorienterad. Du är duktig på att skapa ordning och reda där allt inte finns på plats. Du kommer att samarbeta med både interna och externa intressenter och det är därför viktigt att du är lyhörd och har lätt att knyta kontakter och samarbeta med olika människor. Du måste trivas med att arbeta i en miljö med högt tempo där det ständigt sker förändringar. Tidigare erfarenhet av schemaläggning, koordinering och erfarenhet av Region Skånes verksamhet är meriterande. &nbsp; Tillhör kategori: Projektadministratör"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72427-java-utvecklare-4/",
    "roles": [
      "Javautvecklare",
      "Utvecklare"
    ],
    "places": [
      "Uppsala"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en Java utvecklare. Vår kund har precis börjat arbeta i ett nytt system där de behöver en tillfällig resurs (tre månader med möjlighet till förlängning) för att hantera arbetstoppar. Det är ett stort system utvecklat i Java kring ett processorienterat ramverk. Därför söker vi dig som är utvecklare och är bra på att sätta dig in i befintliga kodbaser och har erfarenhet av många olika system. Vi tror det är en fördel om du har erfarenhet av React men det väger förstås inte lika tungt som Java. Det är viktigt att du är självgående och snabblärd. Skallkrav: Du ska ha kompetens motsvarande nivå 4 av Java Du ska ha erfarenhet av att arbeta i Azure Devops Bör krav: Du bör ha tidigare erfarenheter av Java utveckling i olika miljöer och versioner Du bör ha erfarenhet av utveckling i befintliga legacysystem Du bör ha erfarenheter av integrationsarbete i Java miljö Du bör ha kompetens inom React &nbsp; Du kommer att arbeta på plats hos vår kund i Uppsala cirka 75% av vecka, resterande 25% finns det möjlighet till distansarbete."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72415-fullstackutvecklare-7/",
    "roles": [
      "Fullstack-utvecklare"
    ],
    "places": [
      "Kalmar",
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en fullstackutvecklare. Du kommer att förstärka ett av utvecklingsteamen hos vår kund som fullstackutvecklare och förvalta och utveckla deras tjänster. Du ska kunna röra dig mellan backend och frontend tekniker och navigerar testdriven utveckling och testautomation. Ta fram och utveckla lösningsförslag Dokumentera lösningar, gränssnitt mm Testa funktioner och tjänster Implementera och exekvera automatiska tester Skallkrav: Spetskompetens Du ska ha minst (5) års erfarenhet av arbete som senior utvecklare inom minst (2) av följande tekniker: Minst (3) år av arbetslivserfarenheten ska vara förvärvad någon gång under den senaste femårsperioden. Java Jakarta EE Jax-RS JPA/Hibernate Sonarqube PostgreSQL Kubernetes/Openshift Vue.js Breddkompetens Du ska ha minst (1) års erfarenhet av arbete som utvecklare inom minst (2) av följande tekniker som inte uppgetts som spetskompetens: Arbetslivserfarenheten ska vara förvärvad någon gång under den senaste femårsperioden. Java Jakarta EE Jax-RS JPA/Hibernate Sonarqube PostgreSQL Kubernetes/Openshift Vue.js Skallkrav fortsättning Du ska ha minst (3) års erfarenhet av att arbeta med testdriven utveckling och testautomatisering som en naturlig del av sitt arbete som systemutvecklare. Minst (2) år av arbetslivserfarenheten ska vara förvärvad någon gång under den senaste femårsperioden Du bör ha minst (1) års erfarenhet av arbete med REST-baserade tjänster. Arbetslivserfarenheten ska vara förvärvad någon gång under den senaste treårsperioden. Du ska ha minst (1) års erfarenhet av arbete i team som arbetar enligt agila arbetssätt. Du ska ha relevant universitets- eller högskoleutbildning eller arbetslivserfarenhet som bedöms likvärdig. Börkrav Du bör ha erfarenhet av containerbaserade tekniker som Docker, Kubernetes och OpenShift. Du bör ha erfarenhet av utveckling i Linux-miljö. Du bör ha arbetat med versionshantering exempelvis GIT. Du bör ha arbetat med enhetstestning och/eller TDD. Du bör ha erfarenhet av utvecklingsverktyget IntelliJ Du bör ha erfarenhet av att ha arbetat med testverktyget ReadyAPI Du bör ha erfarenhet av att ha arbetat med testverktyget Cypress Du bör ha erfarenhet av att ha arbetat med kontinuerlig testning av pipelines/CI/CD &nbsp; Du kommer att arbeta i vår kunds lokaler i Stockholm eller Kalmar cirka 2 dagar i veckan. Du måste även kunna närvara i Kalmar på PI-planning 11-13 november."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72391-sw-and-electrical-hw-air-quality-engineer/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a SW and Electrical HW Air Quality Engineer. Main Responsibilities: Work closely with team members, suppliers, the testing department, and other stakeholders. Drive tasks effectively, ensuring the best possible solutions without deviations regarding quality assurance. Manage component projects, ensuring suppliers meet the required quality expectations for electrical hardware (HW) and software (SW) demands. Support and develop SW and electrical HW competence within the team. Maintain close contact with the EMC department, EDS, and Basetech to ensure they stay up-to-date with demands and deliveries. Required Qualifications: University education in electronics or a similar field. Additional Qualifications: Previous experience in the automotive industry (beneficial)."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72385-engineer-7/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking an Engineer. Main Responsibilities: Deliver major or complex development tasks in a cross-functional team environment. Balance and integrate design aspects in collaboration with internal and external stakeholders. Act as a tutor or mentor in the area of expertise. Drive improvements of relevant design tools, methods, and processes. Work with Continuous Integration and test object builds (bench, rigs, prototype car, etc.). Required Qualifications: Proven technical skills and experience in the design of mechanical installation. Knowledge of materials included in the electrical distribution system and vehicle functions supported by specific harnesses. Experience with wire harness manufacturing processes and complexity. Proficiency in the following tools: Catia V5 including Electrical workbench (3DPMI is meritorious) Capital Harness Design 2D tool Teamcenter Fluent in English. Additional Qualifications: Comprehension of Swedish (meritorious). Driving license B. Desired Attributes: Effective communication and collaboration skills. Ability to work with Continuous Improvements in the team. Skilled in Continuous Integration, test object builds (bench, rigs, prototype car, etc.)."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72379-sw-developer-and-tester/",
    "roles": [
      "Developer",
      "Tester"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Software Developer and Tester within Voice User Interfaces &amp; Audio. If you want to be part of a team working on the next generation infotainment system based on Android Automotive, in close collaboration with Google, this opportunity is for you. You will play a key role in enabling the company’s vision of &#8221;Freedom to move in a Personal, Sustainable, and Safe way.&#8221; Main Responsibilities: In this role, you will work as part of a small cross-functional team, focused on delivering high-quality work and driving continuous improvements. Your responsibilities will include: Testing the Google Assistant within the infotainment system. Enhancing and optimizing the automated test framework for voice interactions. Testing the audio chain and ensuring readiness for Continuous Integration (CI). Conducting tests and troubleshooting in real vehicles, offering valuable insights into the product&#8217;s real-world performance. Required Qualifications: A Master’s (M.Sc.) or Bachelor’s (B.Sc.) degree in Electronics, Software Engineering, or a related field. A minimum of 3 years of experience in software development using languages such as Python, C++, or Java. Experience in Android platform development. Familiarity with Continuous Integration (CI) processes and Agile methodologies. Proficiency in English, both written and spoken. A valid driver’s license (B-level). Additional Qualifications: Experience developing for Android Automotive. Prior experience with Automotive Infotainment systems. Familiarity with Audio Input or Voice Assistant technology. Desired Attributes: Motivated and curious, with a strong focus on quality. A team player with the ability to work effectively in collaboration with others. Strong problem-solving skills and the ability to handle multiple tasks simultaneously. Driven and quality-conscious, with a passion for tackling technical challenges."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72361-test-engineer-test-automation/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Test Engineer &#8211; Test &amp; Automation. The company is redefining the automotive experience by simplifying people’s lives through innovation. They offer a unique opportunity to make a significant impact in a rapidly evolving industry, with considerable growth and personal development prospects. Research &amp; Development Role As part of the Research &amp; Development team, you will play a pivotal role in creating the next generation of luxury vehicles. Working alongside a global team of engineers, you will contribute to the development of cutting-edge, human-centric automotive technology designed to enhance the driving experience and make everyday life easier. If you have a passion for car design, connected technology, and creating exceptional user experiences, this role offers the perfect environment for you to excel. Electric Propulsion Software Department The Electric Propulsion Software division is a key player in the electric vehicle software development field. They are leading the shift towards electric mobility, contributing to the company&#8217;s vision of providing customers with a sustainable, personal, and safe driving experience. Within the Battery Control &amp; ECU Platform department, they are focused on developing in-house software for vehicle propulsion systems. This includes: Electric Drive inverters Traction battery control units Onboard chargers Main Responsibilities: In this role, your main duties will include: Developing and maintaining tests to verify ECU functionality at the ECU level. Working within a Python-based, automated test environment. Investigating, reporting, and managing software-related issues. Further developing and maintaining the automated test environment (which is developed in-house). Performing technical documentation and conducting manual tests as needed. Required Qualifications: You are expected to have the following qualifications: A degree in Computer Science, Electronics, or a related field, or equivalent professional experience. Experience in creating test cases from system and software requirements. Professional expertise in system testing and test automation. Proven experience in developing and executing automated tests. Python scripting experience. Familiarity with automotive interfaces such as CAN/CANFD and related protocols is highly recommended. Additional Qualifications: The following skills are considered advantageous: Knowledge of Autosar BSW. Experience working with Linux systems and shell scripting. Proficiency in version control systems such as GIT. Experience with ISO26262 standards. Familiarity with Unified Diagnostic Systems (UDS) and BSW. Experience with dSpace HIL systems. Work experience within the automotive industry. Desired Attributes: Strong commitment to delivering results. Team-oriented with excellent coordination, communication, and documentation skills. Proactive and persistent in achieving goals and driving cross-functional improvements. A structured approach to work and a passion for tackling technical challenges."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72360-konsultstod-i-utvecklingsarbetet-kopplat-till-digitalisering/",
    "roles": [
      "Verksamhetsutvecklare"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning Inom Sektorn för välfärd och omsorg har ett omfattande utvecklingsarbete inom digital välfärdsteknik/digitalisering pågått under de senaste åren. Arbetet bedrivs dels som enskilda initiativ, dels utifrån handlingsplaner. Sektorns ledningsgrupp är styrgrupp för det lokala digitaliseringsrådet som samordnas av två tjänstepersoner med kunskap om såväl verksamheter inom social- och arbetsmarknadsnämndens som äldrenämndens ansvarsområde. Distansarbete: Hybrid, Workshops sker på plats, övrigt arbete bestäms i samråd med Sektorn. Ansvariga nämnder är social- och arbetsmarknadsnämnden samt äldrenämnden. Social- och arbetsmarknadsnämnden ansvarar för att utreda behov och ge stöd till barn, ungdomar och deras familjer. Verksamheten ger också stöd till vuxna som har behov av det. Det kan handla om ekonomiska svårigheter, beroende, våld i nära relation eller någon form av funktionsnedsättning. Vidare ingår vuxenutbildning, arbetsmarknad och integration i nämndens ansvar. Äldrenämnden ansvarar för äldreomsorg vilket inkluderar särskilt boende, hemtjänst, trygghetslarm, dagvård, korttidsboende med mera för personer över 66 år. Mer information om Sektorns ansvarsområde finns på Sundbybergs hemsida: https://www.sundbyberg.se/kommun-och-politik/sundbybergs-stads-organisation/sektorer-i- forvaltningen/valfard-och-omsorg Omfattning Behov finns att förtydliga den gemensamma riktningen, skapa överblick och skapa förutsättning för att prioritera samt att utvärdera för att ytterligare förbättra befintliga arbetssätt och roller för att på ett effektivt sätt ta oss an de utmaningar som vi står inför och där verksamhetsutveckling med digitala verktyg är en del av helhetslösningen. Uppskattningsvis omfattar uppdraget cirka 160-200 timmar. Staden garanterar inga volymer. Team Sektorn är öppen för en teamlösning där en av konsulterna i teamet har kompetensnivå 4. Krav på leverans Sektorns ledningsgrupp behöver ett stöd i det fortsatta arbetet, där målet är: Genom kartläggning av nuläge avseende organisering och arbetssätt för digitaliseringsarbetet komma med rekommendationer kring det framtida arbetet genom en tydlig strategi för sektorns digitaliseringsarbete. Konsulten ska leverera en handlingsplan och med rekommendationer för riktning framåt. Tänkt upplägg involverar: • Intervjuer med berörda, såväl chefer som utvalda tjänstepersoner inom sektorn • En halvdag tillsammans med samtliga chefer inom sektorn för att ge inspiration och utbyte kring digitalisering • Workshops (tänkt antal 3 förmiddagar) med sektorns utvidgade (ca 10 personer) ledningsgrupp för att identifiera behov, fånga nuläge och önskemål samt förankra strategi och rekommendationer • Vidare kan medverkan vid särskilda forum inom sektorn komma att bli aktuellt Upplägg i detalj bestäms i samråd med Sektorn. Förväntat resultat Kan det vara att vi förväntar oss en digitaliseringsstrategi för sektorn för välfärd och omsorg vilken tar hänsyn till de olika verksamheternas behov och digitala mognad. Strategin ska visa riktning mot 2030. Dessutom ska en handlingsplan för de tre närmsta åren arbetas fram för beslut inom sektorns ledningsgrupp. Projektorganisation Konsulten rapporterar direkt till Stadens Välfärd och omsorgsdirektör. Krav på dokumentation Arbetet ska resultera i en strategi för digitaliseringsarbetet inom sektorn för välfärd och omsorg samt en handlingsplan. Handlingar som ska ingå i offert: &#8211; CV &#8211; Referensförteckning &#8211; Genomförandeplan &#8211; Tidplan &#8211; Pris Skallkrav Erfarenhet av liknande uppdrag inom kommunal sektor, med fokus på digitalisering och verksamhetsutveckling Erfarenhet av att arbeta med chefsgrupper kopplat till digitalisering. Konsulten/teamet kommer främst ha kontakt med personer i ledande befattningar Erfarenhet av att arbeta med liknande projekt inom [&hellip;]"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72351-systemutvecklare-servicenow-4/",
    "roles": [
      "Utvecklare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en systemutvecklare med expertis inom ServiceNow (SN). I denna roll kommer du att ansvara för systemutveckling och konfiguration av kundens centrala plattform för digitalisering (KSD). Denna plattform är avgörande för både kundleveranser och internt arbete. Kunden arbetar i ett högt tempo med kontinuerlig utveckling av plattformen och implementering av nya moduler. För att möta behoven inom deras 5G-projekt behöver de nu förstärka sitt agila utvecklingsteam. Som systemutvecklare bidrar du till att utveckla effektiva lösningar med SN-plattformen som grund. Du blir en viktig del av ett team som både förvaltar och utvecklar plattformen för att möta verksamhetens krav. Huvudsakliga ansvarsområden: I rollen kommer du att: Arbeta i ett agilt utvecklingsteam där samarbete med kravställare fungerar väl. Vidareutveckla funktionalitet i ServiceNow. Utveckla användarvänliga serviceportaler och servicekataloger. Skapa arbetsflöden (workflows) och integrerade flöden. Utveckla externa integrationer med hjälp av kundens integrationsplattform. Plattformen inkluderar moduler såsom: ITBM (IT Business Management) ITOM (IT Operations Management) ITAM (IT Asset Management) ITSM (IT Service Management) Kundens IT-tjänsteplattform, kallad Plexus, stödjer hela KSD uppdrag och leveransprocess. Den fungerar som ett kärnsystem för verksamheten. Obligatoriska kvalifikationer: För att lyckas i rollen behöver du ha: Erfarenhet av att arbeta med eller utveckla i HTML, CSS och JavaScript. Minst 3 års erfarenhet som systemutvecklare inom ServiceNow. Mycket goda kunskaper inom systemutveckling. Erfarenhet av att arbeta i storskaliga IT-miljöer. God förmåga att uttrycka dig väl i svenska, både i tal och skrift. Meriterande kvalifikationer: Det är även meriterande om du har: Relevanta certifieringar inom ServiceNow. Erfarenhet av att arbeta i politiskt styrda organisationer. Minst 3 års erfarenhet av att arbeta i agila team. Önskvärda tilläggskvalifikationer: Det är ett extra plus om du har: Hög kunskap om IT-infrastruktur. Erfarenhet av att genomföra större, komplexa systeminföranden. Personliga egenskaper: Vi söker dig som: Har god kommunikativ förmåga och kan omvandla krav till lösningar inom ramen för din roll. Är strukturerad och ordningsam. Är självgående och har god samarbetsförmåga. Bemöter kollegor och kunder på ett professionellt och trevligt sätt."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72341-applikationsspecialist-enhet-information-och-arkivering/",
    "roles": [
      "Applikationsspecialist"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker en Applikationsspecialist för kunds räkning, som kommer att arbeta med Enheten för Information och Arkivering. Rollen kräver att du kan sätta dig in i projektets krav på applikationerna samt förstå hur de installeras och konfigureras. Du kommer att fungera som ett bollplank för alla intressenter som är involverade i konfigureringen och användningen av systemet. Det är också viktigt att du kan sätta dig in i verksamhetens processer och arbetsflöden. Rollen kräver inte nödvändigtvis lång erfarenhet, men du bör vara snabb i tanken, handlingskraftig och ha förmågan att analysera och förstå applikationens funktioner på djupet. Du kommer att stödja projektet och därefter delta i överlämningen till förvaltningen. Obligatoriska kvalifikationer: Kandidatexamen eller motsvarande inom Systemvetenskap, Datavetenskap, Systemutveckling eller liknande. Förmåga att snabbt lära dig ny teknik. Förståelse för processer och arbetsflöden. Erfarenhet av att stötta arkitekter, projektledare och andra intressenter med insikter om hur applikationen fungerar. Goda kunskaper om E-arkiv 3.0-funktionalitet och tillhörande utmaningar. Förmåga att förstå och hantera förvaltningens behov, med ansvar för övergången från projekt till förvaltning. Flytande engelska, då leverantören kan vara internationell och dokumentationen oftast är på engelska. Kunskap om dokumentation och dokumenthantering genom hela processen. Erfarenhet av metadatahantering. Kunskap om integrationsteknik. Förståelse för webbservrar och databaser. Meriterande kvalifikationer: Erfarenhet av agila arbetsmetoder såsom Scrum eller Kanban. Kännedom om ITIL-processer. Erfarenhet av systemförvaltning av IT-system inom mellanarkivering."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72328-senior-uppdragsledare-delprojektledare-utbildningsmaterial-region-skane-avrop-957/",
    "roles": [
      "Uppdragsledare"
    ],
    "places": [
      "Lund"
    ],
    "description": [
      "Uppdragsbeskrivning Region Skåne implementerar med hjälp av Oracle Health ett digitalt vårdsystem för att ersätta ett antal applikationer som stödjer regionens vårdaktiviteter. Detta är det mest omfattande förnyelsearbetet i Region Skånes historia. För mer information se https://vardgivare.skane.se/tema/skanes-digitala-vardsystem-sdv/ SDV söker nu en uppdragsledare/ utbildningskoordinator där fokus kommer att vara att koordinera och sätta samman utbildningspaket och utbildningsmaterial för de som arbetar i SDV-programmets supportorganisationer. Rollen innebär att ansvara för att ta fram statistik och analysera SDVs utbildningsbehov för supportorganisationer. Prioritera och skapa översikt när utbildning ska genomföras. Presentera utbildningspaket, skapa utbildningsmaterial och återkoppla med supportorganisationernas projektledare och ansvariga. Driva samarbete och lösningar med interna och externa intressenter. Rollen innebär även ett nära samarbete med samtliga delprojekt inom programmet men även kontakter och samarbete med olika intressenter utanför programmet. Du kommer att tillhöra delprojektet Utbildning och rapportera till dess projektledare. Önskad kompetens: Goda kunskaper i excel Erfarenhet av att arbeta i stora projekt och kunna koordinera mellan olika intressenter Kommunikativ och serviceinriktad Goda kunskaper i svenska i såväl tal som i skrift För rollen krävs det också att du är strukturerad och arbetar proaktivt, är lösningsorienterad och ser möjligheter i komplexa situationer. Rollen kräver tidigare erfarenhet från att skapa och sätta ihop utbildningar samt att ha jobbat med att planera och koordinera utbildningar och att du har kunskap i hur vi bäst säkerställer förutsättningar för lärande. Har du dessutom erfarenhet från att ha arbetat med digitala utbildningar är det ett plus. Du kommer att samarbeta med både interna och externa intressenter och det är därför viktigt att du är lyhörd och har lätt att knyta kontakter och samarbeta med olika människor. Du måste trivas med att arbeta i en miljö med högt tempo där det ständigt sker förändringar. Det är viktigt att du tycker om att samarbeta med andra människor och är lyhörd för andras behov. &nbsp; Tillhör kategori: Uppdragsledare"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72318-senior-natverkskonsult-ccie/",
    "roles": [
      "Nätverksexpert"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en Senior nätverkskonsult med CCIE-certifiering. Du kommer att stötta med validering och verifiering av den nya designen för VPC BGW (VXLAN EVPN Multi-site). Uppdraget innebär förändring av kundens datacenternätverk då infrastrukturen för datacentret kommer att byggas om. Uppdraget förväntas omfatta cirka 60 timmar och innefattar konsultation samt verifiering av lösningen. Obligatoriska kvalifikationer: För denna roll krävs: Mycket god kännedom om VXLAN EVPN Multi-site (VPC BGW) Mycket god förmåga att dokumentera, presentera och följa upp Mycket god erfarenhet av att arbeta med komplexa och stora nätverksmiljöer Meriterande kvalifikationer: Det är meriterande om du har: Erfarenhet av att arbeta i en större ACI-miljö"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72304-tekniska-specialister-virtualisering/",
    "roles": [
      "Teknisk specialist"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu två Tekniska Specialister (DevOps engineer) till sektionen DevOps inom digitalisering, IOC och Plattformar. Du kommer att vara med och driva utvecklingen av den virtuella plattformen som stödjer framtidens tjänster för patienter, invånare och medarbetare. Vi söker dig som har praktisk kunskap och erfarenhet av att arbeta med större Enterprise VMware-miljöer. Du bör också ha erfarenhet av automation. Du kommer att ingå i ett virtualiseringsteam som ansvarar för att utveckla och förvalta den virtuella infrastrukturen. Teamet består av en Produktansvarig (Product Owner), en Team Coach (Scrum Master) och flera Tekniska Specialister (DevOps engineers). Vår kund har en etablerad Enterprise VMware-miljö som inkluderar teknologier som vSphere, VMware Horizon, Aria Operations, Tanzu, vCloud Foundation och NSX. Huvudsakliga ansvarsområden: Som Teknisk Specialist (DevOps engineer) kommer du att: Utveckla och förvalta den virtuella infrastrukturen Leverera kapacitet Optimera prestanda, säkerhet och tillgänglighet Kvalifikationer: Minst 3 års mycket god erfarenhet av att ha arbetat med Enterprise VMware-miljöer i stora organisationer God erfarenhet av VMware-teknologier, inklusive vSphere, vCenter och vCF God erfarenhet av automatisering och skriptning God erfarenhet av Powershell God erfarenhet av server-OS från Microsoft Förmåga att arbeta självständigt och i team God problemlösningsförmåga Förmåga att uttrycka dig väl i tal och skrift på både svenska och engelska Du kan komma att säkerhetsklassas, vilket kan ställa krav på svenskt medborgarskap. Meriterande kvalifikationer: God erfarenhet av server-OS från Ubuntu och Redhat God erfarenhet av Horizon VDI-plattform God förståelse för nätverks- och lagringstekniker som påverkar virtualiserade miljöer God erfarenhet av att utforma och implementera självbetjäningslösningar och automatiserade processer God erfarenhet av agila arbetssätt God erfarenhet av versionshantering (exempelvis Git) God erfarenhet av infrastruktur som kod och CI/CD-pipelines Erfarenhet av Kubernetes-plattform, exempelvis vCenter integrated Tanzu Personliga egenskaper: Vi söker dig som: Är nyfiken och strävar efter att förbättra och utveckla dig själv Gärna stöttar dina kollegor i deras arbete Har god samarbetsförmåga Har god kommunikationsförmåga, både internt och externt"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72300-systemforvaltare-liferay-alfresco-java/",
    "roles": [
      "Systemförvaltare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning Vi söker en erfaren systemförvaltare på uppdrag av vår kund. Rollen innefattar både systemutveckling och teknisk projektledning. Du kommer att arbeta i kundens lokaler i Göteborgsområdet men vissa arbetsuppgifter kan utföras på distans. Huvudsakliga ansvarsområden: Förvaltning och vidareutveckling av kundens Liferay-plattform. Nära samarbete med frontendutvecklingsteamet för att säkerställa att Liferay-lösningen uppfyller de ställda kraven. Utföra uppgraderingar och vidareutveckling av Liferay-plattformen i enlighet med förvaltningsplaner och kundens kravspecifikationer. Obligatoriska kvalifikationer: Gedigen erfarenhet av Liferay och Java-baserade tjänster. Förmåga att omvandla användar- och kundkrav till tekniska lösningar. Erfarenhet av agila arbetsmetoder inom systemutvecklingsprojekt. Minst 5 års erfarenhet av följande teknologier och ramverk: Portlets (JSR286) Spring, Spring Portlet MVC JPA, Servlet, Tomcat PostgreSQL, Mule, Camel REST, JMS SVN, Jenkins, Nexus Meriterande kvalifikationer: Erfarenhet av att samarbeta med Liferay som partner. Kunskaper om Elasticsearch. Dokumenterad erfarenhet av arbete inom offentlig sektor, särskilt inom politiskt styrda organisationer."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72289-systemforvaltare-utveckling-optimizely/",
    "roles": [
      "Systemförvaltare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en systemförvaltare med gedigen erfarenhet av utveckling och administration av Optimizely. Arbetet utförs främst på plats hos kunden i Göteborgsområdet men det finns möjlighet till visst distansarbete. Uppdraget &#8221;Optimizely uppgradering och utveckling&#8221; omfattar bland annat uppgradering av Optimizely och utveckling av tjänster baserat på krav från förvaltningen och verksamheten. Huvudsakliga ansvarsområden: Medverkan i pågående förvaltning och utveckling av intranätet och externwebben som är byggda med Optimizely. Deltagande i dokumenthanteringsprojekt som inkluderar integrering av dokumentpublicering i intranätet. Uppdrag kan även härröra från ärendeberedning inom funktionsområdet Webbtjänster, vilka kan omfatta förändringar i den förvaltade miljön eller uppgifter finansierade av enheten Information och Arkivering. Hög kompetens kring kringliggande system och tjänster som integreras med Optimizely, exempelvis Lucene/SolR (sökmotor), Fotoweb (bildhantering), Sharepoint, Yammer och Apelon (metadatatjänst). Konsulternas kompetenskrav ligger på nivå 4, vilket innebär en hög nivå av kunskap inom Optimizelys senaste versioner och dess utveckling. Obligatoriska kvalifikationer: Djup erfarenhet av Optimizely samt relaterade tjänster som Ifeed, Sharepoint, Apelon, och Lucene/SolR. Stark förmåga att omsätta användar- och kundkrav till tekniska lösningar. Proaktivt ansvarstagande i roller inom systemutveckling och projektledning. Deltagande i KSD releasehantering, vilket kräver överenskommelser kring arbetstider och leveranser. Erfarenhet av att arbeta med agila utvecklingsmetoder i utvecklingsuppdrag. Systemutveckling inom Optimizely CMS. Minst tre års erfarenhet av uppdrag inom offentlig verksamhet. Meriterande kvalifikationer: Dokumenterad erfarenhet av integrationer med andra system i kundens webbplattform, exempelvis Lucene/SolR, Liferay och CA Siteminder (säkerhetslösningar). Kompetens inom systemarkitektur, integrationsmetoder, och databasarkitektur. Erfarenhet av utveckling i både .NET och Java. Djup förståelse för Optimizelys administrativa funktioner."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72284-losningsarkitekt-25/",
    "roles": [
      "Lösningsarkitekt"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning: Vår kund söker en senior lösningsarkitekt till ett antal projekt inom stöddomänen, initialt till uppdrag rörande våra verksamheter inom områdena för Juridik och Koncernsäkerhet/CISO. Du kommer att ha ansvar för framtagandet av lösningar i flera projekt inom dessa områden. Du kommer även att i vissa frågeställningar avlasta områdets domän-/linjearkitekt. Förutom att driva lösningsframtagningen och säkerställa att lösningen följer beslutade strategier och riktlinjer, möter funktionella och icke-funktionella krav medverkar du också i kravanalys samt i planering och koordinering av projektens leverabler, som stöd till projektledare och it-projektledare. Du kommer att ha ett nära samarbete med våra leverantörer rörande detaljerade krav, systemdesign, systemutveckling, test och leverans. Erfarenhet: Erfarenhet av upphandlingsuppdrag och att arbeta med underleverantörer Erfarenhet av att arbeta i en outsourcad internationell miljö, med underleverantörer för utveckling, Mångårig Erfarenhet som ansvarig lösningsarkitekt i projekt i större organisationer Erfarenhet av kravanalys Erfarenhet av IT-lösningar levererade som SAAS-tjänster Bred kompetens inom IT-arkitektur Meriterand: Erfarenheter av systemstöd för GRC, avtalshantering, styrdokumentshantering samt säkerhetskravställn Branscherfarenhet från tillståndspliktig verksamhet är meriterande Erfarenhet av teknisk projektledning är meriterande Erfarenhet av IT-lösningar levererade på Servicenow Erfarenhet från digitalisering av stödfunktioner t.ex. inom säkerhet och juridik"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72283-systemforvaltare-liferay/",
    "roles": [
      "Systemförvaltare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en systemförvaltare med erfarenhet av Liferay. Kunden har utvecklat webbapplikationer i Liferay för sina olika förvaltningar, en plattform som bygger på öppen källkod. De är nu i behov av vidareutveckling och förvaltning av Liferay-lösningar, samt andra relaterade uppdrag som använder samma teknik. Arbetet sker enligt agila principer, och scrum används som arbetsmetod. Huvudsakliga ansvarsområden: Ansvara för förvaltning och utveckling inom Liferay-plattformen. Samarbete med frontendutvecklare för att säkerställa att de tekniska kraven uppfylls. Teknisk projektledning med ansvar för uppgradering och vidareutveckling av Liferay. Utveckling av nya tjänster baserat på krav från kundens förvaltning och verksamhet. Obligatoriska kvalifikationer: Gedigen erfarenhet av att arbeta med Liferay och tjänster utvecklade i Java. God förmåga att omvandla användar- och kundkrav till tekniska lösningar. Möjlighet att utföra arbetet på plats hos kunden i Mölndal, med viss flexibilitet för distansarbete. Erfarenhet av agila utvecklingsmetoder. Minst 5 års erfarenhet av tekniker som Portlets (JSR286), Spring, Spring Portlet MVC, JPA, Servlet, Tomcat, PostgreSQL, Mule, Camel, REST, JMS, SVN, Jenkins, Nexus, med flera. Meriterande kvalifikationer: Det är önskvärt att leverantören är Liferay-partner. Erfarenhet av arbete inom offentlig sektor."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72268-utvecklare-power-plattform/",
    "roles": [
      "Utvecklare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en utvecklare med inriktning på Power-plattformar. Plattformarna som används i stor utsträckning inom kundens organisation inkluderar SharePoint och Power Platform, inklusive Power BI. Huvudsakliga ansvarsområden: Bidra till att upprätthålla förmågan inom arkitektur och utveckling för SharePoint och Power Apps. Vidareutveckla verksamhetskritiska tjänster. Delta i projekt som syftar till att realisera applikationer som nyttjar Power Platform och SharePoint. Utveckla Power Apps som nyttjar SharePoint som datalagring samt Power BI för rapportering och uppföljning. Bidra till genomlysning och analys av nya behov inom organisationen. Obligatoriska kvalifikationer: Minst 5 års erfarenhet av M365/SharePoint-utveckling. 1-3 års erfarenhet av utveckling inom Power Platform. Erfarenhet av att bygga canvasappar i Power Apps. 3-5 års erfarenhet av arbete i agila projekt. Utmärkta kunskaper om integrationer mellan SharePoint, Power Apps och stödjande system. Meriterande kvalifikationer: Kännedom om stora politiska organisationer. Håller sig uppdaterad om den senaste utvecklingen inom M365, specifikt SharePoint och Power Platform. Erfarenhet av att bygga modelldrivna appar i Power Apps. Personliga egenskaper: Självgående och med god samarbetsförmåga inom teamet samt över organisationsgränser. God analytisk förmåga för att hantera komplexa problem och utveckla effektiva lösningar. God kommunikativ förmåga, inklusive att hålla demos och möten. &nbsp; Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72226-senior-infrastructure-engineer-2/",
    "roles": [
      "Backend",
      "Engineer",
      "Infrastruktur"
    ],
    "places": [
      "Hybrid",
      "Stockholm"
    ],
    "description": [
      "We are looking for a Senior Backend Engineer that will join the team in our Platform mission that enables our engineers to effectively utilize cloud infrastructure by providing a platform for infrastructure composition. Our declarative infrastructure is built on top of Kubernetes and we work closely with Google to make sure our platform scales with the growing number of managed resources at us. What you&#8217;ll do: As a team, we build a platform that enables infrastructure as code at us, with the entire engineering organization as our users. The tech stack you’ll work on includes Kubernetes operators (typically in Golang); supporting backend services (in Java); utilities and scripts (in Python and Bash); analytics data pipelines (in Python and SQL); and a lot of declaratively managed infrastructure of our own (in YAML). Collaborate closely with our sister platform squads and become a valued member of an autonomous, cross-functional team. We want you to bring your whole self to work and strive to foster an environment that supports your individual growth. Who you are: A valued team player in an autonomous, cross-functional team that inspires others experienced in designing, analyzing, optimizing code, and troubleshooting large-scale distributed systems. Experienced with Kubernetes, GKE, and Google Cloud Platform. Knowledgeable in how to write distributed, high-performance services and experienced in deploying and operating services on Linux. Passionate about infrastructure as code Can use scripting languages where needed to glue pieces together Have experience with Java and/or Go Equipped with a systematic problem-solving approach coupled with effective communication skills and drive. Excited about working on a team where you constantly learn, experiment, and iterate quickly. Extra: *Engineers with a solid engineering background (MSc. in engineering of related) *Engineers with experience extending k8s, writing their own or maintaining k8s operators and CRDs *Experience within platform organisations is a plus *Experience with GCP is a plus"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72196-platform-engineer-5/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en Platform Engineer som ska bidra till digitalisering, IOC (Infrastructure Operations Center), plattformar och DevOps. Uppdraget omfattar att utveckla framtidens tjänster för patienter, invånare och medarbetare. Vår kund erbjuder flexibla arbetsformer, med möjlighet att kombinera arbete på deras kontor i Göteborgsområdet och distansarbete. Målet är att effektivisera processen för applikationsteamen att produktionssätta system samt att standardisera och automatisera hostingplattformen. Ett viktigt fokusområde är Infrastructure as Code (IaC), där återanvändbara funktioner och enhetlighet inom serverparken är centrala. Genom att implementera dessa principer strävar kunden efter att öka effektiviteten och minska risken för fel. Huvudsakliga ansvarsområden: Som Platform Engineer kommer du att: Samarbeta med teamet för att vidareutveckla och drifta kundens hostingplattform. Arbeta i en agil organisation och delta i ett team som befinner sig i en intensiv och kreativ utvecklingsfas. Bidra till utvecklingen av serverlösningar som tillgodoser både nuvarande och framtida behov från invånare och medarbetare. Utveckla nya funktioner och tjänster med fokus på att förenkla konsumtion och drift av standardiserade servrar. Obligatoriska kvalifikationer: Minst 1 års erfarenhet av arbete inom serverpark i offentlig sektor. Minst 5 års erfarenhet av arbete i större organisationer inom offentlig sektor. Mycket god erfarenhet av serveradministration på stora Windowsplattformar. Mycket god erfarenhet av serveradministration i stora Linuxmiljöer. Erfarenhet av att implementera automatiserade processer och självbetjäningslösningar. Erfarenhet av agila arbetssätt. God förmåga att uttrycka dig i tal och skrift på både svenska och engelska. Erfarenhet av att skapa återanvändbara funktioner och självservicelösningar via script och API Observera att tjänsten är säkerhetsklassad, vilket innebär att svenskt medborgarskap är ett krav. Meriterande kvalifikationer Ansible/AWX. Microsoft Endpoint Configuration Manager (MECM/SCCM). OP5 och Systems Center Operation Manager (SCOM). Active Directory (AD) och Group Policies. Säkerhetsarbete för serverplattformar. VMWare för virtualisering. Automation genom script, såsom Powershell, Python eller shellscript. Scrum-metodiken. Personliga egenskaper Vi söker dig som är: Självgående men även en lagspelare. Nyfiken och ständigt strävar efter att förbättra och utveckla dig själv. Villig att stötta och samarbeta med kollegor. Bra på att kommunicera och samarbeta med olika delar av organisationen, då rollen innebär omfattande kontakt med flera team. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72186-data-engineer-infrastruktur-cybersakerhet/",
    "roles": [
      "Ingenjör"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en dataingenjör som ska bidra till kundens digitalisering samt arbeta med IoC-plattformar och DevOps. Du kommer att ingå i deras DevOps-team inom Infrastruktur och Cybersäkerhet. Uppdraget innefattar att utveckla framtidens tjänster för patienter, invånare och medarbetare. Huvudsakliga ansvarsområden: Designa, utveckla, testa och underhålla robusta, säkra och skalbara lösningar för datalagring och databehandling. Bygga och underhålla data pipelines och automation. Bidra till utvecklingen av nya tjänster för att bättre möta invånarnas och medarbetarnas behov, både nu och i framtiden. Implementera principen &#8221;automatisera allt&#8221; för att skapa lösningar för både intern och extern användning av infrastruktur och plattformar. Arbeta med både implementering och förvaltning av olika förmågor kopplade till produkten. Fungera som en brygga mellan data scientists, dataanalytiker och IT-funktionen. Obligatoriska kvalifikationer: Omfattande kunskaper om Denodo. Erfarenhet av att bygga data pipelines och automation. Goda kunskaper i Python. Goda kunskaper inom SQL/NoSQL och erfarenhet av ETL/ELT-utveckling. Erfarenhet av datalager och data lakes. Erfarenhet av arbete med datahantering. Erfarenhet och kunskap om datavirtualisering. Erfarenhet och kunskap om data catalog tools. God förståelse för DevOps-metodik och agilt arbetssätt. Minst två års erfarenhet av att arbeta i organisationer och miljöer. Svenskt medborgarskap är ett krav eftersom tjänsten kommer att säkerhetsklassas. Meriterande kvalifikationer: Fördjupad förståelse för DevOps-metodik och agilt arbetssätt. Förmåga att uttrycka dig väl i tal och skrift på både svenska och engelska. Erfarenhet av en eller flera ledande databasmotorer. Erfarenhet och kunskap om datavirtualisering. Erfarenhet och kunskap om data catalog tools. &nbsp; Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72155-software-developer-19/",
    "roles": [
      "Developer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Software Developer for SUM &amp; TPMS SW Factory – Infrastructure &amp; CI. The role involves designing, developing, and maintaining the SUM &amp; TPMS CI pipeline and infrastructure. We are looking for someone with a deep understanding of CI/CD, DevOps, and a passion for delivering high-quality software solutions. Main Responsibilities: Build automation, including automated build systems for vehicle software. Integrate Unit/Component/Domain regression testing as part of the CI/CD process. Automate Unit/Component verification gates with SIL/MIL/HIL testing. Implement static code analysis, code linting, and style enforcement tools. Provide support for software release processes. Maintain HIL rigs for various components like ECUs and sensors. Develop and execute test frameworks for Vector CANoe tests in HIL rigs and SWDL gates. Analyze logs and trace issues within hardware and software under test, including fault injection. Collect and report data from HIL tests. Support software releases. Use containerization technologies like Docker for development and production environments. Design and implement CI/CD pipelines for continuous integration and delivery. Write unit, integration, and end-to-end tests to ensure code quality and reliability. Perform code reviews and follow best practices to maintain code quality and consistency. Provide support to other teams for the integration of HIL tests into CI/CD pipelines. Assist other development teams with optimizing test execution time and reporting test results. Collaborate with product owners, designers, and other developers to deliver features and enhancements. Participate in agile ceremonies such as sprint planning, stand-ups, and retrospectives. Mentor and guide junior developers. Required Qualifications: Experience with DevOps practices, including CI/CD pipelines. Familiarity with automated verification systems and software release processes. Knowledge of: Feature branch strategy Traceability and data coverage C, Python, MATLAB Gerrit, Zuul CI, Jenkins, Artifactory, Robot Framework, Green Hills PPC, Polyspace, BlackDuck, Vector Version control systems, particularly Git. Required Attributes: Strong problem-solving skills and attention to detail. Excellent communication and teamwork abilities. Ability to manage time effectively and meet deadlines."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72152-ad-adas-connectivity-and-maps-system-engineer-2/",
    "roles": [
      "System Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking an experienced AD/ADAS Connectivity and Maps System Engineer. Main Responsibilities: Work as a team player in a cross-functional team. Contribute system engineering competence and experience from similar roles. Qualifications: Experience in coding from previous positions. Desired Attributes: Strong interest or passion for AD/ADAS (Autonomous Driving/Advanced Driver Assistance Systems). Desire to be part of the shift toward autonomous driving vehicles and the creation of new customer experiences."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72149-senior-devops-technician-2/",
    "roles": [
      "DevOps Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a senior DevOps technician living in or near Gothenburg to join their office on a regular basis. The team’s responsibility is to provide and maintain services such as: Artifactory (a binary management system) Black Duck (a software composition analysis tool) SonarQube (a static code analysis system) Polyspace Access (a presentation tool for Polyspace Bugfinder) These tools are used by several thousand developers within our client’s organization. The team is committed to improving and automating these services to enhance the lives of their users. Currently, the team consists of four DevOps engineers who specialize in technologies and platforms such as: Azure AWS Terraform Kubernetes Argo CD How they work: Collaborate closely with various stakeholder teams to better understand their needs. Improve key characteristics of the services offered, including user experience, performance, scalability, resource utilization, supportability, maintainability, and observability. Automate service management. Implement a GitOps approach to operations. Provide self-service options and documentation for end-users. Offer expert-level support for their services. Required Qualifications: Outspoken and willing to actively participate in brainstorming sessions. Proactive, with a knack for finding new solutions to technical challenges or improving ways of working. Curious, eager to learn, and able to think outside the box. A true team player with excellent communication and collaboration skills. Confident in working with Linux and Git. Solid understanding of CI/CD pipelines. Experience with Kubernetes and Docker. Good knowledge of Azure and/or AWS. Broad understanding of IT infrastructure and its components to help diagnose and resolve incidents affecting the tools. Additional Qualifications: Experience with Azure Cloud and Azure-managed services. Experience with the GitOps way of working. Expertise in Kubernetes. Experience with Artifactory, Black Duck, and SonarQube. Knowledge of Polyspace Access. Familiarity with high-availability applications. Proficiency in Python."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72111-testare-12/",
    "roles": [
      "Testare"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning På kunds räkning söker vi nu testare för ett projekt. Uppdraget går ut på att Ansvara för att tester genomförs Själv genomföra tester Kunna estimera, implementera och felsöka i testmiljön Ansvara för teststrategi och testplan. Ansvar för testledning av interna och externa parter Utifrån sin tekniska erfarenhet förstå den nuvarande lösningen, identifiera hur testarbetet ska planeras och genomföras Du är drivande på egen hand och tillsammans med andra, och tar självständigt ansvar. Utföra testerna i en teknisk miljö inom områden som omfattas av bland annat integrationer, databas, videoinspelning Skallkrav: Du ska vara erfaren testare med testledarerfarenhet. Du ska ha minst 4 års dokumenterad erfarenhet av att själv praktiskt utfört tester i en teknisk miljö med komplexa (minst tre system involverade) IT-system med många integrationer. Du ska ha minst 4 års dokumenterad erfarenhet av att kunna strukturera, dokumentera och administrera testfall. Du ska ha dokumenterad erfarenhet av automatiserade och detaljtekniska tester och användning av verktyg så som tex postman. Minst två uppdrag de senaste 6 åren Du ska ha dokumenterad erfarenhet att arbeta och planera i testverktyg som t.ex. X-ray/JIRA, minst två exempel. Du ska ha erfarenhet av att översätta krav till exempelvis user stories, use case, testfall. Minst två uppdrag de senaste 4 åren. Du ska ha erfarenhet av att ta fram och driva teststrategi, testplan och testfall i agilt ramverk från minst 1 tidigare uppdrag de senaste 4 åren. Ange uppdrag och år. Börkrav: Du bör ha erfarenhet av att leda och utföra tester tillsammans med verksamhet, IT och extern leverantör end to end utifrån krav och behov. Minst 1 uppdrag. Du bör a utfört minst 2 uppdrag som testare med system för strömmad video. Du bör ha erfarenhet av inlärning och test av AI vid minst 1 tillfälle. Du bör ha erfarenhet av att praktisk utföra testarbete av system med skyddsvärd information enligt gällande lagstiftning ex säkerhetsskyddslagstiftningen de senaste 3 åren. Du bör ha erfarenhet från att arbeta med behörighetshantering vid minst 1 uppdrag under de senaste 4 åren.Ange uppdrag och år. Du bör ha erfarenhet av minst ett uppdrag på för en offentlig myndighet/förvaltning de senaste 10 åren. Ange uppdrag och år. &nbsp; Du kommer att arbeta på plat i vår kunds lokaler i Stockholm. Dagar och tider för detta styrs efter behov av organisationen och de agila team man arbetar i."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72100-data-engineer-26/",
    "roles": [
      "Data Engineer"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning På kunds räkning söker vi nu en senior Data Engineer med erfarenhet och engagemang för att i ett tidigt skede vara med i uppbyggnaden av en ny analysplattform på Azure. Du ska vara självgående, och driven i dina uppgifter samt ha ett stort engagemang för helheten. En viktig del i vardagen är även att dela med sig och stötta övriga i gruppen. Rollbeskrivning: Du kommer att utveckla use case på den nya analysplattformen för att ersätta analysfunktionalitet i den gamla analysplattformen. Bygga ny funktionalitet utifrån verksamhetens behov. Tillsammans med teamet vidareutveckla produktionssatt funktionalitet på nya plattformen. Bidra till att forma arbetssätt och processer. Samverka inom teamet, mellan teamen, övriga IT samt med verksamheten. • Bidra till kompetensspridning inom gruppen. Kvalifikationer: Du ska ha minst 5 års erfarenhet av utveckling av organisationsövrgripande BI- och data analyslösningar. Du ska ha minst 3 års erfarenhet av utveckling i Microsoft Azure. Du ska ha minst 2 års erfarenhet av utveckling i Microsoft Azure Synapse, alternativt Data Bricks, som plattform för BI- och dataanalys. Du ska ha minst 5 års erfarenhet av ETL/ELT. Du ska ha minst 2 års dokumenterad erfarenhet av utveckling i Apache Spark Notebooks. Du ska ha minst 3 års erfarenhet av dimensionsmodellering. Du ska minst 2 års erfarenhet av semantisk modellering i Power BI eller Azure Analysis Services. Du ska ha minst 2 års erfarenhet av mentorskap/stöd för mer juniora utvecklare. Mervärdeskrav: Minst 2 års erfarenhet av CI/CD. Minst ett uppdrag med utveckling i medaljarkitektur och Datalake House. Minst 1 års erfarenhet av utveckling i Power BI Desktop och Power BI Services. Du kommer att arbeta i vår kunds lokaler i Stockholm, med möjlighet till delvis arbete på distans."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72085-project-manager-13/",
    "roles": [
      "Project Manager"
    ],
    "places": [
      "Ballerup"
    ],
    "description": [
      "Assignment Description: Our client is looking for a project manager who can lead a strategic important development project. The project shall deliver a new credit solution with high focus on self-service and automation. The project is an important part of the strategic process and involves many stakeholders from different levels of the organization. The project manager will work with many stakeholders on all levels with reference to the program manager. In line with standard practice in Norway, some travel will be required; the primary work location will be in Ballerup. &nbsp; Looking for an experienced project manager with solid experience from complex development projects, with special focus on: The basic PM toolbox is in place Experienced in understanding and managing requirements in agile setup Experienced in architecture and and design processes in agile setup Strong in stakeholder management (internally and externally) Strong cross-organizational integrator Experience with bringing different opinions (internal as well as external to project) together in a practical solution Important criterias: Certificering (IPMA or something similar) Banking Experience"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72073-applikationsspecialist-azure-devops/",
    "roles": [
      "Applikationsspecialist"
    ],
    "places": [
      "Mölndal"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en Applikationsspecialist med spetskompetens inom Azure DevOps. Som applikationsspecialist kommer du att vara en del av förvaltningsteamet. Verktyget är baserat på Microsofts plattform Azure DevOps med plugin-mjukvara för kravhantering, Modern Requirements4DevOps. Huvudsakliga ansvarsområden: Support och användarstöd inom Azure DevOps Konfiguration av verktyget Hantering av behörigheter och projekt Samarbeta med teamet för att digitalisera, effektivisera och kvalitetssäkra processer och rutiner Obligatoriska kvalifikationer: Erfarenhet av arbete inom offentlig sektor Tidigare erfarenhet som applikationsspecialist Relevant akademisk utbildning inom IT eller motsvarande kompetens Dokumenterad erfarenhet av Microsoft Azure DevOps Mycket god förmåga att dokumentera och presentera på svenska Goda kunskaper i engelska, både i tal och skrift Meriterande kvalifikationer: Erfarenhet av systemutveckling Erfarenhet av arbete med systemintegrationer Erfarenhet av arbete med IT-infrastruktur Goda kunskaper inom agila arbetssätt i projekt eller förvaltning Personliga egenskaper: En god förmåga att förstå komplexa sammanhang Utmärkta kommunikations- och samarbetsförmågor En serviceinriktad inställning Förmågan att ha en helhetssyn utifrån kundens behov och krav Du är engagerad i både verksamheten och din egen personliga utveckling, och är van vid att arbeta proaktivt och ta egna initiativ"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71996-senior-solution-architect-within-procurement/",
    "roles": [
      "Solution Architect"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Assignment Description: Join our clients team as a Solution Architect for Procurement, collaborating closely with our current Solution Architects. Together, we aim to cultivate a diverse set of competencies spanning both technology and business domains. Their scope encompasses data collection from all sites worldwide, data curation, and integration of business process data across various bank functions. You&#8217;ll be onsite at the Stockholm office three days per week. Responsibilities: Lead and manage our source-to-pay project from an architectural perspective, encompassing process refinement, control enhancement, and technology integration, within various facets of the Source-to-Pay (S2P) processes. Implementing strategic procurement solutions tailored to meet the requirements of using best practices and guidance from our partners. Executing process enhancement within procurement to enhance operational efficiencies. Streamline systems and procedures to optimize procurement operations on a global scale. Bring procurement market dynamics and providing informed guidance to the project team. Provide guidance and patterns to make sure that the development team build solutions that are scalable, flexible, secure and corresponding of long term strategy. Practical requirements: Source-to-Pay (S2P) platforms preferably Coupa, however additional expertise with tools like Ivalua, Icertis, Zycus, SAP Ariba and SAP S4 as an implementer/administrator would be advantageous. Hands-on involvement in at least 1-2 end-to-end implementations, including Blueprint Workshops, with the ability to map business processes effectively. Experience in functional/implementation aspects of Coupa, or other E-procurement technologies, particularly focusing on areas such as Spend Analysis, Strategic Sourcing, Contract Management, Supplier Management, Procure, Invoicing, Expense, Pay, and eForms. Experience in formulating and implementing non-functional requirement including IT security Proficiency in defining data migration strategies for master and transactional data across upstream and downstream systems. Experience in working with large enterprises with complex IT solution landscape. Qualifications: Experience with a focus on supply chain and operations. Used to work in high pace projects with ability to deliver on time. Ability to work with many stakeholders such as Product Owners, Tech Leads, Vendors and Third-party suppliers. Problem-solving abilities, with a data-driven approach to decision-making. Exceptional communication and interpersonal skills. Willingness to some travel to other locations within Europe. Fluent in both English and Swedish."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72029-testare-lumera-2/",
    "roles": [
      "Testare"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Vår bankkund inför standardsystemet Lumera och behöver förstärka inom test. Vi söker dig med gedigen erfarenhet av tester i stora standardsysteminföranden och som har arbetat inom försäkringsområdet med Lumera. Vi arbetar agilt enligt SAFe och ser gärna att du förstår hur testledning i pågående Epics ska koordineras och ledas mot levererande tåg och team. Vi ser med fördel att du har djup kunskap och stor erfarenhet som testare och har arbetat med framförallt verksamhets- men även IT-relaterade tester inom försäkringsområdet och Lumera. Du kommer ingå i ett team med testexperter som stöttar varandra t att på bästa sätt hjälpa verksamheten, tåget och teamen att hålla hög kvalitet i leveranserna till Bankens kunder. Som person är du lösningsorienterad, prestigelös och gillar att jobba tillsammans med andra mot gemensamma mål. Du har förmågan att se lösningar där andra ser problem. Exempel på arbetsuppgifter: Skapa testfall utifrån krav och konfiguration. Exekvera tester i Lumera och rapportera utfall i Zephyr. Stödja teamen med Lumera- och testkunskap. Validera XML till Metaforce och PDF från Metaforce. Göra SQL-testdatautsökningar i Lumera. Vara stöd i skapandet och valideringen av API-anrop. &nbsp; Kompetenskrav Kompetenser vi söker hos dig: Gedigen kunskap om testprocesser samt erfarenhet av att planera och exekvera testfall. Erfarenhet av försäkringsområdet, kundhandlingar, avtal- och tjänstepension. Erfarenhet av arbete i Lumera och kunskap om processerna i Lumera. Förståelse för Lumeras testmiljöer och hantering av Lumeras releaseprocesser. Erfarenhet av arbete med Metaforce är meriterande. Grundläggande SQL-kompetens. Kunskap kring API-anrop, gärna SOAP-UI och/eller Ready-API. Erfarenhet av Jira, Confluence och Zephyr. Erfarenhet av agil systemutveckling (gärna enligt SAFe) med fokus på manuella tester. &nbsp;"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72022-systemforvaltning-utveckling-optimizely-enhet-information-arkivering/",
    "roles": [
      "Systemförvaltare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu dig med lång och dokumenterad erfarenhet inom utveckling och administration av Optimizely. Arbetet sker delvis på plats i kundens lokaler i Göteborg, men vissa delar kan utföras på distans och involverar uppgradering och utveckling av Optimizely. Detta innefattar uppgraderingar och vidareutveckling av tjänster baserade på krav som formulerats av förvaltningen och andra uppdrag, med fokus på att möta behoven från olika delar av verksamheten. Huvudsakliga ansvarsområden: Delta i pågående förvaltning och uppdrag som rör intranätet och externwebben byggda i Optimizely. Samarbeta med dokumenthanteringsprojekt som ska integrera dokumentpublicering i intranätet. Hantera uppdrag som kommer från ärendeberedning under ansvarsområdet Webbtjänster, som kan inkludera förändringar i den förvaltade miljön eller förändringar finansierade av enheten Information och Arkivering. Arbeta med relaterade system och tjänster kring Optimizely-miljön, som Lucene/SolR, Fotoweb (bildhantering), Sharepoint, Yammer och metadatatjänsten Apelon. Bidra med expertkunskap inom utveckling av Optimizely i dess senaste versioner. Obligatoriska kvalifikationer: Gedigen erfarenhet av Optimizely och relaterade IT-tjänster som Ifeed, Sharepoint, Apelon, Lucene/SolR med mera. Förmåga att omvandla användar- och kundkrav till tekniska lösningar. Proaktivt ansvarstagande inom systemutveckling och projektledning. Deltagande i KSD releasehantering, vilket kräver överenskommelser om arbetstider och andra praktiska arrangemang. Erfarenhet av att arbeta i utvecklingsuppdrag som följer agila metoder. Minst 3 års erfarenhet av systemutveckling inom Optimizely CMS i offentlig verksamhet. Meriterande kvalifikationer: Erfarenhet av integrationer med andra delar av plattformen, inklusive Lucene/SolR (sökmotor), Liferay, och säkerhetslösningar från CA Siteminder. Kompetens inom systemarkitektur, integrationsmetoder, och databasarkitektur. Erfarenhet av både .NET och Java. Djupgående kunskap om Optimizelys administrativa funktioner."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72005-teknisk-specialist-adc-drift-2/",
    "roles": [
      "Teknisk specialist"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en Teknisk Specialist inom ADC-drift. Rollen kräver djup expertis inom federationsprotokoll och säker autentisering, med särskild fokus på SAML, OAuth och OpenID Connect, samt erfarenhet av att konfigurera och implementera F5 lösningar för säker och skalbar federering. Arbetet sker i en miljö där hög säkerhet och komplexa integrationer är avgörande. Huvudsakliga ansvarsområden: Implementera, hantera och optimera federationslösningar och säker autentisering med F5 Access Policy Manager (APM). Arbeta med federationsprotokoll som SAML, OAuth och OpenID Connect. Utföra felsökning och support inom dessa områden. Överföra kompetens till teamet. Hantera Single Sign-On (SSO)-lösningar och säkerhetsarkitekturer för federationer. Designa och implementera access policies i komplexa och säkerhetskritiska miljöer. Obligatoriska kvalifikationer: Omfattande erfarenhet av federationsprotokoll som SAML 2.0, OAuth 2.0, OpenID Connect (OIDC), inklusive Single Sign-On (SSO), attribute release policies samt hantering av signering, kryptering och verifiering av SAML Assertions och OIDC tokens. Gedigen kunskap om X.509-certifikat för signering och kryptering samt hantering av PKI-infrastrukturer kopplade till federationslösningar. Erfarenhet av att konfigurera och optimera F5 BIG-IP APM, särskilt när det gäller access policies, autentiseringslösningar och lastbalansering av federerade tjänster. Stark förståelse för TLS/SSL, IDP-initiated och SP-initiated federation, samt secure token services (STS) och hur dessa integreras med F5 lösningar för att säkerställa en sömlös och säker autentisering. Förmåga att skapa och presentera detaljerad teknisk dokumentation på svenska, inklusive design av federationslösningar, integrationsprocesser och tekniska specifikationer. Erfarenhet av att leda implementeringar och integrationer av federerade lösningar, både som teknisk expert och projektledare. Ett CV som tydligt beskriver erfarenhet av avancerade implementationer inom federationsprotokoll, säker autentisering, F5-produkter och storskaliga federationsmiljöer. Meriterande kvalifikationer: Bred erfarenhet som teknisk specialist inom komplexa IT-miljöer med särskild kompetens kring federation, autentisering och access management. Förmåga att hantera kunddialoger professionellt och bygga långvariga kundrelationer. Personliga egenskaper: Självständigt arbetssätt och förmåga att ta tekniskt ledarskap. Stark kommunikationsförmåga och kundfokus."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72001-teknisk-specialist-adc-drift/",
    "roles": [
      "Teknisk specialist"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en Teknisk Specialist som kommer att ingå i deras ADC-driftteam. Huvudsakliga ansvarsområden: Du kommer att ingå i ADC-teamet med följande arbetsuppgifter: Implementera, hantera och utföra beställningar inom området. Säkerställa stabil drift av lastbalanserare och applikationer. Konfigurera F5 BIG-IP, Loadbalancer och andra nätverksrelaterade produkter. Ge teknisk support samt utföra felsökning inom relevanta områden. Obligatoriska kvalifikationer: Grundläggande erfarenhet av nätverkskomponenter som lastbalansering, brandväggar och nätverkssäkerhet. God förståelse för grundläggande nätverksprotokoll som TCP/IP, DNS etc. Erfarenhet av att arbeta med lastbalansering. Erfarenhet av att arbeta med F5 BIG-IP eller likvärdiga lösningar är mycket meriterande. Förmåga att hantera teknisk support, identifiera och felsöka nätverksrelaterade problem, samt säkerställa att applikationer och tjänster fungerar korrekt. God förmåga att skapa teknisk dokumentation och kommunicera på svenska, både i tal och skrift. Meriterande kvalifikationer: Erfarenhet som nätverkstekniker eller specialist inom IT-infrastruktur med bred förståelse för nätverk och säkerhet. Förmåga att arbeta med både interna och externa intressenter för att förstå och möta behov och krav på nätverkslösningar."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71975-projektledare-enhet-forandring-och-mojliggorande/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Göteborg",
      "Hybrid"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en engagerad, drivande och lyhörd projektledare med starka samarbetsförmågor, som samtidigt trivs med att arbeta självständigt. Arbetet sker både på plats hos vår kund och på distans. Vid resor mellan olika kontor föredras användning av kommunala färdmedel. B-körkort är ett krav. Huvudsakliga ansvarsområden: Driva och koordinera olika IT-projekt som beställs och initieras av kundens verksamheter. Hantera projekt med fokus på: Användarnära IT-infrastruktur. Fastighetstekniska system, där projektledaren ansvarar för IT-stödet som dessa system använder. Föra dialog med beställare för att tydliggöra krav och förväntningar inom ramen för beställningarna. Ansvara för genomförandet av både små och stora projekt med varierande komplexitet. Med stöd av etablerade arbetssätt och team driva projekten på ett professionellt sätt och ansvara för: Projektbudget Planering Uppföljning Dokumentation Hantera ett varierande antal projekt beroende på storlek och omfattning. De flesta uppdrag är IT-relaterade, men vissa projekt kan vara mer koordinerande eller av förändringsledande karaktär. Obligatoriska kvalifikationer: Minst 5 års erfarenhet som IT-projektledare (inom de senaste 10 åren). Gedigen och bred kunskap om användarnära IT-infrastruktur. Bred erfarenhet inom IT-infrastruktur. Mycket god erfarenhet av att leda virtuella kompetensteam. Utmärkt förmåga att dokumentera och presentera på svenska. Svenskt medborgarskap (krävs för säkerhetsklassning). Ett CV som beskriver erfarenheter inom relevanta områden. Meriterande kvalifikationer: Erfarenhet av arbete inom politiskt styrda organisationer. Erfarenhet av agila arbetssätt. Erfarenhet av stora och komplexa IT-miljöer. Erfarenhet inom hälso- och sjukvården eller medicintekniska system. Erfarenhet inom IT-infrastruktur och IT-säkerhetsarbete. Personliga egenskaper: Engagerad, drivande och lyhörd projektledare. Stark samarbetsförmåga. Trivs i en drivande roll och kan arbeta självständigt. Prestigelös och bekväm med att dela med sig av erfarenheter och idéer."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71961-senior-projektledare-forandring-och-mojliggorande/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Göteborg",
      "Hybrid"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en erfaren och driven senior Projektledare. Arbetet sker både på distans och från vår kunds lokaler. När resor mellan kontor krävs används främst kommunala transportmedel, och ett B-körkort är ett krav. Uppdraget gäller bemanning av deras projektet Slutdesign för kundens plattform (Hardware refresh). Obligatoriska kvalifikationer: Minst 5 års aktuell erfarenhet som IT-projektledare, inom de senaste 10 åren. Goda och breda kunskaper inom användarnära IT-infrastruktur. Gedigen förståelse för IT-infrastruktur i allmänhet. Dokumenterad erfarenhet av att leda virtuella kompetensteam med framgång. Mycket god förmåga att dokumentera och presentera på svenska. Svenskt medborgarskap krävs då säkerhetsklassning ingår. Ditt CV ska tydligt beskriva din erfarenhet inom relevanta områden. Meriterande kvalifikationer: Erfarenhet av arbete med specifika sektorer, såsom 5G. Erfarenhet av att arbeta inom politiskt styrda, större organisationer. Erfarenhet av att leda förändringsprojekt med ett agilt arbetssätt. Erfarenhet från komplexa och stora IT-miljöer. Personliga egenskaper: Du är en engagerad och drivande person som är lyhörd för andras behov. Samarbete är en av dina starka sidor, men du trivs också med att arbeta självständigt. Du är prestigelös och delar gärna med dig av dina erfarenheter och idéer. Förmåga att ta ansvar och självständigt driva projekt framåt."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71956-projektledare-51/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en engagerad och självgående Projektledare som har en stark förmåga att samarbeta med andra, men som även trivs med att arbeta självständigt. Du bör vara prestigelös och generös med att dela din kunskap och dina idéer. Arbetet utförs både på kontoret och på distans. Vid resor mellan olika kontor används i första hand kollektiva transportmedel. B-körkort är ett krav. En av vår kunds främsta digitaliseringsmål är att stötta verksamheterna i deras införskaffande och utveckling av IT-tjänster. Avdelningen för Infrastruktur och cybersäkerhet driver dessutom interna projekt och uppdrag som syftar till att följa den globala teknikutvecklingen. Vidare ansvarar de för att följa upp och kvalitetssäkra IT-leveranser inom projekt och uppdrag. Inom enheten Förändring och möjliggörande, som tillhör avdelningen Infrastruktur och cybersäkerhet, genomförs huvudsakligen projekt och uppdrag med teknisk inriktning. Organisationen är uppdelad i olika team som fokuserar på specifika kundgrupper. Ofta handlar det om utveckling och implementering av ny teknik inom infrastrukturområdet, där man använder kompetenser från linjeverksamheten och från olika leverantörskontakter. Obligatoriska kvalifikationer: Minst 5 års erfarenhet som IT-projektledare (ej äldre än 10 år). Bred och djup kunskap inom användarnära IT-infrastruktur. God kännedom om IT-infrastruktur. Gedigen erfarenhet av att leda virtuella kompetensteam. Mycket god förmåga att dokumentera och presentera på svenska. Självständig och drivande i din roll. Svenskt medborgarskap, då säkerhetsklassning krävs. CV som tydligt beskriver din erfarenhet inom relevanta områden. Meriterande kvalifikationer: Erfarenhet av IT-infrastruktur och IT-säkerhetsarbete. Erfarenhet från arbete i större organisationer med politisk styrning. Erfarenhet av att leda förändringsprocesser enligt agila metoder. Erfarenhet från stora, komplexa IT-miljöer. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71936-penetrationstestare-2/",
    "roles": [
      "Testare"
    ],
    "places": [
      "Uppsala"
    ],
    "description": [
      "Uppdragsbeskrivning Vi söker en konsult som kommer genomföra en begränsad greybox pentest som omfattar deras e-tjänst för analysbeställningar i form av delar som beslutas tillsammans med er som leverantör. Omfattningen av uppdraget är satt till ett takpris. Resultat från arbetet ska kunna användas för bedömning av status på e-tjänsternas säkerhetsåtgärder och prioritering av förvaltningsarbetet med e-tjänsterna. Uppdraget ska minst generera en rapport som beskriver nuläget och en aktivitetslista för att hantera avvikelser. Uppdraget ska genomföras under hösten 2024. Uppdraget ska vara slutrapporterat under 2024. Vår kund driftar sin egna It-miljö för e-tjänsterna. Vissa applikationer inom ramen för e-tjänsterna köps som tjänst. Antalet servrar är fördelat enligt följande; fyra test-servrar och fyra produktionsservrar."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71885-product-owner-5/",
    "roles": [
      "Product Owner"
    ],
    "places": [
      "Hybrid",
      "Lund"
    ],
    "description": [
      "Assignment Description: We are looking for a Product Owner to manage and lead the Bluetooth service area. The role includes overseeing user interface for telephony, Bluetooth settings, eCall, and Bluetooth pairing and connectivity. You will prioritize and coordinate the work of a team of 10 developers handling multiple projects and deliverables. You&#8217;ll be working onsite at the client&#8217;s premises three days a week and remotely for the remaining days. Key responsibilities: Daily alignment with management and ensuring smooth communication. Managing certification for Bluetooth on new hardware and software versions. Serving as functional area owner for telephony, including handling the client&#8217;s requirements and reporting structures for new platforms. Overseeing problem management for Bluetooth by analyzing fault reports from the market, implementing corrective actions, and providing feedback to management. This role requires excellent organizational skills, strong technical knowledge, and effective communication abilities. Required skills: Good with people Social skill Solution-oriented Good at handling high pressure and high expectations Good at working with other people and other organizations to solve problems which are not directly within your control Have the perseverance to sometimes work in legacy requirement tools Ability to understand technical problems, working with developers and understanding their challenges Ability to work with UX (user interface organization who defines requirements) Background and understanding of Android implementation Background of understand Bluetooth and challenges with Bluetooth Background and understanding of telephony"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71878-arkivarie-inom-information-och-arkivering/",
    "roles": [
      "Arkivkonsult"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en arkivarie inom information och arkivering. Enheten för information och arkivering, som är en del av vår kunds digitaliseringsarbete, ansvarar bland annat för att förvalta och utveckla kundens mellanarkiv. Enheten behöver förstärkning av en arkivarie, då mellanarkivkonceptet måste ses över och utvecklas. Planen är att utöka mellanarkiveringsmöjligheterna för flera olika informationsmängder med både kort- och långsiktiga bevarandekrav. Huvudsakliga ansvarsområden: Vara expert på bevarandefrågor inom offentlig förvaltning. Inneha tekniska, organisatoriska och kommunikativa kompetenser för att säkerställa att arkivmaterial bevaras och tillgängliggörs effektivt för nuvarande och framtida användare. Delta i utvecklingsteam och samarbeta med projektledare, IT-arkitekter, kravledare, informatiker, systemutvecklare och systemförvaltare kring design av framtida mellanarkiv. Vara pedagogisk och kunna förmedla komplicerad information till personer inom många olika områden. Skriva rapporter. Ha erfarenhet av att arbeta i en stor organisation, helst inom offentlig sektor, för att förstå kundens komplexa verksamhet, vilket underlättar arbetet och kortar ner inlärningstiden. Obligatoriska kvalifikationer: Utbildning i arkiv- och informationsvetenskap eller motsvarande. 8–10 års erfarenhet av arbete som arkivarie, där du har arbetat med följande: Genomföra bevarande- och gallringsutredningar. Utreda frågor gällande digitalt bevarande. Ta fram och tolka informationshanteringsplaner. Deltagit i upprättande av riktlinjer och styrande dokument. Erfarenhet av utveckling och genomförande av inleveranser till myndighetens e-arkiv. Utveckla processer för förvaltning av digitalt arkiverad information, exempelvis migrering, gallring och informationsstruktur i e-arkivet. Initiera plan för digitalisering av befintligt analogt arkivbestånd. Praktisk erfarenhet av strategiskt utvecklingsorienterat arbete inom information/arkiv i offentlig förvaltning, med en &#8221;blick för framtiden&#8221;. Erfarenhet av arbete med förstudier för system inom digital informationshantering/mellanarkiv. Erfarenhet av kravställning av system för digital informationshantering/mellanarkiv. Förmåga att rapportera på svenska, både i tal och skrift. Hög grad av självledarskap samt en vilja att dela kunskap och lära ut. Meriterande kvalifikationer Erfarenhet av agilt arbetssätt. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71852-tekniskt-projektledare-ngr/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Norrköping"
    ],
    "description": [
      "Uppdragsbeskrivning: För vår kunds räkning söker vi nu en projektledare där du kommer ha en nyckelroll i att byta ut delar av systemstödet för vår kärnverksamhet, som stödjer nära 400 fysiska butiker samt e-handeln i kundmötet. I detta uppdrag, som är en kombination av projekt- och förändringsledning, kommer du att leda delprojektet som ansvarar för att utveckla lagerhanteringssystemet för e-handelslager samt ansvara för förändringsledningen mot e-handelslagret för hela förändringsprogrammet som omfattar ytterligare 5 delprojekt. Du kommer att arbeta nära verksamheten i e-handelslagret, externa leverantörer, samt de andra projekten och projektledarna i programmet. Din förmåga att driva ett projekt framåt, kommunicera effektivt och hantera intressenter kommer att vara avgörande för att uppnå våra högt ställda mål. Placering är i Norrköping med regelbundna resor till Stockholm. Arbetsuppgifter: Leda ett externt team för utveckling av lagerhanteringssystemet genom att säkerställa rätt förutsättningar och krav från verksamheten. Ansvara för programmets kommunikation och förändringsledning gentemot personalen på e-handelslagret. Ansvara för att säkerställa rätt resurser på rätt nivå och budget. Proaktivt identifiera, utvärdera och hantera potentiella risker i projektet. Planera så att utveckling och förändringsledning är i synk med programmets planer. Förbereda för lansering, inklusive testning och pilotimplementering. Erfarenthet: Erfarenhet av framgångsrik projektledning inom IT och systemimplementering i en större kontext. God teknisk förståelse och förmåga att hantera dialoger med tekniska team och leverantörer. Erfarenhet av förändringsledning och förändringskommunikation. Utmärkt kommunikationsförmåga och bygga relationer med olika intressenter, både inom IT och verksamhet. Strukturerat och metodiskt arbetssätt med förmåga att hantera komplexa projekt. Flytande i både svenska och engelska. Erfarenhet av regulatoriska verksamheter, lagersystem, orderhantering eller e-handel är meriterande."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71807-handlaggande-jurist-inom-tillsyn-enligt-pbl/",
    "roles": [
      "Organisationskonsult"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning Handläggning av specifika mer komplicerade tillsynsärenden. Uppdraget innebär att ta fram beslutsunderlag och ha kontakt med fastighetsägare och anmälare. Uppskattad tid i timmar för uppdraget: 5-10 timmar i veckan. Möjlighet till förlängning 6 månader. Distansarbete: Konsult kan arbeta 100% på distans. Krav på leverans Målet är att avsluta mer komplicerade tillsynsärenden inom plan- och bygglagen. Hantering av personuppgifter personnummer och fastighetsbeteckningar Handlingar som ska ingå i offert: &#8211; CV &#8211; Referensförteckning Skallkrav Jurist Goda kunskaper om tillsyn enligt plan- och bygglagen God erfarenhet av handläggning av tillsynsärenden Övriga krav 1- 2 referensuppdrag &nbsp; För att kunna ansöka för detta uppdrag måste du vara en registrerad användare i vår portal som är helt kostnadsfri. Är du ny användare och vill registrera dig eller ditt bolag i Upgrades portal klicka här: https://portal.upgraded.se/"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71741-projektledare-50/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en Projektledare. För att hälso- och sjukvården ska få största möjliga nytta av det nya IT-stödet krävs gemensamma processer och arbetssätt. Standardiseringen är en viktig del av förberedelserna för att vår kunds program ska kunna införas, och den involverar många medarbetare i vården. Huvudsakliga ansvarsområden: Ansvara för att samordna arbetet inom ett specifikt processområde. Säkerställa sammanhållning av flöden och processer i angränsande systemmiljöer. Leda ett team som utformar och driver arbetet framåt enligt beslutad plan och målbild. Samarbeta nära med leverantören för planering, koordinering och utveckling av processområdet. Vara delaktig i programmets andra projekt och framtida linjeorganisation för support och förvaltning. Bidra till ständiga förbättringar i en agil och tvärfunktionell arbetskultur. Obligatoriska kvalifikationer: Minst 10 års erfarenhet av att leda större projekt eller program. God förståelse för sjukvårdens processer och erfarenhet av verksamhetsutveckling inom hälso- och sjukvården. Erfarenhet av agila arbetsmetoder. Förmåga att leda inkluderande och coachande, där tillit och förtroende för medarbetarnas förmåga är centralt. Mycket god förmåga att planera, strukturera och genomföra arbete självständigt utifrån givet mandat. Proaktiv och lösningsorienterad, med förmåga att förutse och hantera utmaningar. Trivs i en föränderlig och ibland krävande arbetsmiljö. Flytande svenska i tal och skrift samt god förmåga att kommunicera på engelska i en internationell miljö. Meriterande kvalifikationer: Erfarenhet av vårdinformationssystem, t.ex. journalsystem. Erfarenhet från större hälso- och sjukvårdsorganisationer."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71658-lumera-specialist/",
    "roles": [
      "Specialist"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning: Vår kund genomför just nu ett införandet av Lumera och behöver förstärka ett team med en Lumera specialist. I rollen kommer du ingå i ett team inom Försäkring men även arbeta tillsammans med Epic Owner/beställaren. Arbetet innebär bl.a migrering, analys &amp; mappnings arbete. Du kommer arbeta på plats i kundens lokaler i Stockholm tre dagar i veckan. Kompetenskrav: Mycket goda försäkringskunskaper, allmänt samt specifikt tjänstepension Mycket goda kompetenser i Lumera, tekniskt och funktionellt, inklusive migreringsfunktionalitet samt installationer Lumeras datamodell Erfarenhet av migrering av tjänstpensionsbestånd till Lumera"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71648-projektledare-implementation-av-logex-costing/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en engagerad, drivande och lyhörd projektledare med en stark förmåga till samarbete. Du bör vara prestigelös och ha lätt för att lyssna på flera parter, men även kunna dela med dig av din erfarenhet och dina idéer. Huvudsakliga ansvarsområden: Projektet har tidigare överskridit fastställda tidplaner, vilket har lett till att vår kund nu befinner sig i en förändrad situation. Deras program för teknisk förvaltning planeras att tas i drift i november 2024. Därför omfattar uppdraget att: Säkerställa att kalkylverktyget samspelar med data från programmet. Säkerställa att data hanteras korrekt i kalkylverktyget. Säkerställa att utdata är tillfredsställande. Möjliggöra att den utdata som efterfrågas från olika plattformar görs tillgänglig. Uppdraget innebär att säkerställa implementationen av Logex Costing hos vår kund, med minst bibehållen funktionalitet. Detta omfattar bland annat: Teknisk installation. Sätta modeller för kalkylering avseende KPP (Kostnad Per Patient) och diagnostik (stödjande roll). Rigga datainläsningar från cirka 25 källor, inklusive kontroller. Implementera säkerhetshöjande åtgärder (skydda information, efterleva PDL). Genomlysning av rutiner, arbetssätt och förvaltning (stödjande roll). Utföra tester. Genomföra utbildning. Säkerställa utdata och rapportskapande (stödjande roll). Avveckla nuvarande applikationer. Obligatoriska kvalifikationer: Minst 5 års erfarenhet som projektledare för komplexa digitaliseringsprojekt. Erfarenhet av projekt inom uppsättning av modeller för kalkylering av kostnad per patient (KPP). Mycket god erfarenhet av att leda virtuella kompetensteam. Mycket god förmåga att dokumentera och presentera på både svenska och engelska. Förmåga att trivas i en drivande roll och arbeta självständigt. Svenskt medborgarskap, för att vid behov kunna säkerhetsklassas. Meriterande kvalifikationer: Mycket goda kunskaper om agila arbetssätt. Erfarenhet av projekt inom hälso- och sjukvårdssektorn. Erfarenhet av projekt där en extern leverantör vidareutvecklar produkten inom en agil förvaltningsorganisation, gärna enligt ramverket SAFe. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71628-tekniska-specialister-2/",
    "roles": [
      "Teknisk specialist"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu engagerade och tekniskt skickliga tekniker med erfarenhet av telekomsystem för att stärka deras produktteam. Huvudsakliga ansvarsområden: Som tekniker i produktteamet kommer du att: Spela en central roll i etableringen av kundens 5G-nät. Vara delaktig i implementeringen av pilot- och labbmiljöer samt implementering på verksamhetskritiska platser, såsom sjukhus. Bidra till utveckling av ny kompetens och arbetssätt för att säkerställa optimal nätverksprestanda. Säkerställa att lösningar och arbetsmetoder följer riktlinjer och mål från Enterprise-arkitekturen (EA). Obligatoriska kvalifikationer: Relevant högskoleutbildning, exempelvis kandidatexamen i datavetenskap eller systemutveckling, alternativt motsvarande certifikat och arbetslivserfarenhet. Förmåga att uttrycka dig väl i tal och skrift på svenska och engelska. Erfarenhet av att följa leverantörsrekommendationer för att optimera nätverkets prestanda. Djup kunskap inom något av följande områden: 1. Datakommunikation: Konfiguration, implementering och felsökning av routing, switching och brandväggar. Nätverksdesign. Quality of Service (QoS). 2. Kärnnätskompetens: Erfarenhet inom 4G/5G med fokus på &#8221;user-plane&#8221; (SGW/PGW och/eller SMF/UPF). Kunskap om 3GPP-kärnnätsleverantörers lösningar, särskilt gällande &#8221;user-plane&#8221;-funktioner (PGW/UPF och SGW/SMF för sessionhantering). Förståelse för APN/DNN och &#8221;network slicing&#8221; i 5G. Erfarenhet av trafikflödeshantering och QoS-profiler. Erfarenhet av privata 5G-nät. 3. Serverkunskap: Virtualisering. Linux. Felsökning. Linux nätverkshantering, inklusive användning av avancerade diagnostiska verktyg som WireShark, tcpdump och netcat. Routing och segmentering. 4. Radionät: Kunskap inom radionät för LTE/5G/Wi-Fi. Meriterande kvalifikationer: Erfarenhet av övervakning och hantering av radiobasstationer, radioenheter, radioantenner och nätverksflöden för att säkerställa hög prestanda. Erfarenhet av att identifiera och åtgärda nätverksproblem för att minimera driftstörningar. Erfarenhet av arbete i en stor organisation. Erfarenhet av arbete hos en telekomoperatör eller leverantör. Dokumenterad erfarenhet av att implementera komplicerad infrastruktur."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71625-tekniska-specialister/",
    "roles": [
      "Teknisk specialist"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning Vi söker nu Tekniska Specialister för kunds räkning. Du kommer att vara en del av kundens team inom teknisk förvaltning och stärka deras arbete med att stabilisera och drifta ett nytt journalsystem. Systemet bygger på Windows Server, Linux och Oracle-databaser, och målet är att säkerställa en autonom och stabil miljö med hög tillgänglighet. Programmet befinner sig i en dynamisk design- och dokumentationsfas, och du förväntas aktivt följa nya krav och behov för att stödja framtida implementering, drift och förvaltning. Det är också viktigt att du har insikt i det teknikskifte som pågår och kan anpassa dig till de förändringar detta medför. Huvudsakliga ansvarsområden: Bidra med teknisk expertis för att säkerställa stabil drift av journalsystemet. Arbeta med Windows Server, Linux och Oracle-databaser för att upprätthålla systemets funktion och tillgänglighet. Samarbeta med teamet för att utveckla och dokumentera tekniska lösningar som stöder både implementering och framtida förvaltning. Följa och implementera nya behov och krav under systemets införande. Bidra till att säkerställa en stabil och autonom miljö för kundens journalsystem. Obligatoriska kvalifikationer: Minst 3 års erfarenhet av Linux. Minst 5 års erfarenhet av Windows Server. Minst 2 års erfarenhet av MS SQL. Flytande i svenska, både i tal och skrift. Behärska teknisk engelska i både tal och skrift. Förmåga att dokumentera och skapa Standard Operations på svenska."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71489-system-designer-6/",
    "roles": [
      "System Designer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning Vår kund inom fordonsindustrin söker nu dig som System Designer för att ansluta sig till deras iTeam Detachment B (Basetech Support &amp; Taskforce), där de hanterar SPA3-projekt med fokus på bastekniska krav, testning och tekniska lösningar. Som den viktiga länken mellan Basetech och intressenter kommer du att stödja alla aspekter av kravförståelse och förbättring genom effektiv kommunikation. Vi söker dig som har möjlighet att arbeta onsite i vår kunds lokaler i Göteborg. Uppdraget är långsiktigt och erbjuder goda utvecklingsmöjligheter. Om Detachment B och arbetsmiljön På Detachment B värdesätter de frihet under ansvar och säkerställer högkvalitativt arbete genom grundlig dokumentation. Du kommer att få möjlighet att arbeta med innovativa projekt, såsom interna AI-integrationsinitiativ, som syftar till att förbättra stödet för deras intressenter. Denna roll ger dig möjlighet att utveckla dina generalistkunskaper samtidigt som du specialiserar dig inom specifika teknikområden, vilket gör en verklig skillnad i en stor organisation. Detachment B går nu in i den andra fasen av sitt banbrytande projekt. Att arbeta på plats kommer att ge dig exceptionella möjligheter för introduktion, samarbete och professionell utveckling. Huvudsakliga ansvarsområden: En typisk dag kan inkludera följande ansvarsområden: Granska hårdvaru- eller basmjukvarubegränsningar Samla in och analysera feedback från intressenter för framtida förbättringar Säkerställa att all nödvändig dokumentation är uppdaterad och korrekt Driva samarbete och dialog kring projektmognad och systemkrav Deltaga i möten och bidra med tydlighet och stöd i diskussioner om systemövergripande krav Kvalifikationer: Förståelse för teknologier som CAN, Ethernet, LIN, Diagnos, Software Download och Cyber Security ifrån: Erfarenhet inom teknologier som CAN, Ethernet, LIN, Diagnos (gärna med kunskap om SAE J2012), Software Download (R156) och Cyber Security (R155) Djupgående teknisk kunskap inom automotive Erfarenhet av SystemWeaver är ett plus, men inget krav. Har du dessutom arbetat med mjukvarukalibrering (SWCAL)? Perfekt – vi vill gärna prata med dig! Personliga egenskaper: En praktisk inställning – en doer Är du en passionerad ingenjör med en &#8221;doer&#8221;-mentalitet, ivrig att göra skillnad? Då vill vi höra från dig! Gå med i vår kunds dynamiska team och var med och forma framtiden tillsammans!"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71471-system-safety-leader/",
    "roles": [
      "System Safety"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a System Safety Leader. The role involves creating, fostering, and sustaining system safety processes, methods, tools, and training within their global Engineering organization. You will ensure conformance with ISO 26262 &amp; ISO 21448 standards and provide expert support to various teams regarding system safety processes. Additionally, you will conduct confirmation reviews of system safety work products. As part of the System Safety Competence Center (SSCC), you will work alongside a team of System Safety Leaders (SSLs) to achieve long-term goals, ensuring the client&#8217;s capability to deliver safe products within the system safety domain. The scope includes Functional Safety (FuSa) and Safety of the Intended Functionality (SOTIF), both essential to developing safe vehicles. Functional Safety focuses on handling safety issues caused by systematic and random faults in electrical/electronic hardware and software. SOTIF focuses on achieving safe functional behavior, addressing nominal performance, and technical limitations in electrical/electronic hardware and software. Main Responsibilities: Drive the implementation of ISO 26262 &amp; ISO 21448 system safety processes across the organization. Develop and maintain system safety methods, tools, and best practices. Conduct awareness and training sessions to enhance the organization&#8217;s understanding of system safety, principles, standards, and methodologies. Provide expert support and guidance on system safety processes to various departments, including engineers and managers. Perform confirmation reviews of system safety work products to ensure compliance with ISO 26262. Collaborate with cross-functional teams to integrate safety processes into product development. Stay up to date with industry trends and advancements in system safety and international standards. Foster a strong System Safety Culture within the Engineering team by sharing experiences in the internal Community of Practice. Qualifications: M.Sc. in Controls and Mechatronics, Electrical/Electronic, or Computer Science Engineering (advanced degree preferred). Strong knowledge of relevant technical domains (e.g., brake systems, steering systems). Expertise in systems engineering, including embedded SW/HW in the automotive domain. Deep understanding of system safety engineering practices, safety standards, and product safety. Extensive knowledge of automotive system safety standards, particularly ISO 26262 and ISO 21448. Experience with risk assessment and analysis methodologies: HARA, FTA, FMEDA, and FMEA. Proficiency in methods, tools, and processes for Functional Safety and SOTIF. Fluency in English, both written and spoken. Desired Attributes: Flexible, enthusiastic, methodical, and analytical with high professional integrity. Self-motivated with the ability to drive initiatives. Excellent collaboration and communication skills. Ability to work effectively with cross-functional teams."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71461-full-stack-developer-javascript-2/",
    "roles": [
      "Developer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Full Stack Developer (JavaScript) with DevOps experience for Continuous Integration (CI) applications. Our client believes that curiosity and a deep commitment to understanding people are key to future success. They work together to create technologies and innovations for safe, sustainable, and convenient mobility. The digital future is being developed with a human-centric mindset, using Agile/DevOps practices. This role is part of the Continuous Integration Infrastructure team, which develops CI tools for the pipeline, one of the largest software automation chains in Sweden, connecting complete vehicle systems to software applications. As a developer and DevOps engineer, you will be responsible for moving requirements from review to production while working with code reviews and architecture planning to ensure high quality and quick changes. Main Responsibilities: Work as a SW developer in an agile, cross-functional team focused on implementing the CI-pipeline. Perform software design, development, testing, and end-user documentation. Build user experiences using frontend technologies and support end users. Collaborate with top DevOps experts on a team skilled in JavaScript, Node.js, React, Python, Bash, and software architecture. Participate in all stages of development, from requirements gathering to production code deployment. Contribute to DevOps practices, building innovative products and services that deliver customer value. Collaborate with the team to manage and develop the CI pipeline, combining and developing various tools. Take ownership of Visualization tools for the CI pipeline, infrastructure management, and software baselines. Required Qualifications: Proficiency in both backend and frontend development, with a strong background in JavaScript (minimum 5 years working experience with ES5 or later). Strong experience with CI/CD systems and software development. Experience writing and appreciating the value of tests. Expertise in the following technologies: JavaScript Node.js React Next.js Python MongoDB Linux Gerrit Docker Kubernetes Shell scripting (Bash) Cloud infrastructure (preferably Azure) Additional Qualifications: Experience with RabbitMQ, Redis, Git, GitOps tools (e.g., Flux CD or Argo CD), Kubernetes, and Infrastructure as Code (IaC) tools such as Ansible, Terraform, or Pulumi. At least 4+ years of documented experience working within IT as a developer. Previous experience working with requirements and direct client contact. Experience with data analytics tools. A solid understanding of the Agile development process. Familiarity with DevOps methodologies and CI/CD development. Desired Attributes: Curiosity and open-mindedness toward new technology and programming languages. Continual striving to develop skillsets by networking internally and externally. Willingness to develop a T-shaped profile by expanding knowledge in multiple specializations. Understanding of Agile team principles and ceremonies. Interest in the user journey and understanding user needs for the product team&#8217;s outcomes. Ability to network with stakeholders when necessary for technical elicitation. Outgoing, easy to communicate with, and patient. Self-motivated and proactive in initiating contact with new people."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71413-databasadministrator-db2/",
    "roles": [
      "Database Administration"
    ],
    "places": [
      "Distans",
      "Sundsvall"
    ],
    "description": [
      "Uppdragsbeskrivning På kunds räkning söker vi nu en databasadministratör. Uppdraget består av att designa, implementera, drifta och förvalta Db2-databaser. Du kommer att ingå och utföra arbetsuppgifter i ett databasteam samt är resurs i utvecklingsteam i ett eller flera parallella projekt. SKA-krav: Det är viktigt att du har aktuella kunskaper, så respektive kompetens och erfarenhet som finns listad nedan ska åtminstone delvis vara förvärvad under de senaste 7 åren. Du ska ha kompetens inom databashantering och databasdesign, samt god förståelse för prestandakonsekvenser. Du ska ha minst 3 års erfarenhet av uppdrag som DBA inom relationsdatabaser på Unix/Linux-plattform Du ska ha minst 2 års erfarenhet av att designa logiska och fysiska databaser med hjälp av Power Designer eller motsvarande BÖR-Krav: Arbete som DBA inom DB2 på Unix/Linux-plattform helst mer än 7 år Övrigt: Beredskap Beredskap sker för närvarande med max 7 ggr/4 veckor. Du ska kunna inställa sig på arbetsplatsen inom en timme. Detta kan dock förändras under kontraktets löptid. Övertidsersättning vardagar: Övertid vardagar mellan 06:00 – 08:00 utgår ersättning med avtalat timarvode + 50 % Övertid vardagar mellan 16:30 – 22:00 utgår ersättning med avtalat timarvode + 50 % Övertid vardagar mellan 22:00 – 06:00 utgår ersättning med avtalat timarvode + 100 % För övertid lördag, söndag eller annan helgdag utgår ersättning med avtalat timarvode + 100 % Du ska vara på plats i kundens lokaler i Sundsvall i cirka 2 veckor under uppdragsstarten. Efter det kan uppdraget utföras på distans efter överenskommelse. Delar av uppdraget kan behöva genomföras i Sundsvall, uppskattningsvis en (1) gång i månaden."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71399-business-analyst-product-owner/",
    "roles": [
      "Business Analyst",
      "Product Owner",
      "Produktägare"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning På kunds räkning söker vi nu en Business Analyst/Product Owner. Du ska ha god kännedom om affärs- och verksamhetsprocesser samt systemstöd inom detaljhandeln, utifrån ett liknande uppdrag. Tidigare erfarenhet av planeringssystem för optimering är ett måste. Det är ett relativt litet team bestående av konsulter baserade i Grekland, samt en kollega i Stockholm som arbetar som systemingenjör och ansvarar för den tekniska samordningen. Arbetsuppgifter: Du ska hålla ihop roadmap och säkerställa att verksamhetsbehoven översätts till tekniska krav. Du ska kunna hålla ihop helheten, driva kommunikationen och se till att både verksamhet och teknik arbetar mot samma mål. Kvalifikationer: Du ska ha god samarbetsförmåga och van vid många kontaktytor där man på ett naturligt sätt kan diskutera frågeställningar både med tekniska specialister och personer från verksamheten utan teknikkunskap. Du ska vara en positiv, drivande och ansvarstagande person som är van att arbeta självständigt och målorienterat. Du har på ett naturligt sätt förmågan att se förbättringsmöjligheter och behov i verksamheten samt kan balansera kortsiktiga behov med långsiktighet och stabilitet. Du har god förståelse gällande processer och utmaningarna inom detaljhandel och då speciellt inom sortimentsstyrning. Du har vana från att verka mellan verksamhetsprocesser och hur IT kan användas för att stödja dessa. Du har förmåga till helhetssyn i ett kombinerat kort- och långsiktigt perspektiv. Du har vana från att arbeta med kravhantering och agila arbetssätt. Du har god förståelse av projekt- och implementations metodik. Du har vana av att arbeta med förändringar i en stor och komplex lösning och organisation. Det är viktigt att du har en god förmåga att koordinera och strukturera arbetet. &nbsp; Det finns också en möjlighet att uppdraget kan komma att förlängas beroende på framtida behov."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71371-genomlysning-av-hr-arbetet-i-sundbybergs-stad/",
    "roles": [
      "Organisationskonsult"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning Sundbybergs stad avser att genomföra en genomlysning av HR-avdelningen med syfte att identifiera förbättringsområden och ge rekommendationer för att effektivisera och utveckla HR-arbetet. Den externa konsultens uppdrag är att utvärdera nuläget, analysera nuvarande processer, arbetssätt och dokumentation, samt presentera slutsatser och konkreta åtgärdsförslag. Sundbybergs stad strävar efter att utveckla en välfungerande och strategiskt styrd HR- funktion som kan stödja stadens övergripande mål och långsiktiga strategi. Genomlysningen ska lägga grunden för att utveckla en tydligare strategisk styrning, effektivare arbetsformer och ett mer proaktivt stöd från HR till stadens olika verksamheter. Syftet med genomlysningen är att: • Kartlägga och utvärdera nuläget: organisering, arbetssätt, ledning, arbetsprocesser, styrdokument • Identifiera förbättringsområden och föreslå åtgärder i syfte att säkerställa att HR arbetar strategiskt, effektivt och proaktivt tillsammans med stadens olika verksamheter. Att säkerställa efterlevnad av lagkrav som arbetsgivare (utvecklingsarbetet ska bidra till att Sundbybergs stad uppfattas som en attraktiv arbetsgivare). Uppdraget uppskattas till 100 timmar, Sundbybergs stad garanterar inga volymer. Möjlighet till förlängning: Ja, 1 + 1 månad enligt överenskommelse. Konsulten ska utföra följande arbetsmoment: • Kartlägga nuläget inom HR-funktionen genom dokumentanalys, djupintervjuer och workshops. • Analysera nuvarande styrdokument, processer och rutiner inom HR. • Utforska och identifiera den önskade utvecklingsinriktningen för HR-arbetet. • Presentera en rapport med slutsatser och rekommendationer, inklusive konkreta åtgärder för hur HR-avdelningen kan utvecklas. Rekommendationerna ska omfatta områden som: • Roller, ansvar och mandat. • Processer och arbetsmetoder för rekrytering, personalutveckling, och strategisk kompetensförsörjning, osv. • Stöd till sektorer och avdelningar samt kommunledning. Den upphandlade konsulten förväntas använda en arbetsmetod som inkluderar: • Dokumentgranskning av HR-relaterade policys, riktlinjer och processer. • Intervjuer och enkäter med HR-personal samt representanter från andra sektorer. • Workshops med nyckelpersoner för att identifiera nuläge och önskad framtida utveckling. • Rapportering med sammanfattning av nuläget och förslag på förbättringsåtgärder. Krav på leverans Konsulten ska leverera följande: • En rapport som sammanfattar nuläget, identifierade utvecklingsområden och rekommendationer för förbättring av HR-arbetet i staden. • Konkreta förslag till åtgärder och en handlingsplan för implementering. • Eventuellt stöd i implementeringen av rekommendationerna, efter överenskommelse. Förväntat resultat Syftet med genomlysningen är att få ett underlag som beskriver nuläge och ger rekommendationer som leder till att Sundbybergs stad får en effektivare, mer proaktiv och bättre samordnad HR-funktion. Projektorganisation Konsulten rapporterar till Biträdande Stadsdirektör. Uppdraget ska genomföras i nära samarbete med HR-avdelningen och ledningen för SLS. Krav på dokumentation Konsulten ska leverera följande: • En rapport som sammanfattar nuläget, identifierade utvecklingsområden och rekommendationer för organisering av HR-arbetet i staden. • Konkreta förslag till åtgärder och en handlingsplan för implementering. • Eventuellt stöd i implementeringen av rekommendationerna, efter överenskommelse. Staden kan komma att vilja intervjua kandidater. Följande tider är då i första hand aktuella: • 16/10 kl.13.00-14.00 • 17/10 kl.13.00-14.00 • 21/10 kl.14.30-15.30 • 22/10 mellan kl.13.00-15.30 • 24/10 kl.14.00-15.00 • 30/10 mellan kl.13.0-15.00 Handlingar som ska ingå i offert: &#8211; CV &#8211; Referensförteckning &#8211; Genomförandeplan &#8211; Tidplan &#8211; Pris Skallkrav Dokumenterad erfarenhet av liknande uppdrag, med fokus på HR-genomlysning och strategisk utveckling God kännedom om offentliga sektorns förutsättningar för ett strategiskt [&hellip;]"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71278-it-samordnare/",
    "roles": [
      "Samordnare"
    ],
    "places": [
      "Sundsvall"
    ],
    "description": [
      "Uppdragsbeskrivning På kunds räkning söker vi nu efter in IT-samordnare för applikationsdrift Windows med inriktning mot Sharepoint och AMY:er (anslutande myndigheter). Rollbeskrivning: Leverans ansvarig för tjänster inom sharepoint. Ett leveransansvar för driftsatta IT-tjänster inom applikationsdrift AMY. Säkerställa att systemen levereras utifrån avtalade SLA:er. Ekonomi: budget, prognos, prissättning där debitering sker mot AMY. Framtagning av förvaltningsplaner och utvecklingsplaner inklusive ekonomiska kalkyler. Ekonomisk kostnadsfördelning via TBM (Technology Business Management). Avtalshantering: externa avtal med leverantörer och anslutande myndigheter. Löpande arbete utifrån definierade ITIL-processer. Planering och dokumentation sker via Jira och Confluence Uppdraget kan även innefatta aktivitetsledning och projektledning. SKA-krav Du ska ha vana av förvaltning och utvecklingsplaner kring sharepoint plattform – gäller på On preem installation. Myndighetssamverkan med andra myndigheter –styrning och ledning. Ekonomi (budget, prognos, prissättning där debitering sker), Du ska ha vana av kostnadsfördelning utifrån TBM:s ramverk (Technology Business Management)inom statlig verksamhet. Du ska ha vana av framtagning av förvaltningsplaner/färdplaner inklusive ekonomiska kalkyler. Du ska ha vana av avtalshantering med externa leverantörer och samverkande myndigheter. Löpande arbete utifrån definierade ITIL-processer Du ska ha vana av planering och dokumentation via Jira och confluence. Du ska ha erfarenhet från samverkansarbete med andra myndigheter. Med samverkan avses gemensam förvaltning/styrning och ledning. Övrigt: Beredskap Beredskap  sker för närvarande med max 7 ggr/4 veckor. Du ska kunna inställa sig på arbetsplatsen inom en timme. Detta kan dock förändras under kontraktets löptid. Övertidsersättning vardagar: Övertid vardagar mellan 06:00 – 08:00 utgår ersättning med avtalat timarvode + 50 % Övertid vardagar mellan 16:30 – 22:00 utgår ersättning med avtalat timarvode + 50 % Övertid vardagar mellan 22:00 – 06:00 utgår ersättning med avtalat timarvode + 100 % För övertid lördag, söndag eller annan helgdag utgår ersättning med avtalat timarvode + 100 %"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71268-applikationstekniker/",
    "roles": [
      "Application Engineer",
      "Tekniker"
    ],
    "places": [
      "Sundsvall"
    ],
    "description": [
      "Uppdragsbeskrivning På kunds räkning söker vi nu en applikations driftstekniker inomWindows och Linux. Uppdraget är delat up i två delar; Del 1: 50% av uppdraget förutsätter teknisk kompetens omWindows operativsystem samt erfarenhet från applikatorisk drift och underhåll i Windows server miljö. Du ska ha kunskap om administrativa stödsystem som tex EESSI/RINA (ettsystem som tillhandahålls via EU) och stöder handläggning mellan EU-anslutna länder. Del 2: 50% av uppdraget förutsätter även teknisk kompetens inom containerplattform, Linux och opensource. Arbetet som applikations driftstekniker innebär både slut användarkontakter samt intern problemlösning och felsökning i olika team konstellationer. Allt arbete sker utifrån ITIL:s ramverk och dess processer. SKA-krav: Du ska ha minst (2) års erfarenhet av arbete som applikations driftstekniker EESSI/RINA och WindowsServer. Du ska ha minst (2) års erfarenhet av opensource applikationen RODA på Linux och container plattform. Du ska minst (2) års erfarenhet av myndighetssamverkan. Du ska ha minst (2) års erfarenhet av arbete med kvalitetssäkring av tekniska leveranser från externa leverantörer. Kvalitetssäkring av leveranser ska ha gjorts tillsammans med samverkande myndighet/myndigheter för att säkerställa ett enhetligt IT-stöd anpassat till respektive myndighets verksamhetsprocesser. Du ska ha minst (2) års erfarenhet av samverkan med andra myndigheter. Med samverkan avses gemensam förvaltning/styrning och ledning. Du ska ha minst (2) års erfarenhet av kvalitetssäkring av leveranser ska ha gjorts tillsammans med samverkande myndighet/myndigheter för att säkerställa ett enhetligt IT-stöd anpassat till respektive myndighets verksamhetsprocesser. Bör-krav: Du bör ha jobbat med ITIL Du bör ha jobbat med scripting , Bash, python eller liknande. Du kommer initialt arbeta från vår kunds lokaler i Sundsvall, distans är möjligt när verksamheten tillåter."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71255-projektledare-uppdragsledare-2/",
    "roles": [
      "Project Leader",
      "Projektledare"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning På kunds räkning söker vi nu en erfaren Projektledare/Uppdragsledare för att leda och koordinera arbetet kring kravinsamling, utvärdering och upphandling av en teknisk tjänst. Du kommer att arbeta nära vår kunds affärsverksamheter för att samla in och dokumentera deras krav, samt utforma ett förslag till hur lösningen skall styras och förvaltas. Den samlade kravmassan blir ett underlag för beslut om vidare upphandling. Ansvarsområden: Leda och koordinera projektet för kravinsamling, utvärdering och upphandling av en teknisk tjänst. Samarbeta med vår kunds affärsverksamheter för att förstå och dokumentera deras krav och behov. Genomföra utvärdering av nuvarande leverantör samt genomföra en översiktlig marknadsundersökning av motsvarande lösningar och leverantörer. Säkerställa att alla projektaktiviteter följer interna riktlinjer och externa regelverk. Förbereda upphandlingsprocessen. Rapportera till styrgrupp och andra intressenter. Identifiera och hantera risker och problem. Kvalifikationer: Du ska ha minst 5 års erfarenhet av projektledning, gärna inom IT eller tekniska tjänster. Du ska ha dokumenterad erfarenhet av kravinsamling och att arbeta nära affärsverksamheter. Du ska ha erfarenhet av att leda inköpsprocesser och förhandla kontrakt. Du har en stark analytisk förmåga och erfarenhet av att utvärdera tekniska lösningar. Du har utmärkta kommunikations- och samarbetsförmågor. Du har förmåga att arbeta självständigt och ta egna initiativ. Du har goda kunskaper i svenska och engelska, både i tal och skrift. Personliga egenskaper: Du är strukturerad och organiserad med förmåga att hantera flera parallella uppgifter. Du är lösningsorienterad och proaktiv. Du har en stark förmåga att bygga relationer och samarbeta med olika intressenter. Du är flexibel och anpassningsbar i en föränderlig miljö. Du kommer att arbeta på plats i vår kunds lokaler i Stockholm, med möjlighet till flexibilitet efter dialog med vår kund."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71160-senior-e2e-testare-for-skanetrafiken-serviceresor-region-skane-avrop-942/",
    "roles": [
      "Testare"
    ],
    "places": [
      "Malmö"
    ],
    "description": [
      "Uppdragsbeskrivning Skånetrafiken bedriver ett IT-program vid namn Pandora. Resultatet av projektet ska leda till ett nytt systemstöd för Affärsområde Serviceresor. Flera moment som idag görs manuellt kommer nu istället att utföras med hjälp av det nya systemstödet. Detta gäller ett stort antal funktioner för medarbetare inom förvaltningen, för användare inom vården hos både region och kommun, men även hos kunder och de företag som kör färdtjänst och sjukresa. Nu letar vi efter en senior testare för att gå med i vårt team av roliga, samarbetsvilliga och skickliga kollegor. I rollen som testare kommer du att vara ansvarig för att självständigt definiera och utföra manuella tester i systemet. Du kommer att jobba nära utvecklingsteam, testledare, kravställare, arkitekt och produktägare vilket ställer höga krav på god samarbetsförmåga. Du ska kunna rapportera och kommunicera teststatus på ett strukturerat sätt. Önskad kompetens: Självgående, driven och flexibel testare Dokumenterad erfarenhet av integration och testning på E2E-nivå Förståelse och erfarenhet av olika testnivåer och testtekniker Du ska tidigare ha arbetat med Azure DevOps eller liknande verktyg Förmåga att samarbeta med flera olika roller i en organisation &nbsp; Tillhör kategori: testare Arbetet utgår från Skånetrafikens kontor på Malmö C. Rollen har som utgångspunkt att man arbetar från kontoret 100%. Resor till Hässleholm kan förekomma. Möjlighet till förlängning finns. &nbsp;"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71089-senior-design-lead/",
    "roles": [
      "Design Lead"
    ],
    "places": [
      "Norge"
    ],
    "description": [
      "Oppdragsbeskrivelse For vår kunde søker vi nå en senior Design Lead til team bestillingstransport i app. Design lead vil kunne jobbe både i app-teamet for bestillingstransport, men også med andre deler av appen ved behov. Team Bestillingstransport utvikler et produkt som lar kunder bestille en reise når de har et behov, fra der de ønsker- til dit de skal. Teamet jobber sammen med eierne mot en visjon om å redusere behovet for personbil 1 og 2, og skape et mer bilfritt bysentrum.  Om rollen og arbeidsoppgaver: Drive iterative designprosesser fra konsept til implementering i tilhørende produktteam Samle og analysere brukerbehov og markedsinnsikt for å informere designbeslutninger Samarbeide tett med produktledere, utviklere og andre interessenter for å sikre at designet møter forretnings- og brukerbehov Designe i tråd med designprinsipper og sikre høy kvalitet på universell utforming og tilgjengelighet Utføre prototyping og brukertesting for å validere designløsninger Jobbe iterativt og tverrfaglig med produktutviklingsteamet for å skape løsninger som forbedrer kundenes hverdag og møter virksomhetens behov. Bidra aktivt til kunnskapsdeling MÅ-Krav: Minst 5 års erfaring som design lead etter endt utdanning, og høyere utdanning innen et relevant designfelt. Minst 3 års erfaring som designer med native apper (iOS og Android). Minst 5 års erfaring med Figma, designsystem og planleggingsverktøy (Jira eller lignende). Du må kunne kommunisere effektivt på norsk, både skriftlig og muntlig. Minimum språkkrav er nivå B2 i henhold til Det felles europeiske rammeverket for språk"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71025-operational-technolgy/",
    "roles": [
      "Operational Technology"
    ],
    "places": [
      "Tomelilla"
    ],
    "description": [
      "Uppdragsbeskrivning: För kunds räkning söker vi nu en underkonsult med specialkompetens inom OT (Operational Technology) för att bistå ett kommunalt driftbolag inom vatten och avlopp (VA) med att granska och säkerställa att deras nya OT-design uppfyller kraven enligt NIS2-direktivet. Uppdraget innefattar även att säkerställa att designen möter de krav som Livsmedelsverket ställer på kommunala VA-bolag. Uppdraget kommer innebära vissa arbetsmoment på plats hos kundens lokaler kombinerat med arbete remote. Arbetsuppgifter: Granskning av OT-design utifrån ett säkerhets- och complianceperspektiv Identifiera eventuella brister eller riskområden i förhållande till NIS2-krav och Livsmedelsverkets riktlinjer för VA verksamhet Utarbeta förslag på förbättringar och säkerhetsåtgärder Arbeta nära vårt interna team som hanterar övergripande NIS2-krav och informationssäkerhetsledningssystem Delta i workshops och möten med VA-bolaget för att presentera fynd och rekommendationer Kompetenskrav: Erfarenhet av arbete med OT-system, särskilt inom vatten- och avloppssektorn Djup förståelse för SCADA-system, PLC-teknik och industriella kontrollsystem inom VA Erfarenhet av att designa, implementera och underhålla OT-nätverk Kännedom om Livsmedelsverkets krav och riktlinjer för kommunala VA-bolag &nbsp;"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71043-test-engineer-ad-adas-track-testing/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client is currently seeking a Test Engineer to join their AD/ADAS track testing team. Our client follows a people-centric philosophy with a mission to provide personal, sustainable, and safe mobility solutions. Their commitment includes simplifying customers&#8217; lives through advanced technologies, enhancing global impact while protecting both individuals and their communities, fostering a diverse, inclusive, and collaborative work environment, and encouraging talent development to help employees reach their full potential. You will be part of a journey focused on creating future innovations in safety, autonomous driving, and electrification. The company believes that being curious and truly committed to understanding people is the key to future success. They care about others and work together to create new technologies and innovations for safe, sustainable, and convenient mobility. Vehicle &amp; Rig Testing Group The Vehicle &amp; Rig Testing group performs objective verification and validation activities according to customer requirements in the following areas: Driverless systems AD (Autonomous Drive) ADAS (Advanced Driver Assistance System) V2X (Vehicle to Everything) Chassis objective testing (Vehicle dynamics and Clearance) The activities are performed both in rigs and on the test track. During the winter season, they support expeditions at tracks in southern Europe and northern Sweden. With state-of-the-art test equipment, they ensure durability, comfort, performance, reliability, and safety in vehicles through verification and certification activities. Main Responsibilities: As a Test Engineer, you will: Plan, prepare, and carry out tests on the test track Have technical, operational, and safety responsibility for the test setup and procedure, including rigs and equipment Improve and maintain test equipment to meet current and new testing standards Collaborate with stakeholders in developing new test methods Develop test equipment and digital tools, often working with other companies and universities In this role, you will use state-of-the-art equipment like driverless steering robots and self-propelling soft targets to develop world-leading vehicle functions. You will be part of a highly skilled team and have the opportunity to: Develop and lead new test methods, systems, and components Participate in research and investment projects Continuously work on advancing AD, ADAS, and V2X functionality Qualifications: M.Sc. or B.Sc. in Mechatronics, Electronics, or a related field Good skills in Electronics, Control, and Automation Experience in programming (Python preferred, C and C++ are meritorious) Fluency in English (spoken and written) Swedish driving license (B) Additional Qualifications: Knowledge of measurements and signal processing (e.g., Vector tools like CANalyzer, CANoe, CAPL) Familiarity with communication networks such as LIN, CAN, Ethernet, SOME/IP Experience working with hardware and/or measurement equipment Experience in AD (autonomous drive) and V2X systems You should enjoy working with hardware, ensuring measurement accuracy, and troubleshooting technical issues during testing, sometimes under time pressure. Desired Attributes: Team-oriented and innovative Positive and proactive in your approach Structured and well-organized, with a focus on quality and customer satisfaction"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71024-ad-adas-function-design-engineer/",
    "roles": [
      "Design Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking an AD/ADAS Function Design Engineer. Our client is focused on putting people first, aiming to provide freedom of movement in a personal, sustainable, and safe manner. They are dedicated to simplifying customers&#8217; lives through advanced technology solutions that enhance global impact and offer innovative mobility options for safety. With ambitious goals in innovation, safety, and electrification, the client seeks passionate individuals to shape the future of mobility. They are redefining car ownership by integrating advanced technologies and services to create safe, sustainable, and connected vehicles. The client values people and is committed to helping them reach their full potential. Main Responsibilities: In the AD and ADAS Functions department, you will: Design and verify the complete vehicle solution for autonomous cars and active safety functions. Work with a team of committed and experienced individuals in the Human-Centric AD/ADAS group. Collaborate in an open and safe environment to create meaningful innovations. Drive development in line with strategic goals, defining functional requirements and using data for insights to enhance the customer experience. Apply your experience and competence to define robust function designs while contributing innovative ideas. Define test methods and perform function testing, tuning, and analysis using various test environments (vehicles, HIL, SIL). Work closely with software suppliers and interfacing teams to ensure a human-centric AD/ADAS experience. Take ownership of features like: Road Sign Information Driver Alert Connected Safety Qualifications: Experience in function/system design and/or test and verification, preferably from the AD/ADAS domain. Eagerness to use data-driven insights to inform development. Desired Attributes: Detail-oriented with the ability to see the bigger picture. Strong initiative and sense of responsibility. A love for learning and a desire to share knowledge with others. Curiosity and passion for technology and vehicles. Willingness to help out with tasks beyond your immediate expertise. Experienced driver with a passion for vehicles."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71017-software-developer-18/",
    "roles": [
      "Developer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is seeking a passionate and driven developer skilled in Snowflake architecture, integrations, and the C# &amp; .NET framework. You will join the Energy Efficiency &amp; Weight Digital team within Engineering at our client&#8217;s organization, where a new sub-team will be set up to manage the Battery Passport. The Energy Efficiency &amp; Weight team delivers digital solutions that support automotive sustainability innovations, ensuring all vehicles comply with market regulations and legislation. The team utilizes modern tools and agile methods to continuously create business value while maintaining high quality and adaptability in their delivery. Collaboration and having fun as a team is an essential part of their culture. Our client is focused on transforming traditional car manufacturing by embracing, connectivity, sustainability an innovation. Known for its commitment to safety, the company has introduced new car generations and technologies while achieving steady growth with record sales. As our client expands globally, they seek talented and innovative individuals to help revolutionize the automobile industry. The company values its people, supports their development, and invites them to join its mission of creating safe, sustainable, and connected vehicles for the future. Main Responsibilities: As part of a small, cross-functional, and empowered team, you will: Contribute to all stages of the development process, from requirements gathering to code deployment. Work both independently and in a team to develop solutions. Build new solutions and integrate data from existing applications and other data sources within the Snowflake architecture. Develop modern digital solutions while enhancing and maintaining existing ones. Qualifications: You are an experienced software engineer with: A passion for crafting clean code. Experience with modern infrastructure and tools. Comfort collaborating directly with end-users when developing new functions and features. Experience working with the Snowflake architecture and system integrations. Proficiency in .NET, C#, React, Azure cloud services, and Git. Strong knowledge of relational and analytical databases like OLAP systems. Good understanding of data modeling best practices for transactional and analytical use cases. A solid understanding of Continuous Delivery (CD), automated testing, and DevOps principles. Experience with containerization technologies such as Docker. Desired Attributes: A genuine drive to solve problems with a servant leadership mindset. Passion for keeping up with current best practices and sound engineering principles like Continuous Delivery. Emphasis on automated testing to ensure production-ready code every day. We are looking forward to your application!"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70996-2-x-senior-software-engineer-region-skane-avrop-947/",
    "roles": [
      "Software Engineer"
    ],
    "places": [
      "Lund"
    ],
    "description": [
      "Uppdragsbeskrivning Region Skåne befinner sig på en spännande resa mot att bli en datadriven region. Avgörande för att utveckla vår hälso- och sjukvård inför framtiden är att stärka vår förmåga att tillvarata värdet av vår data. Genom att öka tillgängligheten till högkvalitativa data och utveckla verksamhetens kompetens att använda denna möjliggörs nya arbetssätt och metoder inom planering, forskning, resursoptimering och innovation. Därför söker vi nu en driven software engineer till vårt team av trevliga, samarbetsvilliga och kunniga kollegor som jobbar med utvecklingen av våra nya plattformar för data, API:er och AI. Vi söker dig som har en gedigen teknisk erfarenhet inom systemutveckling. Du har erfarenhet av komplexa utvecklingsprojekt, gärna open source. Du är nyfiken på att hela tiden lära dig nytt, som du gärna vill tillämpa och dela med dig av. Du är pragmatisk och har förmågan att skapa goda relationer med andra människor. Du är strukturerad, självgående och kvalitetsmedveten. Som software engineer tillhör du ett utvecklingsteam som bygger plattformar på den allra senaste tekniken inom datahantering, API:er och AI. Du arbetar tillsammans med bland annat produktägare, arkitekter, data engineers, full-stack utvecklare och testare. Arbetet innebär att: Arbeta med systemutveckling och implementation av exempelvis API:er och klassbibliotekr Supporta, förvalta och felsöka våra lösningar Delta i planering och analys av funktioner Utveckla och testa komponenter Skriva enhetstester Utveckla ci/cd pipelines Granska kod Omstrukturera kod Ge råd och stöd i tekniska designval och arkitekturfrågor Du har: Gedigen och bred erfarenhet av utveckling i .NET och C#, samt gärna fler programmeringsspråk God kunskap inom API design och utveckling God kunskap om SQL-databaser och utveckling av stored procedures God kunskap om prestandafrågor God kunskap om säkerhetsfrågor och rekommendationer från exempelvis OWASP Gedigen erfarenhet av att arbeta med Git Du har förmågan att arbeta både självständigt och i grupp Du är van vid att ta ansvar för och äga leveransen av en eller flera funktion(er) Du är mån om att leverera kvalitativa lösningar Du har erfarenhet av att arbeta agilt Meriterande: Erfarenhet av att drifta lösningar on-prem och i public cloud (Docker/Kubernetes/Azure) Certifieringar inom Docker/Kubernetes/Azure God erfarenhet av Infrastructure as Code (t.ex. Bicep eller Terraform) God kunskap om Event/Message brokers såsom exempelvis RabbitMQ, Kafka eller Azure Service Bus Goda kunskaper inom teknisk dokumentation Erfarenhet eller intresse av Data Engineering-domänen Tillhör kategori: Systemutvecklare Startdatum och omfattning är öppet för diskussion. Möjlighet finns till förlängning av uppdraget. &nbsp;"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70993-senior-full-stack-utvecklare-region-skane-avrop-946/",
    "roles": [
      "Fullstack-utvecklare"
    ],
    "places": [
      "Lund"
    ],
    "description": [
      "Uppdragsbeskrivning Region Skåne befinner sig på en spännande resa mot att bli en datadriven region. Avgörande för att utveckla vår hälso- och sjukvård inför framtiden är att stärka vår förmåga att tillvarata värdet av vår data. Genom att öka tillgängligheten till högkvalitativa data och utveckla verksamhetens kompetens att använda denna möjliggörs nya arbetssätt och metoder inom planering, forskning, resursoptimering och innovation. Därför söker vi nu en driven full-stack utvecklare till vårt team av trevliga, samarbetsvilliga och kunniga kollegor som jobbar med utvecklingen av våra nya data- och API-plattformar. Vi söker dig som har en gedigen teknisk erfarenhet inom systemutveckling. Du har erfarenhet av såväl modern webbutveckling som backend och API-utveckling. Du är nyfiken på att hela tiden lära dig nytt, som du gärna vill tillämpa och dela med dig av. Du är pragmatisk och har förmågan att skapa goda relationer med andra människor. Du är strukturerad, självgående och kvalitetsmedveten. Som full-Stack utvecklare tillhör du ett utvecklingsteam som bygger plattformar på den allra senaste tekniken inom datahantering, API:er och AI. Du arbetar tillsammans med bland annat produktägare, arkitekter, data engineers, software engineers och testare. Arbetet innebär att: Arbeta med utveckling inom både frontend och backend Supporta, förvalta och felsöka våra lösningar Delta i planering och analys av funktioner Utveckla ci/cd pipelines Granska kod Bedriva testarbete och skriva enhetstester Ge råd och stöd i tekniska designval och arkitekturfrågor Du har: Gedigen erfarenhet av utveckling både inom frontend och backend God kunskap om TypeScript/Javascript, HTML5, CSS3, Tailwind, jQuery och Bootstrap God kunskap om .NET och C#, samt gärna fler programmeringsspråk Erfarenhet av moderna frontend-ramverk som t.ex. NextJS, Nuxt, SvelteKit God kunskap om Single Page Applications, Jamstack och static site generators God kunskap inom API design och utveckling God kunskap om SQL-databaser God kunskap om säkerhetsfrågor och rekommendationer från exempelvis OWASP Gedigen erfarenhet av att arbeta med Git Känsla för design och UX Du har förmågan att arbeta både självständigt och i grupp Du är van vid att ta ansvar för och äga leveransen av en eller flera funktion(er) Du är mån om att leverera kvalitativa lösningar Du har erfarenhet av att arbeta agilt Meriterande: Goda kunskaper inom tillgänglighet (WCAG) Goda kunskaper i Docker/Kubernetes Erfarenhet av att drifta lösningar on-prem och i public cloud (Docker/Kubernetes/Azure) Erfarenhet av Infrastructure as Code (t.ex. Bicep eller Terraform) Erfarenhet inom Prompt Engineering Goda kunskaper inom teknisk dokumentation &nbsp; Tillhör kategori: Systemutvecklare &nbsp; Startdatum och omfattning är öppet för diskussion. Möjlighet finns till förlängning av uppdraget. &nbsp;"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70972-senior-dataarkitekt-data-engineer-region-skane-avrop-945/",
    "roles": [
      "Data Engineer"
    ],
    "places": [
      "Lund"
    ],
    "description": [
      "Uppdragsbeskrivning Region Skåne befinner sig på en spännande resa mot att bli en datadriven region. Avgörande för att utveckla vår hälso- och sjukvård inför framtiden är att stärka vår förmåga att tillvarata värdet av vår data. Genom att öka tillgängligheten till högkvalitativa data och utveckla verksamhetens kompetens att använda denna möjliggörs nya arbetssätt och metoder inom planering, forskning, resursoptimering och innovation. Därför söker vi nu en driven dataarkitekt/data engineer till vårt team av trevliga, samarbetsvilliga och kunniga kollegor som jobbar med utvecklingen av våra nya plattformar för data, API:er och AI. Vi söker dig som har en gedigen praktisk erfarenhet inom dataplattformar / Data Management. Du har erfarenhet av hela kedjan från kravinsamling till implementation och test. Du är nyfiken på att hela tiden lära dig nytt, som du gärna vill tillämpa och dela med dig av. Du är pragmatisk och har förmågan att skapa goda relationer med andra människor. Du är strukturerad, självgående och kvalitetsmedveten. Som dataarkitekt/data engineer tillhör du ett centralt utvecklingsteam som bygger plattformar på den allra senaste tekniken inom datahantering, API:er och AI. Du arbetar tillsammans med andra data engineers, produktägare, systemutvecklare, testare och andra arkitekter. Vår dataplattform skall kunna hantera flera Petabyte med data för Business Intelligence, avancerad analys och AI med mycket hög prestanda. Arbetet innebär att: Ansvara för design av delar av vår nya data- och analysplattform Delta i planeringen av färdplan för våra plattformar Samla in krav och önskemål från användare och andra intressenter Beskriva features och user stories för vår backlog Utvärdera och förslå lösningar på krav och önskemål Supporta, förvalta och felsöka våra lösningar Stödja data engineers och andra utvecklare Aktivt delta i implementationsarbetet Dokumentera arkitekturen och lösningarna Utveckla och beskriva säkerhetsåtgärder för våra plattformar Planera och driva arbete med test av våra plattformar Ge råd och stöd i tekniska designval och arkitekturfrågor Du har: Mycket god kunskap om arkitektur och design av datalager, datasjöar och data lakehouses. Mycket god kunskap om Microsoft SQL Server / Azure SQL databaser och T-SQL. Mycket god kunskap om ETL-utveckling. God kunskap om Business Intelligence. God kunskap om informationssäkerhet. God kunskap om utveckling i C#. God praktisk erfarenhet av att etablera och implementera datalösningar. Du har en gedigen bakgrund inom data warehousing och har gjort resan till molnet. God förmåga att förstå verksamhetens behov. God pedagogisk förmåga att beskriva och presentera lösningsarkitektur, både muntligen och skriftligen. Meriterande: Erfarenhet av Databricks, Microsoft Fabric, Azure Synapse och Power BI. Erfarenhet av Biml eller andra automatiseringslösningar. Erfarenhet av DBT. Erfarenhet av att etablera plattformar från grunden. Erfarenhet av AI, Machine Learning och avancerad analys. Erfarenhet av Data Governance. Erfarenhet av Master Data Management och Data Quality Management. Erfarenhet av att jobba enligt Data Mesh, Data Fabric och DataOps. Erfarenhet av medallion-arkitektur. Erfarenhet av utveckling i Python. Erfarenhet av hälso- och sjukvårdsverksamhet. Relevanta certifieringar inom exempelvis Azure. Tillhör kategori: Systemarkitekt &nbsp; Startdatum och omfattning är öppet för diskussion. Möjlighet finns till förlängning av uppdraget."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70963-testledare-pension-lumera/",
    "roles": [
      "Testledare"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning På kunds räkning söker vi nu en senior testledare som har djup kunskap inom Lumera. Som testledare planerar och leder du tester i systemet Lumera inför releaser, i samarbete med PO och releasesamordnare för att bedöma testbehovet. Du ansvarar för både manuella och automatiserade tester, samt leder acceptans- och regressionstester med teamen i Stockholm och Sundsvall. Arbetet innefattar samarbete med andra team kring testkrav och genomförande. Rollbeskrivning:  Du ska ta fram teststrategier, planer Du ska kommunicerar testdatabehov. Du kommer att arbeta med kvalitetsgranskning, konsekvensbeskrivningar och beslutsunderlag för fortsatt testarbete ingår, samt uppföljning och dokumentation. Du bidrar till utvecklingen av testroller och arbetsprocesser hos vår kund. Som person leder och motiverar du naturligt, är ansvarstagande, målfokuserad, noggrann och engagerande. Du planerar och prioriterar effektivt, samarbetar väl och hanterar konflikter konstruktivt. Du har flera års erfarenhet inom området test och testledning. För oss är det också viktigt att du har kunskap från försäkringsbranschen och inom området Livförsäkring, gruppförsäkring  och Pension. Skallkrav: Du ska ha erfarenhet av standardsystemet Lumera Du ska ha Försäkringserfarenhet (Ej sakförsäkring) Du ska ha agerat testledare i en kontext med komplex arkitekturkarta och många beroenden Du ska ha förmåga att hantera högt tempo och en vardag där allt inte finns på plats och man får söka sina egna svar ibland. Börkrav: Du bör ha vana av att testa själv och gillar att både ligga högt och lågt, som inte är rädd att ta i Du bör ha vana av att hantera testare med låg IT mognad Personliga egenskaper: Du ska vara flexibel Du ska vara kommunikativ Du ska ha förmåga att kunna prioritera själv utifrån uppsatta kriterier Vidare har du: god kännedom om systemutvecklingsprocesser och Agila metoder med fördel en ISTQB-certifiering bred förståelse för flertalet systemmiljöer, tekniker och plattformar kunskap och erfarenhet om test enligt agila arbetsmetoder som SCRUM och Kanban mycket goda kunskaper och erfarenheter av testverktyg inom management och automation &nbsp; Du kommer att arbeta på plats i vår kunds lokaler i Stockholm, cirka 3 dagar per vecka."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70924-software-engineer-114/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Software Engineer with extensive experience in product development, specifically within the automotive sector. As a Software Developer, you will be responsible for defining and maintaining the software architecture, as well as developing and delivering high-quality software to be integrated into vehicles. Function &amp; Control Team Overview The Function &amp; Control team at our client’s site is responsible for developing all seat-related functions in the vehicle. This team: Designs, develops, and delivers software for control modules. Works on both in-house projects and with suppliers. Main Responsibilities: Define and maintain the software architecture of the product. Develop and deliver quality-assured software for vehicle integration. Ensure that all software meets quality standards and is delivered on time. Collaborate with cross-functional teams to ensure smooth integration with vehicle systems. Qualifications: At least 5 years of software development experience, particularly in C++ or C. Experience with QNX is preferred but not mandatory. Experience with Embedded Linux Development is preferred but not mandatory. Knowledge of Continuous Integration (CI) and Automatic Testing. Familiarity with automotive industry standards for software development. Proficiency in Google Test or similar testing frameworks. Experience with Git and Gerrit, or other version control systems. Familiarity with Matlab Simulink is beneficial. Proficient in English (written and spoken). Desired Attributes: Flexible and adaptable in dynamic environments. Self-driven with a strong initiative to complete tasks independently. Reliable in delivering high-quality results. Structured and methodical in approaching tasks. A strong team player with the ability to collaborate effectively. Performance-driven with a focus on continuous improvement."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70921-sac-senior-developer-ux-expert/",
    "roles": [
      "Developer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Senior Developer/UX Expert to focus on the SAC platform within their planning product team, Digital Finance. As a developer, you will collaborate with the engineering manager and product team members to deliver planning solutions for the commercial community, leveraging SAC platform capabilities. This role is a hybrid remote position based in Gothenburg, Sweden. Main Responsibilities: Understand the business processes and how the application supports these processes to provide effective problem-solving. Participate in workshops to define the implementation strategy. Provide alternatives and recommendations based on best practices and application functionality. Configure the SAC platform to present and develop solutions. Lead architecture discussions and design sessions. Develop a planning tool for the commercial community to: Create forecasts and budget plans. Perform simulations to assess financial impact. Assist in decision-making for company sales. Ensure the publishing of planned data to the consolidation unit. Qualifications: Deep understanding of core financial statements and reporting dimensionality. Strong knowledge of FP&amp;A (Financial Planning &amp; Analysis). Technical and functional experience in implementing SAC planning projects. Experience in: Writing data allocation logic. Enhancing user interfaces and dashboards. Conducting SAP and non-SAP integrations. Desired Attributes: Team-oriented personality. Solution-oriented mindset."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70870-test-developer-10/",
    "roles": [
      "Developer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Test Developer. As a developer with a focus on analysis and verification, you will work in an agile, cross-functional team. Your role will leverage your test expertise to actively coach your team members in all matters related to quality from a test perspective. As a team player in an agile, cross-functional team, you will do whatever is necessary to achieve the team’s goals. This includes learning and gaining insights from other disciplines within the team. Together with the team, you will develop and execute highly effective test solutions and test cases to enable fast and robust software development, providing excellent customer functions. Quality is more than just metrics; it’s a mindset. It reflects a respect for both our client’s customers and their own legacy. Main Responsibilities: Coach your agile team on test-related activities during design and development Design, implement, and run test methods in an automated test environment Develop features in the test automation framework for increased automated testing Report test results and provide recommendations to stakeholders Analyze defects and issues Ensuring testability during architecture design or function development Writing and guiding the team in creating test cases Automating tests for regression testing Required Qualifications: B.Sc. in Physics, Computer Science, Electrical Engineering, or equivalent Experience in quality assurance of complex embedded systems Fluent in English (written and spoken) Valid driver’s license (Category B) Additional Qualifications: Experience in automotive and Body/Comfort systems development Experience with CANoe, Jenkins, or similar test frameworks Experience with systems such as Elektra, CarCom, or System/Car Weaver Experience in test automation, programming, or model-based development/testing Desired Attributes: Strong analytical skills, with the ability to assess complex problems and develop effective solutions A cooperative mindset, working well within teams and across functions to achieve common goals A creative approach, generating new ideas and thinking outside the box when solving challenges An innovative spirit, continuously seeking improvements and new ways to enhance processes or products"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70863-system-designer-exterior-lighting-functions/",
    "roles": [
      "System Designer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a System Developer to strengthen their teams within Exterior Lighting Functions. The team’s goal is to deliver best-in-class customer functions for upcoming vehicles. The Exterior Lighting Functions Group, part of Vehicle Tophat Solution and Exterior Systems ART, is responsible for developing and designing exterior lighting functions, systems, and software (SW) to provide the best user experience in future vehicles. As part of the team, you will contribute to the development and design of systems that deliver the customer functions they aim to offer. Main Responsibilities: As a System Developer, you will be responsible for developing a system that fulfills the agreed cross-functional solution. Your key responsibilities will include: Ensuring that all solutions comply with agreed requirements. Breaking down and distributing functional requirements to the execution environment. Overseeing the functional and non-functional realization in Car Weaver (System Weaver), working closely with the team and all relevant stakeholders. Required Qualifications: The ideal candidate should have the following qualifications: A relevant university degree in Electronics, Software, Mechatronics, or equivalent. Minimum 5 years of experience in system engineering or a strong background in electrical system knowledgegained from working with SW testing. Previous experience in SW development is advantageous. Fluency in English (spoken and written). Additional Qualifications: The following skills and experiences are desired and would add value to the team: C++ programming. Simulation and Model-Based Design using MATLAB/Simulink. Experience with System Weaver and Elektra. Knowledge of vehicle communication protocols like CAN, LIN, FlexRay, Ethernet. Familiarity with automotive standards, such as: Functional Safety ISO26262. Cyber Security ISO21434. A valid B driving license. Desired Attributes: A good team player with the ability to work independently. Structured and organized in their work. A reliable and motivated individual with a creative mindset. Passionate about developing future products."
    ]
  }
]