[
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72899-projektledare-56/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning Vi söker en projektledare för vår kunds räkning. Arbetet kommer att utföras både på kundens kontor och delvis på distans. Vid resor mellan kontor används främst kollektivtrafik. Huvudsakliga ansvarsområden: Driva och koordinera olika IT-projekt som initieras av kundens olika verksamheter. Ansvara för projekt som relaterar till användarnära IT-infrastruktur samt fastighetstekniska system där IT-stödet spelar en central roll. Föra dialog med beställare och kunder för att klargöra krav och förväntningar, samt säkerställa att dessa möts under projektets gång. Ansvara för genomförandet av projekt, oavsett om det rör sig om små eller större uppdrag med varierande komplexitet. Sköta projektens budget, planering, uppföljning och dokumentation på ett professionellt sätt. Beroende på projektens storlek förväntas du hantera flera projekt samtidigt. De flesta projekten är IT-relaterade, men vissa kan vara mer koordinerande eller förändringsorienterade. Obligatoriska kvalifikationer: Minst 5 års erfarenhet som IT-projektledare, med erfarenheter som är högst 10 år gamla. Djup och bred kunskap inom användarnära IT-infrastruktur och generell IT-infrastruktur. Gedigen erfarenhet av att leda virtuella team med varierande kompetens. Mycket god förmåga att dokumentera och presentera på svenska. Trivs i en drivande och självständig roll. Svenskt medborgarskap krävs för att kunna genomgå säkerhetsprövning. Ett detaljerat CV som tydligt beskriver din erfarenhet inom området. B-körkort krävs. Meriterande kvalifikationer: Tidigare erfarenhet inom de specifika sektorer som uppdraget omfattar. Erfarenhet av arbete i större organisationer med politisk styrning. Erfarenhet av att leda förändringsarbeten med agila metoder. Erfarenhet av arbete i stora och komplexa IT-miljöer. Ett agilt förhållningssätt i ditt arbetssätt. Bred IT-kompetens som sträcker sig över flera områden. Personliga egenskaper: Stark samarbetsförmåga men också bekväm med att arbeta självständigt. Prestigelös och generös med att dela med dig av din erfarenhet och idéer. Engagerad, drivande och lyhörd i din kommunikation och ditt arbetssätt."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72878-projektledare-ibc-hotlab/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en projektledare med ansvar för att leda och koordinera införandet av IBC Hotlab. Projektet innebär nära samarbete med en leverantör baserad i Nederländerna, vilket kräver god kommunikationsförmåga på engelska. Projektledaren kommer att ha en central roll i kontakten med både verksamhetens och IT-avdelningens intressenter. Bakgrund: Kundens plattform för digitalisering stödjer verksamheterna i anskaffning, utveckling och implementering av IT-tjänster. Enheten för projekt- och förändringsledning arbetar med att driva projekt som följer kundens digitaliseringsstrategi och tekniska utveckling. Denna enhet ansvarar även för att kvalitetssäkra IT-leveranser. Projekt- och förändringsledarna driver digitaliseringsprojekt som har initierats utifrån olika behov inom organisationens förvaltningar. Enheten fokuserar främst på nyutvecklingsprojekt, men det förekommer även vidareutvecklingsprojekt och avrop av kompetens från externa leverantörer. Kunden har idag en föråldrad metod för hantering av radiofarmaka inom nuklearmedicinska laboratorier. Detta system uppfyller inte längre moderna krav på patientsäkerhet eller myndighetskrav. IBC Hotlab-systemet har upphandlats för att skapa ett integrerat och säkert system för hantering och registrering av radioaktiva läkemedel, vilket kommer att förbättra patientsäkerheten och öka spårbarheten genom att eliminera manuell hantering. Huvudsakliga ansvarsområden: Leda och driva införandet av IBC Hotlab. Vara huvudansvarig för kontakterna med verksamheten och IT-avdelningen. Regelbunden uppföljning med projektägare och säkerställande av projektets framdrift. Ansvara för att kommunicera och koordinera med leverantören baserad i Nederländerna. Säkerställa att projektet följer de krav som ställs från myndigheter som Strålskyddsmyndigheten och Läkemedelsverket. Obligatoriska kvalifikationer: Minst 5 års erfarenhet som projektledare inom digitalisering och verksamhetsutveckling. Gedigen erfarenhet av att leda virtuella team och använda digitala verktyg som Microsoft365. Mycket god förmåga att dokumentera och presentera komplex information på svenska för olika målgrupper. Förmåga att fatta beslut och driva projektet framåt med stort ansvar. Svenskt medborgarskap, för möjlighet att säkerhetsklassas vid behov. Erfarenhet av att leda IT-projekt inom offentlig sektor. Stark förmåga att kommunicera på engelska. Meriterande kvalifikationer: Erfarenhet av att leda IT-projekt inom digitalisering inom hälso- och sjukvårdssektorn. Kunskap och erfarenhet av agila arbetsmetoder. Erfarenhet av förändringsledning. Personliga egenskaper: Konsulten bör vara engagerad, drivande och lyhörd. Förmåga att vara prestigelös och lyssna in olika parter, samtidigt som man delar med sig av sina erfarenheter och idéer. Stark förmåga att hantera flera intressenter och balansera olika behov i projektet. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72816-projektledare-55/",
    "roles": [],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning: Vår kund söker nu en erfaren delprojektledare som ska ta ansvar för implementationsprojektledning med särskilt fokus på kundens åtaganden. Uppdraget kräver nära samarbete med leverantören och kontinuerlig dialog med kundens interna resurser inom IT, verksamhet och externa leverantörer. Du kommer verka inom projektet och rapportera till huvudprojektledaren. Projektet syftar till att designa och implementera en ny butiks- och kassalösning för kund. Du har en holistisk förståelse för processer och kan navigera i en föränderlig miljö. (Erfarenhetsnivå 4-6 år) &nbsp; Ansvarsområden: Leda samarbetet mellan kunden och leverantören och övriga intressenter. Säkerställa lösningens omfattning, framgångskriterier, och budgetuppföljning. Beskriva alternativa lösningar baserat på krav och begränsningar. Leda arbetet kring integrationer och förändringar i kringliggande system. Säkerställa kommunikation och genomförande med intressenter Inom projektet finns ansvariga för övergripande kvalitet &amp; test samt förändringsledning, det är viktigt att förankra och samarbeta med dessa för att vara framgångsrik i din roll. Projektledarbetet kräver att du är ihärdig, hittar vägar att ta sig fram och att du är duktig på att driva frågor hela vägen i mål. Personliga egenskaper: Lätt för att uttrycka dig skriftligt, illustrativt och muntligt. Du har goda kunskaper i Office-paketet (PowerPoint, Excel, Word). Flytande i svenska och engelska Ledaregenskaper och kan ta ansvar för projektledning ur alla aspekter mellan leverantören och specifikt i programmet. Du har förmågan att leda både dig själv och andra projektdeltagare effektivt. Definiera projektmedlemmar och säkra förväntningar (både mot individer och mellan projektmedlemmar) Kommunikativ och öppen Saklig och professionell Planera, Mäta och övervaka progress samt kommunicera status till intressenter. Driva ägandeskap för beslut och skapa förutsättningar för beslut. Främja förändringshantering Förmåga att motivera projektmedlemmar och intressenter. Du är proaktiv, orädd och redo att ta initiativ. Önskemål om tidigare erfarenhet: Erfarenhet från Retail (krav). Erfarenhet av POS-lösningar och betalningar (meriterande). Tidigare arbetat som projektledare i vattenfalls- och/eller agila miljöer, gärna en hybridmodell. Deltagit i större transformationsprojekt/program. SAP-erfarenhet är ett plus Erfarenhet av stora program och komplexa relationer mellan legacy- och nya system Erfarenhet från en större organisation och kunna navigera sig fram i en dynamisk miljö"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72815-projektledare-54/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Distans",
      "Gävle"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en projektledare som har kunskap inom verksamhetsutveckling. Rollbeskrivning: Du kommer att ha ansvar för att driva, samordna och leda projektet genom dess livscykel. Det ingår arbete med bl.a. förändringsledning, tjänstedesign, agila arbetssätt, nytta- och effektmätning i olika omständigheter. Skallkrav: B-körkort Du ska ha relevant eftergymnasial utbildning Du ska ha minst 5 års dokumenterad erfarenhet av projektledning Du ska ha minst 5 års dokumenterad erfarenhet av arbete i ledande positioner Du ska ha erfarenhet av att driva projekt inom IT-verksamhet och/eller digitalisering Du ska ha erfarenhet av att driva arbete med national digital infrastruktur tex Säker Digital Kommunikation, Digitala Nationella, KLASSA prov mfl Du ska ha erfarenhet och förståelse av IT-tekniska lösningar Du ska ha erfarenhet av arbete med systemintegrationer Du ska ha erfarenhet av att ta fram och dokumentera krav och behov Du ska ha certifiering eller vara diplomerad förändringsledare Du ska ha dokumenterad kompetens av agil projektledning Du ska ha erfarenhet av IT-projekt i stora och komplexa IT-miljöer Du ska ha erfarenhet av samverkan med intressenter från flera olika organisationer i projekt/uppdrag tex SKR, DIGG mfl Du ska ha erfarenhet av att samordna utredningsarbete gällande juridiska frågeställningar Du ska ha erfarenhet av att samordna utredningsarbete gällande informationssäkerhet Du ska ha erfarenhet från att ta fram och presentera tydliga beslutsunderlag Du ska ha god planeringsförmåga och vara strukturerad i sitt arbetssätt Du ska ha god samarbetsförmåga samt kommunikationsförmåga i så väl i tal och skrift på svenska Du ska ha erfarenhet av uppdrag där fokus är på att leverera resultat och uppfylla kundförväntningar Du ska utföra ditt uppdrag delvis på plats i vår kunds lokaler i Gävle. Beroende på arbetsuppgifter och uppdrag så förekommer arbete fysiskt på plats i Gävle."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72698-projektledare-for-inforande-av-m365-pa-taby-kommun-3/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdraget består i att leda införandet av Microsoft365 till kommunens alla medarbetare. Det innebär att lösningen ska konfigureras, implementeras till användarna samt att avveckla gamla miljön i de fall det blir aktuellt. I arbetet ingår att ta fram övergripande planering, aktivitetsplan med en föreslagen utrullningssekvens. I projektet ingår också att leda framtagande av stödmaterial, så som manualer, övergripande kommunikation, med mera. Konsulten kommer att projektleda arbetet, föredra till styrgrupp och i vissa fall själv utföra moment vid behov tillsammans med kommunens medarbetare. Uppskattad tid i timmar för uppdraget: 50%-30%, beroende på takt och behov under projekttiden. Mer tid förväntas för uppstart och avslut, och mindre för det löpande genomförandet. Möjlighet till förlängning: till och med 30 oktober 2025. Förväntat resultat Välfungerande M365 miljö för kommunen. Projektorganisation Avropad konsult kommer att leda arbetet och själv utföra moment vid behov tillsammans med kommunens medarbetare, och vid behov ta in konsultstöd. Avropad konsult rapporterar till styrgrupp. Hantering av personuppgifter a) Vilka typer av personuppgifter får behandlas: personuppgifter så som känsliga personuppgifter. b) Vilka kategorier av registrerade personer kommer behandlas: medarbetare i kommunen samt konsulter. c) Vilka eventuella loggningskrav gäller för personuppgiftsbehandlingen samt vilka ska ha tillgång till dem: Loggning i ärendehanteringssystem. Handlingar som ska ingå i offert: &#8211; CV &#8211; Referensförteckning &#8211; Certifikat &#8211; Tidplan Skallkrav Har minst två års erfarenhet av att ha arbetat konsultativt Har ansvarat för framtagande av analyser/utredningar Har erfarenhet av att ha arbetat med frågor om analys med personer i ledande befattningar Har relevant akademisk utbildning omfattande åtminstone 120 poäng enligt det gamla poängsystemet eller åtminstone 180 poäng enligt det nya poängsystemet på svenska högskolor och universitet. Kravet är även uppfyllt om konsulten genomfört motsvarande studier vid ett utländskt lärosäte. Åtminstone 60 poäng enligt det famla poängsystemet eller åtminstone 90 poäng enligt det nya poängsystemet ska vara inom företags- och/eller nationalekonomi Personliga egenskaper God förmåga till kommunikation, planering och logistik Meriterande med erfarenhet av liknande uppdrag på Täby kommun Övriga krav Erbjudna resurser ska ha utfört minst två (2) likvärdigt uppdrag (utrullning som berör alla medarbetare) hos en kommun det två (2) senaste åren Minst en (1) kontaktperson och kontaktuppgifter för referenstagning i kommun Bifoga certifiering inom projektledning Bifoga tidplan. Konsulten bifogar ett förslag på beläggning över projektets löptid och timkostnad &nbsp; För att kunna ansöka för detta uppdrag måste du vara en registrerad användare i vår portal som är helt kostnadsfri. Är du ny användare och vill registrera dig eller ditt bolag i Upgrades portal klicka här: https://portal.upgraded.se/"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72686-projektledare-for-inforande-av-m365-pa-taby-kommun-2/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdraget består i att leda införandet av Microsoft365 till kommunens alla medarbetare. Det innebär att lösningen ska konfigureras, implementeras till användarna samt att avveckla gamla miljön i de fall det blir aktuellt. I arbetet ingår att ta fram övergripande planering, aktivitetsplan med en föreslagen utrullningssekvens. I projektet ingår också att leda framtagande av stödmaterial, så som manualer, övergripande kommunikation, med mera. Konsulten kommer att projektleda arbetet, föredra till styrgrupp och i vissa fall själv utföra moment vid behov tillsammans med kommunens medarbetare. Uppskattad tid i timmar för uppdraget: 50%-30%, beroende på takt och behov under projekttiden. Mer tid förväntas för uppstart och avslut, och mindre för det löpande genomförandet. Möjlighet till förlängning: till och med 30 oktober 2025. Förväntat resultat Välfungerande M365 miljö för kommunen. Projektorganisation Avropad konsult kommer att leda arbetet och själv utföra moment vid behov tillsammans med kommunens medarbetare, och vid behov ta in konsultstöd. Avropad konsult rapporterar till styrgrupp. Hantering av personuppgifter a) Vilka typer av personuppgifter får behandlas: personuppgifter så som känsliga personuppgifter. b) Vilka kategorier av registrerade personer kommer behandlas: medarbetare i kommunen samt konsulter. c) Vilka eventuella loggningskrav gäller för personuppgiftsbehandlingen samt vilka ska ha tillgång till dem: Loggning i ärendehanteringssystem. Handlingar som ska ingå i offert: &#8211; CV &#8211; Referensförteckning &#8211; Certifikat &#8211; Tidplan Skallkrav: Har minst två års erfarenhet av att ha arbetat konsultativt Har ansvarat för framtagande av analyser/utredningar Har erfarenhet av att ha arbetat med frågor om analys med personer i ledande befattningar Har relevant akademisk utbildning omfattande åtminstone 120 poäng enligt det gamla poängsystemet eller åtminstone 180 poäng enligt det nya poängsystemet på svenska högskolor och universitet. Kravet är även uppfyllt om konsulten genomfört motsvarande studier vid ett utländskt lärosäte. Åtminstone 60 poäng enligt det famla poängsystemet eller åtminstone 90 poäng enligt det nya poängsystemet ska vara inom företags- och/eller nationalekonomi Personliga egenskaper: God förmåga till kommunikation, planering och logistik Meriterande med erfarenhet av liknande uppdrag på Täby kommun Övriga krav: Erbjudna resurser ska ha utfört minst två (2) likvärdigt uppdrag (utrullning som berör alla medarbetare) hos en kommun det två (2) senaste åren Minst en (1) kontaktperson och kontaktuppgifter för referenstagning i kommun Bifoga certifiering inom projektledning Bifoga tidplan. Konsulten bifogar ett förslag på beläggning över projektets löptid och timkostnad För att kunna ansöka för detta uppdrag måste du vara en registrerad användare i vår portal som är helt kostnadsfri. Är du ny användare och vill registrera dig eller ditt bolag i Upgrades portal klicka här: https://portal.upgraded.se/"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72665-projektledare-53/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning Vi söker nu en Projektledare på uppdrag av en kund. Rollen innebär främst att driva och koordinera olika IT-projekt som beställs och initieras av kundens olika avdelningar. Ett av de viktigaste projekten handlar om att sammanföra och utreda cirka 150 applikationer inom ett universitetssjukhus. Arbetet utförs delvis på kundens kontor, men det finns möjlighet till distansarbete. Vid resor mellan olika kontor föredras i första hand användning av kollektivtrafik. Bakgrund: Avdelningen för digitalisering arbetar för att stötta verksamheterna med att anskaffa och utveckla IT-tjänster. Inom avdelningen för Infrastruktur och cybersäkerhet drivs interna projekt och uppdrag med fokus på att strategiskt följa den globala tekniska utvecklingen. Dessutom ansvarar en specifik enhet för att följa upp och kvalitetssäkra IT-leveranser inom projekten. De tekniskt inriktade projekten drivs inom fem olika team, där de flesta projekt rör utveckling och implementering av ny teknik inom infrastrukturområdet. Ofta anlitas experter från linjeverksamhet och externa leverantörer för dessa projekt. Huvudsakliga ansvarsområden: Säkerställa att dialoger med beställare och kunder klargör krav och förväntningar inom de olika projektuppdragen. Ansvara för genomförandet av både stora och små projekt med varierande komplexitet. Arbeta med stöd av etablerade arbetsmetoder och team för att leverera projekt på ett professionellt sätt. Hantera projektbudget, planering, uppföljning och dokumentation. Koordinera flera projektuppdrag, där antalet kan variera beroende på projektens omfattning. Nästan alla projekt är IT-relaterade, men det kan förekomma projekt som även kräver koordination eller förändringsledning. Obligatoriska kvalifikationer: Minst 3 års erfarenhet som IT-projektledare, med aktuell erfarenhet inom de senaste 10 åren. Bred och djup kunskap om IT-infrastruktur nära användaren. Erfarenhet av att leda virtuella kompetensteam. Förmåga att dokumentera och presentera på svenska. Självständig och drivande i sin arbetsroll. Svenskt medborgarskap, nödvändigt för säkerhetsklassning. Körkort (B). Ett detaljerat CV som beskriver erfarenheter inom relevanta områden. Meriterande kvalifikationer: Erfarenhet från arbete inom större politiskt styrda organisationer. Erfarenhet av agila arbetsmetoder. Kunskap om större, komplexa IT-miljöer. Erfarenhet av system inom hälso- och sjukvård samt medicintekniska system. Erfarenhet av IT-säkerhet och IT-infrastrukturarbete. Erfarenhet av att arbeta i en agil miljö. Personliga egenskaper: Engagerad och drivande i sitt arbete. Lyhörd och bra på att samarbeta med andra. Trivs både med att arbeta i grupp och självständigt. Prestigelös och villig att dela med sig av sina erfarenheter och idéer. Flexibel och anpassningsbar i olika arbetsmiljöer."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72623-projektledare-utredare/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en Projektledare/Utredare. Arbetet kommer att utföras både på plats i kundens lokaler, med viss möjlighet till distansarbete. Vid behov av resor mellan kontoren kommer i första hand kommunala färdmedel att användas. Vår kunds digitaliseringsplattform har som mål att stödja verksamheterna i deras anskaffning och utveckling av IT-tjänster. Avdelningen Infrastruktur och Cybersäkerhet ansvarar för att driva interna projekt, strategiskt följa den globala tekniska utvecklingen samt säkerställa kvaliteten på IT-leveranser i dessa projekt. Enheten Förändring och Möjliggörande, som ingår i avdelningen Infrastruktur och Cybersäkerhet, ansvarar för tekniskt inriktade projekt och är organiserad i fem team som fokuserar på specifika kundgrupper. Deras uppdrag omfattar ofta utveckling och implementering av ny infrastrukturteknik, där de använder resurser från både interna avdelningar och externa leverantörer. Huvudsakliga ansvarsområden: Ansvara för att driva och samordna olika IT-projekt som initieras av kundens verksamheter. Hantera utredningen av cirka 150 applikationer inom Sahlgrenska som huvudprojekt. Föra dialog med beställare/kunder för att klargöra krav och förväntningar inom ramen för projektuppdragen. Genomföra projekt med varierande komplexitet, från mindre uppdrag till större, mer omfattande projekt. Hantera projektbudget, planering, uppföljning och dokumentation. Koordinera och leda projekt, främst inom IT, men även inom förändringsledning och annan relevant verksamhet. Antalet projekt varierar beroende på deras storlek. Projektuppdragen är nästan uteslutande IT-relaterade, men kan även inkludera koordinerande eller förändringsledda uppgifter. Obligatoriska kvalifikationer: Minst 3 års erfarenhet som IT-projektledare, ej äldre än 10 år. God och bred kunskap inom användarnära IT-infrastruktur. God och bred kunskap inom IT-infrastruktur i allmänhet. Erfarenhet av att leda virtuella kompetensteam. Svenskt medborgarskap (för säkerhetsklassning). Ett CV som tydligt beskriver erfarenheter inom relevanta områden. Du ska inneha ett B-körkort. Meriterande kvalifikationer: Erfarenhet från arbete i större politiskt styrda organisationer. Erfarenhet av agila arbetssätt. Erfarenhet av arbete inom stora, komplexa IT-miljöer. Erfarenhet av hälso- och sjukvårdssystem samt medicintekniska system. Erfarenhet av arbete inom IT-infrastruktur och IT-säkerhet. Erfarenhet av större, komplexa IT-miljöer. Ett agilt förhållningssätt. Bred IT-kompetens. Personliga egenskaper: God förmåga att dokumentera och presentera på svenska. Trivs i en drivande roll och har förmågan att arbeta självständigt. Engagerad, drivande och lyhörd, med förmåga att samarbeta effektivt, men också kunna arbeta självständigt. Prestigelös och villig att dela med sig av erfarenhet och idéer. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72592-it-projektledare-ioc/",
    "roles": [
      "IT Projektledare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en erfaren projektledare med fokus på verksamhetsutveckling och en stark IT-bakgrund. Du förväntas ha djupgående förståelse för komplexa IT-miljöer samt erfarenhet av att utveckla och implementera affärsmodeller inom IT-området. Personen bör även ha arbetat i stora organisationer, gärna med politiska beslutsstrukturer, och vara kapabel att leda och engagera både interna och externa intressenter för att säkerställa en framgångsrik implementering av kundens nya service offering-modell. Obligatoriska kvalifikationer: Dokumenterad erfarenhet av affärsutveckling eller verksamhetsutveckling inom IT de senaste fem åren. Förmåga att uttrycka sig flytande i både svenska och engelska, i både skrift och tal. Erfarenhet av att leda utvecklingsprojekt med ett flertal intressenter. Beprövad kompetens i att utveckla och implementera affärsmodeller eller servicekoncept inom IT. Erfarenhet av att arbeta i större organisationer, helst med politisk styrning. Förmåga att arbeta självständigt och vara initiativrik. Meriterande kvalifikationer: Tidigare erfarenhet av att utveckla affärsmodeller eller servicekoncept inom områden som IT-infrastruktur och cybersäkerhet anses vara en stor fördel. Du bör ha erfarenhet av att leda projekt och förändringsarbete i miljöer där politiska beslutsprocesser påverkar organisationens struktur och riktning. Det är meriterande om konsulten har arbetat med agila metoder för att leda utvecklings- eller förändringsprojekt, vilket möjliggör en anpassningsbar och flexibel arbetsmetodik. Referenser från tidigare kunder, där liknande uppdrag har genomförts med framgång, stärker konsultens trovärdighet och förmåga att leverera. Personliga egenskaper: Förmåga att kommunicera effektivt och tydligt, både inom teamet och med externa aktörer. Drivkraft att genomföra projekt från start till mål. Bekväm med att utmana och ifrågasätta existerande strukturer för att driva förbättring. Lösningsorienterad med en stark vilja att nå uppsatta mål. Anpassningsbar och öppen för förändring i dynamiska miljöer."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72540-projektledare-52/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning Vi söker nu en projektledare för att stötta vår kund under en period med ökad arbetsbelastning, till följd av både införande och avveckling av IT-system. Eftersom ordinarie resurser för närvarande är engagerade i nya projekt, behövs en konsult för att avlasta inom IT-tjänsterna kopplade till Mellanarkiv. Den här rollen innebär att arbeta tillsammans med Mellanarkiv-teamet, som i dagsläget består av en teamledare, systemförvaltare, applikationsspecialister och flera systemutvecklare. Mellanarkiv-teamet ansvarar för att förvalta runt 50 applikationer, fördelade mellan tre olika mellanarkiv samt stödsystem och överföringstjänster. Applikationerna utgörs både av inköpta system och egenutvecklade lösningar. Som applikationsspecialist i teamet för Mellanarkiv arbetar man tätt ihop med andra experter, både internt och hos leverantörer. Huvudsakliga ansvarsområden: Teknisk support Hantering av ärenden (incidenter och beställningar) i Service Now Användarstöd och detaljkonfigurering av förvaltningssystem Felsökning i loggar, databaser och andra systemfiler, dvs traditionell systemanalys Livscykelhantering Utföra livscykeluppgifter som uppgraderingar av applikationer och servrar inom E-arkivet Beställning och installation av certifikat Administrera och uppdatera kunskapsartiklar Testadministration för applikationer och operativsystem Paketering och licenshantering av programvara Hantering av skannerhårdvara Dokumentering Skapa teknisk dokumentation som lathundar, kunskapsartiklar och rapporter inom relevanta förvaltningsområden Obligatoriska kvalifikationer: Kandidatexamen i systemvetenskap, datavetenskap, systemutveckling eller motsvarande Minst tre års erfarenhet som systemanalytiker eller applikationsspecialist Minst tre års erfarenhet av teknisk support, felsökning, tester och ärendehantering i stora system Minst tre års erfarenhet av att producera teknisk dokumentation på svenska och engelska God social förmåga och skicklighet i att kommunicera komplex information till olika grupper inom organisationen Minst tre års erfarenhet från större företag eller organisationer Analytisk förmåga att identifiera behov och förbättringar inom system och processer Praktisk erfarenhet av systemlivscykelhantering och support för mellanarkiv för skannad journal Teknisk kompetensprofil: Databaser: Erfarenhet av SQL Server Management Studio (Kunskapsnivå: 2) Databasprogrammering: Kunskaper i SQL-Script (Kunskapsnivå: 2) Klient/Server: Kunskap om SCOM, IIS och Remote Endpoint Manager (Kunskapsnivå: 2) Meriterande kvalifikationer: Erfarenhet av agila arbetsmetoder som Scrum eller Kanban Kunskap om ITIL-processer Erfarenhet av systemförvaltning av IT-system inom mellanarkivering Personliga egenskaper: Teamorienterad och samarbetsvillig, med en lyhörd inställning Prestigelös och villig att dela med sig av kunskap Kvalitetsmedveten och prioriterar noggrannhet över kvantitet Kommunikativ och har lätt att uttrycka sig i både tal och skrift på svenska Flexibel, med förmåga att hantera olika situationer och flera parallella prioriteringar Självgående och proaktiv i att se behov inom förvaltningen samt planera och strukturera sitt arbete &nbsp; Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72341-applikationsspecialist-enhet-information-och-arkivering/",
    "roles": [
      "Applikationsspecialist"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker en Applikationsspecialist för kunds räkning, som kommer att arbeta med Enheten för Information och Arkivering. Rollen kräver att du kan sätta dig in i projektets krav på applikationerna samt förstå hur de installeras och konfigureras. Du kommer att fungera som ett bollplank för alla intressenter som är involverade i konfigureringen och användningen av systemet. Det är också viktigt att du kan sätta dig in i verksamhetens processer och arbetsflöden. Rollen kräver inte nödvändigtvis lång erfarenhet, men du bör vara snabb i tanken, handlingskraftig och ha förmågan att analysera och förstå applikationens funktioner på djupet. Du kommer att stödja projektet och därefter delta i överlämningen till förvaltningen. Obligatoriska kvalifikationer: Kandidatexamen eller motsvarande inom Systemvetenskap, Datavetenskap, Systemutveckling eller liknande. Förmåga att snabbt lära dig ny teknik. Förståelse för processer och arbetsflöden. Erfarenhet av att stötta arkitekter, projektledare och andra intressenter med insikter om hur applikationen fungerar. Goda kunskaper om E-arkiv 3.0-funktionalitet och tillhörande utmaningar. Förmåga att förstå och hantera förvaltningens behov, med ansvar för övergången från projekt till förvaltning. Flytande engelska, då leverantören kan vara internationell och dokumentationen oftast är på engelska. Kunskap om dokumentation och dokumenthantering genom hela processen. Erfarenhet av metadatahantering. Kunskap om integrationsteknik. Förståelse för webbservrar och databaser. Meriterande kvalifikationer: Erfarenhet av agila arbetsmetoder såsom Scrum eller Kanban. Kännedom om ITIL-processer. Erfarenhet av systemförvaltning av IT-system inom mellanarkivering."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72328-senior-uppdragsledare-delprojektledare-utbildningsmaterial-region-skane-avrop-957/",
    "roles": [
      "Uppdragsledare"
    ],
    "places": [
      "Lund"
    ],
    "description": [
      "Uppdragsbeskrivning Region Skåne implementerar med hjälp av Oracle Health ett digitalt vårdsystem för att ersätta ett antal applikationer som stödjer regionens vårdaktiviteter. Detta är det mest omfattande förnyelsearbetet i Region Skånes historia. För mer information se https://vardgivare.skane.se/tema/skanes-digitala-vardsystem-sdv/ SDV söker nu en uppdragsledare/ utbildningskoordinator där fokus kommer att vara att koordinera och sätta samman utbildningspaket och utbildningsmaterial för de som arbetar i SDV-programmets supportorganisationer. Rollen innebär att ansvara för att ta fram statistik och analysera SDVs utbildningsbehov för supportorganisationer. Prioritera och skapa översikt när utbildning ska genomföras. Presentera utbildningspaket, skapa utbildningsmaterial och återkoppla med supportorganisationernas projektledare och ansvariga. Driva samarbete och lösningar med interna och externa intressenter. Rollen innebär även ett nära samarbete med samtliga delprojekt inom programmet men även kontakter och samarbete med olika intressenter utanför programmet. Du kommer att tillhöra delprojektet Utbildning och rapportera till dess projektledare. Önskad kompetens: Goda kunskaper i excel Erfarenhet av att arbeta i stora projekt och kunna koordinera mellan olika intressenter Kommunikativ och serviceinriktad Goda kunskaper i svenska i såväl tal som i skrift För rollen krävs det också att du är strukturerad och arbetar proaktivt, är lösningsorienterad och ser möjligheter i komplexa situationer. Rollen kräver tidigare erfarenhet från att skapa och sätta ihop utbildningar samt att ha jobbat med att planera och koordinera utbildningar och att du har kunskap i hur vi bäst säkerställer förutsättningar för lärande. Har du dessutom erfarenhet från att ha arbetat med digitala utbildningar är det ett plus. Du kommer att samarbeta med både interna och externa intressenter och det är därför viktigt att du är lyhörd och har lätt att knyta kontakter och samarbeta med olika människor. Du måste trivas med att arbeta i en miljö med högt tempo där det ständigt sker förändringar. Det är viktigt att du tycker om att samarbeta med andra människor och är lyhörd för andras behov. &nbsp; Tillhör kategori: Uppdragsledare"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72284-losningsarkitekt-25/",
    "roles": [
      "Lösningsarkitekt"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning: Vår kund söker en senior lösningsarkitekt till ett antal projekt inom stöddomänen, initialt till uppdrag rörande våra verksamheter inom områdena för Juridik och Koncernsäkerhet/CISO. Du kommer att ha ansvar för framtagandet av lösningar i flera projekt inom dessa områden. Du kommer även att i vissa frågeställningar avlasta områdets domän-/linjearkitekt. Förutom att driva lösningsframtagningen och säkerställa att lösningen följer beslutade strategier och riktlinjer, möter funktionella och icke-funktionella krav medverkar du också i kravanalys samt i planering och koordinering av projektens leverabler, som stöd till projektledare och it-projektledare. Du kommer att ha ett nära samarbete med våra leverantörer rörande detaljerade krav, systemdesign, systemutveckling, test och leverans. Erfarenhet: Erfarenhet av upphandlingsuppdrag och att arbeta med underleverantörer Erfarenhet av att arbeta i en outsourcad internationell miljö, med underleverantörer för utveckling, Mångårig Erfarenhet som ansvarig lösningsarkitekt i projekt i större organisationer Erfarenhet av kravanalys Erfarenhet av IT-lösningar levererade som SAAS-tjänster Bred kompetens inom IT-arkitektur Meriterand: Erfarenheter av systemstöd för GRC, avtalshantering, styrdokumentshantering samt säkerhetskravställn Branscherfarenhet från tillståndspliktig verksamhet är meriterande Erfarenhet av teknisk projektledning är meriterande Erfarenhet av IT-lösningar levererade på Servicenow Erfarenhet från digitalisering av stödfunktioner t.ex. inom säkerhet och juridik"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72005-teknisk-specialist-adc-drift-2/",
    "roles": [
      "Teknisk specialist"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en Teknisk Specialist inom ADC-drift. Rollen kräver djup expertis inom federationsprotokoll och säker autentisering, med särskild fokus på SAML, OAuth och OpenID Connect, samt erfarenhet av att konfigurera och implementera F5 lösningar för säker och skalbar federering. Arbetet sker i en miljö där hög säkerhet och komplexa integrationer är avgörande. Huvudsakliga ansvarsområden: Implementera, hantera och optimera federationslösningar och säker autentisering med F5 Access Policy Manager (APM). Arbeta med federationsprotokoll som SAML, OAuth och OpenID Connect. Utföra felsökning och support inom dessa områden. Överföra kompetens till teamet. Hantera Single Sign-On (SSO)-lösningar och säkerhetsarkitekturer för federationer. Designa och implementera access policies i komplexa och säkerhetskritiska miljöer. Obligatoriska kvalifikationer: Omfattande erfarenhet av federationsprotokoll som SAML 2.0, OAuth 2.0, OpenID Connect (OIDC), inklusive Single Sign-On (SSO), attribute release policies samt hantering av signering, kryptering och verifiering av SAML Assertions och OIDC tokens. Gedigen kunskap om X.509-certifikat för signering och kryptering samt hantering av PKI-infrastrukturer kopplade till federationslösningar. Erfarenhet av att konfigurera och optimera F5 BIG-IP APM, särskilt när det gäller access policies, autentiseringslösningar och lastbalansering av federerade tjänster. Stark förståelse för TLS/SSL, IDP-initiated och SP-initiated federation, samt secure token services (STS) och hur dessa integreras med F5 lösningar för att säkerställa en sömlös och säker autentisering. Förmåga att skapa och presentera detaljerad teknisk dokumentation på svenska, inklusive design av federationslösningar, integrationsprocesser och tekniska specifikationer. Erfarenhet av att leda implementeringar och integrationer av federerade lösningar, både som teknisk expert och projektledare. Ett CV som tydligt beskriver erfarenhet av avancerade implementationer inom federationsprotokoll, säker autentisering, F5-produkter och storskaliga federationsmiljöer. Meriterande kvalifikationer: Bred erfarenhet som teknisk specialist inom komplexa IT-miljöer med särskild kompetens kring federation, autentisering och access management. Förmåga att hantera kunddialoger professionellt och bygga långvariga kundrelationer. Personliga egenskaper: Självständigt arbetssätt och förmåga att ta tekniskt ledarskap. Stark kommunikationsförmåga och kundfokus."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71975-projektledare-enhet-forandring-och-mojliggorande/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Göteborg",
      "Hybrid"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en engagerad, drivande och lyhörd projektledare med starka samarbetsförmågor, som samtidigt trivs med att arbeta självständigt. Arbetet sker både på plats hos vår kund och på distans. Vid resor mellan olika kontor föredras användning av kommunala färdmedel. B-körkort är ett krav. Huvudsakliga ansvarsområden: Driva och koordinera olika IT-projekt som beställs och initieras av kundens verksamheter. Hantera projekt med fokus på: Användarnära IT-infrastruktur. Fastighetstekniska system, där projektledaren ansvarar för IT-stödet som dessa system använder. Föra dialog med beställare för att tydliggöra krav och förväntningar inom ramen för beställningarna. Ansvara för genomförandet av både små och stora projekt med varierande komplexitet. Med stöd av etablerade arbetssätt och team driva projekten på ett professionellt sätt och ansvara för: Projektbudget Planering Uppföljning Dokumentation Hantera ett varierande antal projekt beroende på storlek och omfattning. De flesta uppdrag är IT-relaterade, men vissa projekt kan vara mer koordinerande eller av förändringsledande karaktär. Obligatoriska kvalifikationer: Minst 5 års erfarenhet som IT-projektledare (inom de senaste 10 åren). Gedigen och bred kunskap om användarnära IT-infrastruktur. Bred erfarenhet inom IT-infrastruktur. Mycket god erfarenhet av att leda virtuella kompetensteam. Utmärkt förmåga att dokumentera och presentera på svenska. Svenskt medborgarskap (krävs för säkerhetsklassning). Ett CV som beskriver erfarenheter inom relevanta områden. Meriterande kvalifikationer: Erfarenhet av arbete inom politiskt styrda organisationer. Erfarenhet av agila arbetssätt. Erfarenhet av stora och komplexa IT-miljöer. Erfarenhet inom hälso- och sjukvården eller medicintekniska system. Erfarenhet inom IT-infrastruktur och IT-säkerhetsarbete. Personliga egenskaper: Engagerad, drivande och lyhörd projektledare. Stark samarbetsförmåga. Trivs i en drivande roll och kan arbeta självständigt. Prestigelös och bekväm med att dela med sig av erfarenheter och idéer."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71961-senior-projektledare-forandring-och-mojliggorande/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Göteborg",
      "Hybrid"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en erfaren och driven senior Projektledare. Arbetet sker både på distans och från vår kunds lokaler. När resor mellan kontor krävs används främst kommunala transportmedel, och ett B-körkort är ett krav. Uppdraget gäller bemanning av deras projektet Slutdesign för kundens plattform (Hardware refresh). Obligatoriska kvalifikationer: Minst 5 års aktuell erfarenhet som IT-projektledare, inom de senaste 10 åren. Goda och breda kunskaper inom användarnära IT-infrastruktur. Gedigen förståelse för IT-infrastruktur i allmänhet. Dokumenterad erfarenhet av att leda virtuella kompetensteam med framgång. Mycket god förmåga att dokumentera och presentera på svenska. Svenskt medborgarskap krävs då säkerhetsklassning ingår. Ditt CV ska tydligt beskriva din erfarenhet inom relevanta områden. Meriterande kvalifikationer: Erfarenhet av arbete med specifika sektorer, såsom 5G. Erfarenhet av att arbeta inom politiskt styrda, större organisationer. Erfarenhet av att leda förändringsprojekt med ett agilt arbetssätt. Erfarenhet från komplexa och stora IT-miljöer. Personliga egenskaper: Du är en engagerad och drivande person som är lyhörd för andras behov. Samarbete är en av dina starka sidor, men du trivs också med att arbeta självständigt. Du är prestigelös och delar gärna med dig av dina erfarenheter och idéer. Förmåga att ta ansvar och självständigt driva projekt framåt."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71956-projektledare-51/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en engagerad och självgående Projektledare som har en stark förmåga att samarbeta med andra, men som även trivs med att arbeta självständigt. Du bör vara prestigelös och generös med att dela din kunskap och dina idéer. Arbetet utförs både på kontoret och på distans. Vid resor mellan olika kontor används i första hand kollektiva transportmedel. B-körkort är ett krav. En av vår kunds främsta digitaliseringsmål är att stötta verksamheterna i deras införskaffande och utveckling av IT-tjänster. Avdelningen för Infrastruktur och cybersäkerhet driver dessutom interna projekt och uppdrag som syftar till att följa den globala teknikutvecklingen. Vidare ansvarar de för att följa upp och kvalitetssäkra IT-leveranser inom projekt och uppdrag. Inom enheten Förändring och möjliggörande, som tillhör avdelningen Infrastruktur och cybersäkerhet, genomförs huvudsakligen projekt och uppdrag med teknisk inriktning. Organisationen är uppdelad i olika team som fokuserar på specifika kundgrupper. Ofta handlar det om utveckling och implementering av ny teknik inom infrastrukturområdet, där man använder kompetenser från linjeverksamheten och från olika leverantörskontakter. Obligatoriska kvalifikationer: Minst 5 års erfarenhet som IT-projektledare (ej äldre än 10 år). Bred och djup kunskap inom användarnära IT-infrastruktur. God kännedom om IT-infrastruktur. Gedigen erfarenhet av att leda virtuella kompetensteam. Mycket god förmåga att dokumentera och presentera på svenska. Självständig och drivande i din roll. Svenskt medborgarskap, då säkerhetsklassning krävs. CV som tydligt beskriver din erfarenhet inom relevanta områden. Meriterande kvalifikationer: Erfarenhet av IT-infrastruktur och IT-säkerhetsarbete. Erfarenhet från arbete i större organisationer med politisk styrning. Erfarenhet av att leda förändringsprocesser enligt agila metoder. Erfarenhet från stora, komplexa IT-miljöer. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71878-arkivarie-inom-information-och-arkivering/",
    "roles": [
      "Arkivkonsult"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en arkivarie inom information och arkivering. Enheten för information och arkivering, som är en del av vår kunds digitaliseringsarbete, ansvarar bland annat för att förvalta och utveckla kundens mellanarkiv. Enheten behöver förstärkning av en arkivarie, då mellanarkivkonceptet måste ses över och utvecklas. Planen är att utöka mellanarkiveringsmöjligheterna för flera olika informationsmängder med både kort- och långsiktiga bevarandekrav. Huvudsakliga ansvarsområden: Vara expert på bevarandefrågor inom offentlig förvaltning. Inneha tekniska, organisatoriska och kommunikativa kompetenser för att säkerställa att arkivmaterial bevaras och tillgängliggörs effektivt för nuvarande och framtida användare. Delta i utvecklingsteam och samarbeta med projektledare, IT-arkitekter, kravledare, informatiker, systemutvecklare och systemförvaltare kring design av framtida mellanarkiv. Vara pedagogisk och kunna förmedla komplicerad information till personer inom många olika områden. Skriva rapporter. Ha erfarenhet av att arbeta i en stor organisation, helst inom offentlig sektor, för att förstå kundens komplexa verksamhet, vilket underlättar arbetet och kortar ner inlärningstiden. Obligatoriska kvalifikationer: Utbildning i arkiv- och informationsvetenskap eller motsvarande. 8–10 års erfarenhet av arbete som arkivarie, där du har arbetat med följande: Genomföra bevarande- och gallringsutredningar. Utreda frågor gällande digitalt bevarande. Ta fram och tolka informationshanteringsplaner. Deltagit i upprättande av riktlinjer och styrande dokument. Erfarenhet av utveckling och genomförande av inleveranser till myndighetens e-arkiv. Utveckla processer för förvaltning av digitalt arkiverad information, exempelvis migrering, gallring och informationsstruktur i e-arkivet. Initiera plan för digitalisering av befintligt analogt arkivbestånd. Praktisk erfarenhet av strategiskt utvecklingsorienterat arbete inom information/arkiv i offentlig förvaltning, med en &#8221;blick för framtiden&#8221;. Erfarenhet av arbete med förstudier för system inom digital informationshantering/mellanarkiv. Erfarenhet av kravställning av system för digital informationshantering/mellanarkiv. Förmåga att rapportera på svenska, både i tal och skrift. Hög grad av självledarskap samt en vilja att dela kunskap och lära ut. Meriterande kvalifikationer Erfarenhet av agilt arbetssätt. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71852-tekniskt-projektledare-ngr/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Norrköping"
    ],
    "description": [
      "Uppdragsbeskrivning: För vår kunds räkning söker vi nu en projektledare där du kommer ha en nyckelroll i att byta ut delar av systemstödet för vår kärnverksamhet, som stödjer nära 400 fysiska butiker samt e-handeln i kundmötet. I detta uppdrag, som är en kombination av projekt- och förändringsledning, kommer du att leda delprojektet som ansvarar för att utveckla lagerhanteringssystemet för e-handelslager samt ansvara för förändringsledningen mot e-handelslagret för hela förändringsprogrammet som omfattar ytterligare 5 delprojekt. Du kommer att arbeta nära verksamheten i e-handelslagret, externa leverantörer, samt de andra projekten och projektledarna i programmet. Din förmåga att driva ett projekt framåt, kommunicera effektivt och hantera intressenter kommer att vara avgörande för att uppnå våra högt ställda mål. Placering är i Norrköping med regelbundna resor till Stockholm. Arbetsuppgifter: Leda ett externt team för utveckling av lagerhanteringssystemet genom att säkerställa rätt förutsättningar och krav från verksamheten. Ansvara för programmets kommunikation och förändringsledning gentemot personalen på e-handelslagret. Ansvara för att säkerställa rätt resurser på rätt nivå och budget. Proaktivt identifiera, utvärdera och hantera potentiella risker i projektet. Planera så att utveckling och förändringsledning är i synk med programmets planer. Förbereda för lansering, inklusive testning och pilotimplementering. Erfarenthet: Erfarenhet av framgångsrik projektledning inom IT och systemimplementering i en större kontext. God teknisk förståelse och förmåga att hantera dialoger med tekniska team och leverantörer. Erfarenhet av förändringsledning och förändringskommunikation. Utmärkt kommunikationsförmåga och bygga relationer med olika intressenter, både inom IT och verksamhet. Strukturerat och metodiskt arbetssätt med förmåga att hantera komplexa projekt. Flytande i både svenska och engelska. Erfarenhet av regulatoriska verksamheter, lagersystem, orderhantering eller e-handel är meriterande."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71741-projektledare-50/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en Projektledare. För att hälso- och sjukvården ska få största möjliga nytta av det nya IT-stödet krävs gemensamma processer och arbetssätt. Standardiseringen är en viktig del av förberedelserna för att vår kunds program ska kunna införas, och den involverar många medarbetare i vården. Huvudsakliga ansvarsområden: Ansvara för att samordna arbetet inom ett specifikt processområde. Säkerställa sammanhållning av flöden och processer i angränsande systemmiljöer. Leda ett team som utformar och driver arbetet framåt enligt beslutad plan och målbild. Samarbeta nära med leverantören för planering, koordinering och utveckling av processområdet. Vara delaktig i programmets andra projekt och framtida linjeorganisation för support och förvaltning. Bidra till ständiga förbättringar i en agil och tvärfunktionell arbetskultur. Obligatoriska kvalifikationer: Minst 10 års erfarenhet av att leda större projekt eller program. God förståelse för sjukvårdens processer och erfarenhet av verksamhetsutveckling inom hälso- och sjukvården. Erfarenhet av agila arbetsmetoder. Förmåga att leda inkluderande och coachande, där tillit och förtroende för medarbetarnas förmåga är centralt. Mycket god förmåga att planera, strukturera och genomföra arbete självständigt utifrån givet mandat. Proaktiv och lösningsorienterad, med förmåga att förutse och hantera utmaningar. Trivs i en föränderlig och ibland krävande arbetsmiljö. Flytande svenska i tal och skrift samt god förmåga att kommunicera på engelska i en internationell miljö. Meriterande kvalifikationer: Erfarenhet av vårdinformationssystem, t.ex. journalsystem. Erfarenhet från större hälso- och sjukvårdsorganisationer."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71648-projektledare-implementation-av-logex-costing/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en engagerad, drivande och lyhörd projektledare med en stark förmåga till samarbete. Du bör vara prestigelös och ha lätt för att lyssna på flera parter, men även kunna dela med dig av din erfarenhet och dina idéer. Huvudsakliga ansvarsområden: Projektet har tidigare överskridit fastställda tidplaner, vilket har lett till att vår kund nu befinner sig i en förändrad situation. Deras program för teknisk förvaltning planeras att tas i drift i november 2024. Därför omfattar uppdraget att: Säkerställa att kalkylverktyget samspelar med data från programmet. Säkerställa att data hanteras korrekt i kalkylverktyget. Säkerställa att utdata är tillfredsställande. Möjliggöra att den utdata som efterfrågas från olika plattformar görs tillgänglig. Uppdraget innebär att säkerställa implementationen av Logex Costing hos vår kund, med minst bibehållen funktionalitet. Detta omfattar bland annat: Teknisk installation. Sätta modeller för kalkylering avseende KPP (Kostnad Per Patient) och diagnostik (stödjande roll). Rigga datainläsningar från cirka 25 källor, inklusive kontroller. Implementera säkerhetshöjande åtgärder (skydda information, efterleva PDL). Genomlysning av rutiner, arbetssätt och förvaltning (stödjande roll). Utföra tester. Genomföra utbildning. Säkerställa utdata och rapportskapande (stödjande roll). Avveckla nuvarande applikationer. Obligatoriska kvalifikationer: Minst 5 års erfarenhet som projektledare för komplexa digitaliseringsprojekt. Erfarenhet av projekt inom uppsättning av modeller för kalkylering av kostnad per patient (KPP). Mycket god erfarenhet av att leda virtuella kompetensteam. Mycket god förmåga att dokumentera och presentera på både svenska och engelska. Förmåga att trivas i en drivande roll och arbeta självständigt. Svenskt medborgarskap, för att vid behov kunna säkerhetsklassas. Meriterande kvalifikationer: Mycket goda kunskaper om agila arbetssätt. Erfarenhet av projekt inom hälso- och sjukvårdssektorn. Erfarenhet av projekt där en extern leverantör vidareutvecklar produkten inom en agil förvaltningsorganisation, gärna enligt ramverket SAFe. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71255-projektledare-uppdragsledare-2/",
    "roles": [
      "Project Leader",
      "Projektledare"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning På kunds räkning söker vi nu en erfaren Projektledare/Uppdragsledare för att leda och koordinera arbetet kring kravinsamling, utvärdering och upphandling av en teknisk tjänst. Du kommer att arbeta nära vår kunds affärsverksamheter för att samla in och dokumentera deras krav, samt utforma ett förslag till hur lösningen skall styras och förvaltas. Den samlade kravmassan blir ett underlag för beslut om vidare upphandling. Ansvarsområden: Leda och koordinera projektet för kravinsamling, utvärdering och upphandling av en teknisk tjänst. Samarbeta med vår kunds affärsverksamheter för att förstå och dokumentera deras krav och behov. Genomföra utvärdering av nuvarande leverantör samt genomföra en översiktlig marknadsundersökning av motsvarande lösningar och leverantörer. Säkerställa att alla projektaktiviteter följer interna riktlinjer och externa regelverk. Förbereda upphandlingsprocessen. Rapportera till styrgrupp och andra intressenter. Identifiera och hantera risker och problem. Kvalifikationer: Du ska ha minst 5 års erfarenhet av projektledning, gärna inom IT eller tekniska tjänster. Du ska ha dokumenterad erfarenhet av kravinsamling och att arbeta nära affärsverksamheter. Du ska ha erfarenhet av att leda inköpsprocesser och förhandla kontrakt. Du har en stark analytisk förmåga och erfarenhet av att utvärdera tekniska lösningar. Du har utmärkta kommunikations- och samarbetsförmågor. Du har förmåga att arbeta självständigt och ta egna initiativ. Du har goda kunskaper i svenska och engelska, både i tal och skrift. Personliga egenskaper: Du är strukturerad och organiserad med förmåga att hantera flera parallella uppgifter. Du är lösningsorienterad och proaktiv. Du har en stark förmåga att bygga relationer och samarbeta med olika intressenter. Du är flexibel och anpassningsbar i en föränderlig miljö. Du kommer att arbeta på plats i vår kunds lokaler i Stockholm, med möjlighet till flexibilitet efter dialog med vår kund."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70723-projektledare-hr-digitalisering/",
    "roles": [
      "Project Leader",
      "Projektledare"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning  På kunds räkning söker vi nu efter en projektledare som kommer vara med att utveckla vår kunds digitala HR-resa. Uppdraget kommer att vara mångsidigt, där du kommer bidra till vår kunds utveckling inom digitalisering av HR:s processer för att skapa verksamhetsnytta. Primärt är det fokus på processtöd  inom HR kopplat till on och off-boarding. Rollbeskrivning: Som projektledare jobbar du på HR och då i nära samarbete med IT. Tillsammans ansvarar du och kunden för att ta fram en lösning som ger verksamhetsnytta och bidrar till ökad intern effektivitet inom processen för on- och offboarding Du kommer att ansvara för att en projektgrupp fastställs och att rätt resurser involveras under projektets gång. Du kommer att ansvara och hålla dig inom de ramar som är uppsatta för projektet, både ekonomiskt och det scope som är beskrivet i projektets styrkort och som ligger till grund för projektstart. Kvalifikationer: Du ska ha flerårig praktisk erfarenhet ifrån digitalisering och automatisering inom HR. Du ska ha minst (6) års praktisk erfarenhet i rollen som projektledare för digitaliseringsprojekt inom HR-området. Du ska ha minst (3) utförda uppdrag där du förvärvat dig erfarenhet av kravställning på HR-system (ex, lönesystem, rekyteringsystem, lärplattformar osv) Du ska ha minst (2) uppdrag av praktisk förändringsledning inom HR i en större organisation (500+ anställda) Mervärdeskrav: Akademisk eller yrkeshögskoleutbildning som är relevant för HR-området Minst (2) projektledaruppdrag i offentlig sektor eller regulatorisk styrd verksamhet Minst (2) års erfarenhet av agila och/eller iterativa arbetssätt Minst (2) uppdrag av att ha arbetat med marknadsanalyser av digitala lösningstyper inom HR området &nbsp; Förutom projektledning kommer uppdraget att innefatta, bl.a. process- och behovskartläggningar, livscykelhantering och förändringsledning inom vår kunds digitaliseringsresa. Du kommer behöva vara på plats i kundens lokaler minst 50% av veckan."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69857-senior-plattformsansvarig-autentiseringstjanster-region-skane-avrop-925/",
    "roles": [
      "Systemspecialist"
    ],
    "places": [
      "Lund"
    ],
    "description": [
      "Uppdragsbeskrivning: Vi söker dig med universitets- eller högskoleutbildning i kombination med en bred teknisk kompetens och lämplig arbetslivserfarenhet. Självklart har du ett särskilt intresse för katalog och autentiserings tjänster. Vi ser också att du har erfarenhet från tidigare plattformsansvar eller liknande ansvar. Meriterande är erfarenhet av olika autentiseringstjänster: IDP, ADFS, Single Sign On och federationslösningar samt grundkunskap inom e-legitimation, stark autentisering och elektronisk identitetshandling som används för säker identifiering av både personer och system. Då vi arbetar enligt ITIL4 är tidigare erfarenhet och/eller certifiering i detta också ett mervärde, tillsammans med erfarenhet från att framgångsrikt ha samordnat flera olika parter, interna såväl som externa. För framgång i arbetet vill vi att du är strukturerad och försedd med förmågan att se saker ur ett helhetsperspektiv. Genom ditt processtänk och genom att planera och prioritera löser du såväl det långsiktiga strategiska arbetet såväl som de akuta situationer som uppstår. Du gillar att förvalta en plattform och du är både nätverkande, kommunikativ, pedagogisk och förstår vikten av att kvalitetssäkra genom bl. a.  dokumentation. Det är inte du som utför de tekniska delarna av plattformen, det har du leverantörer som ansvarar för, men du leder och ser till att rutiner och processer fungerar och löser problemen när de inte gör det. Du kommer att ha dialog med olika parter som befinner sig kunskapsmässigt på olika nivåer vad gäller teknik och IT och vi värdesätter därför din kommunikativa förmåga att &#8221;prata IT&#8221; så att alla förstår. Du har förmågan att uttrycka dig väl i tal och skrift både på svenska och engelska. Du ser till att övriga Region Skåne har tillgång till tjänster inom autentisering, auktorisering, legitimering, spärr, samtycke och logg med målsättningen att åstadkomma säker åtkomst och säker hantering av information och resurser. I dialog med våra leverantörer, ansvarar du för utveckling av de berörda plattformarna samtidigt som du säkerställer att de är stabila och funktionella. Du har god kunskap kring hur digitala certifikat används, vilka som utfärdar dem och vad som händer om certifikaten inte är korrekta. Självklart jobbar du med kontinuerlig tjänsteförbättring samt vidareutvecklar tjänsterna till verksamheterna i Region Skåne. Arbetet innebär således att även hantera den långsiktiga, strategiska planeringen. Dina främsta ansvarsområden är att: planera, organisera och leda genomförandet av aktiviteter inom dina ansvarsområden. identifiera brister och ta fram nya lösningsförslag samt ansvara för att de implementeras ge stöd till projektledare och systemansvariga under och efter införande av autentiseringstjänster Du har ett tätt samarbete med såväl leverantörer som med den egna och andra förvaltningar inom Region Skåne. Administration och drift är outsourcat till vår leverantör men du kommer att ha huvudansvaret för plattformarna och det är du som ser till att processer och rutiner följs och fungerar. Då tjänsten innebär många kontaktytor är det viktigt att du gillar att vara spindeln i nätet i kommunikationen med bl a användare, leverantörer och certifikatutfärdare. Upgraded People tillsammans med Region Skåne agerar i enighet med och står bakom EUs och Sveriges sanktioner mot Ryssland och de som omfattas av dessa. Det medför att leverantörer [&hellip;]"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/62007-senior-uppdragsledare-sdv-migrering-region-skane-avrop-857/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Lund"
    ],
    "description": [
      "Uppdragsbeskrivning Publicerad på nytt då vi önskar få in fler CV Region Skåne implementerar med hjälp av Oracle Health ett digitalt vårdsystem för att ersätta ett antal applikationer som stödjer regionens vårdaktiviteter. Detta är det mest omfattande förnyelsearbetet i Region Skånes historia. För mer information se https://vardgivare.skane.se/tema/skanes-digitala-vardsystem-sdv/ SDV söker nu en uppdragsledare som rapporterar till projektledaren inom arbetsgrupp för Migrering (teknisk och manuell, samt arkivering). I rollen ingår du i utrullningsorganisationen i SDV. Teamet Driftstart ska på ett systematiskt sätt säkerställa aktiviteter som behöver genomföras och förberedas. Samt säkerställa att organisation och processer etableras för att hantera arbetet och att dessa integreras i den idag etablerade utrullningsorganisationen. Teamet ska säkerställa att driftstarten genomförs på ett sådant sätt och med ett sådant resultat att det stödjer en fungerande verksamhet efter att systemet har ”gått live”. Önskad kompetens: Du kommer driva delprojekt inom området migrering – därav krävs dokumenterade erfarenheter från tidigare uppdrag samt relevant kunskap inom projektledningsområdet. Stark muntlig och skriftlig kommunikationsförmåga för att effektivt kunna interagera med olika intressenter. Förmåga att hantera flera uppgifter samtidigt, organisera möten, och hålla reda på tidsplaner och deadlines. Förståelse för att arbeta med prioritetsordning och förmåga att genomföra rätt sak i rätt tid. Förmåga att identifiera och lösa problem snabbt och effektivt. Goda kunskaper i olika IT-verktyg och system som används inom projektledning, exempelvis MS Office, projektplaneringsverktyg (Agile + Vattenfall) och kommunikationsplattformar. &nbsp; Tillhör kategori: uppdragsledare &nbsp; OBS: rollen arbetar på plats på Medicon Village i Lund. &nbsp; Upgraded People tillsammans med Region Skåne agerar i enighet med och står bakom EUs och Sveriges sanktioner mot Ryssland och de som omfattas av dessa. Det medför att leverantörer som svarar på anbud för att leverera kompetens via Upgraded People till Region Skåne ger egen garanti om att leverantören ej omfattas av sanktionerna, och sedermera står bakom dessa med samma ståndpunkt. &nbsp; &nbsp;"
    ]
  }
]