[
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72775-junior-cloud-engineer/",
    "roles": [
      "Cloud Engineer"
    ],
    "places": [
      "Lund"
    ],
    "description": [
      "Assignment Description: The Car Cloud Platform organization within Software Digital develops and maintains cloud services globally to contribute to the overall connected experience for our customers. We build, provide and operate a highly secure run-time ecosystem for functions and applications serving our connected cars, and their users. We aim to optimize functional and organic growth by using standard cloud technologies with high level of synergies and re-use. With our car cloud solution, we provide cloud infrastructure, platform core &amp; services to support software development lifecycle (DevOps) by providing tools for fast feedback &amp; built-in quality. What you´ll do You can work in an ever-evolving agile way of working where you will be part of an empowered product team that strives for continuous learning and improvement. You and your team are, among many other things, responsible for the DevOps of the ingress gateways globally to the car cloud platform clusters. You will collaborate with your Product Owner to ensure the right functionality is being developed and estimate the size and complexity of the work to be able to plan upcoming sprints. You will determine and maintain the technical design in our area within the given architectural guidelines. Tech we use daily: SW Languages: Java (Spring), GolangFrameworks: Docker, Kubernetes, Spring, Istio Infrastructure: AWS Databases: Cassandra or similar (NoSQL), MySQL, Oracle, MongoDB Middleware: Kafka, JMS, IBM MQ, MQTT Tools: CI/CD Pipelines, GIT or similar Test automation: Unit test frameworks, Component test frameworks Monitoring: Splunk, Grafana, Prometheus Architecture: Micro Service Architecture Development methodology principles: gitOps, Scrum, DevOps Automation: Python Do you fit the profile? We believe you have a BSc degree or higher in computer science or equivalent. We believe that you are a fast learner who will thrive in an environment with experienced developers and cloud engineers. We believe that you have a strong interest in exploring various aspects of software development. Software development skills are important, but particular experience with all tech that you will use in this position is not expected. The ability and interest to learn is. For you to fully enjoy this opportunity, we believe that you have a genuine interest of working and developing in a product area. You embrace teamwork, collaboration and are eager to learn and develop new competences. If both parties are satisfied, the contract will transition into a permanent employment position, ensuring a continued and stable working relationship."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72727-devops-engineer-24/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en DevOps Engineer till kundens digitaliseringssatsning inom IOC och plattformar. Du kommer att vara en viktig del i utvecklingen av framtidens tjänster för patienter, invånare och medarbetare. Rollen innebär att bygga nya förmågor och utveckla tjänster för att bättre förstå och möta aktuella och framtida behov. Kunden erbjuder en flexibel arbetsmiljö, där du har möjlighet att arbeta både på distans och från deras kontor i Göteborgsområdet, beroende på verksamhetens förutsättningar. Huvudsakliga ansvarsområden: Som DevOps Engineer kommer dina huvudsakliga ansvarsområden att vara: Vidareutveckla och drifta vår kunds hostingplattform tillsammans med teamet. Arbeta i en agil och öppen organisation som befinner sig i en kreativ och intensiv utvecklingsfas. Bidra till att teamet utvecklar lösningar som möter deras behov av serverlösningar. Minska tiden det tar för applikationsteam att produktionssätta ett system genom optimering och automatisering. Standardisera och automatisera hostingplattformen för att öka effektiviteten. Arbeta med &#8221;Infrastructure as Code&#8221; (IaC) och säkerställa återanvändbara funktioner och en enhetlig serverpark. Implementera processer som förbättrar effektiviteten och minskar risken för fel. Tillhandahålla en hostingplattform som underlättar för användare att konsumera och drifta standardiserade servrar. Obligatoriska kvalifikationer För att kvalificera dig för rollen krävs följande: Minst 5 års erfarenhet av att arbeta i stora organisationer inom offentlig sektor. Gedigen erfarenhet av serveradministration inom stora Windows-miljöer. Omfattande erfarenhet av serveradministration inom Linux-miljöer. Erfarenhet av att implementera automatiserade processer och självbetjäningslösningar. Erfarenhet av agila arbetsmetoder. Förmåga att uttrycka dig väl i både tal och skrift på svenska och engelska. Svenskt medborgarskap, då tjänsten kommer att säkerhetsklassas. Praktisk erfarenhet av att arbeta med stora serverparker. Förmåga att skapa återanvändbara funktioner och självbetjäningslösningar genom script och API, för att minimera manuell inblandning i det dagliga arbetet. Meriterande kvalifikationer: Det är meriterande om du har erfarenhet av följande: Ansible/AWX. Microsoft Endpoint Configuration Manager (MECM/SCCM). OP5 och Systems Center Operations Manager (SCOM). Active Directory (AD) och Group Policies. Säkerhetsarbete för att säkra serverplattformar. Virtualisering med hjälp av VMWare. Automatisering genom script såsom PowerShell, Python eller shellscript. Erfarenhet av Scrum. Personliga egenskaper: Vi söker dig som: Är självgående och samtidigt en god lagspelare. Är nyfiken och har ett starkt driv att ständigt utvecklas. Har en vilja att dela med dig av kunskap och stötta dina kollegor. Har god kommunikations- och samarbetsförmåga då rollen innebär kontakt med olika delar av organisationen. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72620-devops-engineer-23/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a DevOps Engineer. In this role, you will be responsible for developing an automated system for building and testing software using model-based design as well as C/C++ programming. Their CI/CD infrastructure relies on OpenStack&#8217;s Zuul, along with Git and Gerrit, to automate the entire process, from software creation to delivering a binary file ready for deployment in their vehicles. You will be joining a team tasked with evolving their Software Factory, which supports the efforts of thousands of embedded software developers through its CI/CD pipeline. Main Responsibilities: Design, implement, and maintain automation processes to ensure software meets quality standards. Update and enhance existing tools and scripts to adapt to ongoing software changes. Research and integrate new tools to support developers in their workflows. Required Qualifications: Master’s degree in Computer Science, Computer Engineering, or a related field. Proficiency in C/C++ and Python. Hands-on experience with continuous integration tools. Strong understanding of software development methodologies and workflows. Additional Qualifications: Proficiency with Zuul. Embedded systems software development experience. Knowledge of Git and Gerrit. Experience with Ansible, cloud infrastructure, Docker, and Linux. Familiarity with MATLAB, Simulink, and TargetLink. Experience with issue tracking tools and Agile development processes. Desired Attributes: Strong communication skills and ability to work effectively in a team. Analytical mindset with a structured and methodical approach to problem-solving. Capability to juggle day-to-day tasks while maintaining a long-term vision. Eagerness to learn and adopt new tools and technologies."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72582-embedded-software-engineers/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client  in the automotive industry is currently seeking experienced Senior and Mid-level Embedded Software Engineers with strong skills in C, C++, Python, and Java, as well as a solid understanding of system architecture. Main Responsibilities: As part of an agile team, your key responsibilities will include: Optimizing performance and CPU usage Identifying and resolving memory leaks Visualizing boot times for software processes Qualifications: Proficient in C, C++, or Python for developing complex embedded software products Experience with Embedded OS, Linux, or QNX Familiarity with test automation tools (e.g., Pytest) Previous experience working in a Continuous Integration (CI) environment Expertise in embedded software optimization and resource utilization Familiarity with automotive communication protocols such as FlexRay and LIN (preferred) University degree in Computer Science, Electrical Engineering, Electronics, or a similar field Fluency in both spoken and written English Additional Qualifications: Knowledge of Android testing frameworks Experience with Android Automotive Platform A valid driver’s license (B-level) is ideal but not mandatory Desired Attributes: Self-driven with a proactive approach to problem-solving Capable of leading investigations and making informed conclusions"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72560-c-software-developer-android-automotive/",
    "roles": [
      "Developer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is looking for an experienced C++ Software Developer with expertise in Android Automotive. Are you excited about working on next-generation infotainment systems, developed in close collaboration with Google, based on Android Automotive? If so, they have an exciting opportunity for you. They are searching for a motivated, inquisitive, and detail-oriented team player to join their team, focusing on Navigation and Positioning. Main Responsibilities: Work as part of a small, cross-functional team that emphasizes quality and continuous improvement. Collaborate with team members to develop and improve the car’s navigation features, ensuring an excellent user experience. Engage in full-stack development using Java, Kotlin, C++, and Android development tools. Utilize the latest tools and technologies, working closely with partners and other teams to deliver cutting-edge software. Write automated test cases that run in a Continuous Integration (CI) environment to verify the developed features. Participate in real-world testing and troubleshooting in actual vehicles, providing hands-on insight into product performance. Required Qualifications: A Master’s or Bachelor’s degree in Electronics, Software Engineering, or a related field. At least 5 years of relevant experience in software development using languages such as C++, Python, Java, etc. Proven experience in Android platform development and Continuous Integration. Familiarity with Agile methodologies. Strong proficiency in English, both written and verbal. A valid driver’s license (B-level). Additional Qualifications: Android Automotive platform development. Automotive Infotainment systems. Working in the Navigation or Positioning domain. Desired Attributes: A naturally curious problem solver who thrives in a team-oriented environment. Ability to collaborate effectively with others to achieve shared goals. Flexibility in managing multiple tasks simultaneously. A self-driven individual who is quality-focused and excited by technical challenges."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72379-sw-developer-and-tester/",
    "roles": [
      "Developer",
      "Tester"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Software Developer and Tester within Voice User Interfaces &amp; Audio. If you want to be part of a team working on the next generation infotainment system based on Android Automotive, in close collaboration with Google, this opportunity is for you. You will play a key role in enabling the company’s vision of &#8221;Freedom to move in a Personal, Sustainable, and Safe way.&#8221; Main Responsibilities: In this role, you will work as part of a small cross-functional team, focused on delivering high-quality work and driving continuous improvements. Your responsibilities will include: Testing the Google Assistant within the infotainment system. Enhancing and optimizing the automated test framework for voice interactions. Testing the audio chain and ensuring readiness for Continuous Integration (CI). Conducting tests and troubleshooting in real vehicles, offering valuable insights into the product&#8217;s real-world performance. Required Qualifications: A Master’s (M.Sc.) or Bachelor’s (B.Sc.) degree in Electronics, Software Engineering, or a related field. A minimum of 3 years of experience in software development using languages such as Python, C++, or Java. Experience in Android platform development. Familiarity with Continuous Integration (CI) processes and Agile methodologies. Proficiency in English, both written and spoken. A valid driver’s license (B-level). Additional Qualifications: Experience developing for Android Automotive. Prior experience with Automotive Infotainment systems. Familiarity with Audio Input or Voice Assistant technology. Desired Attributes: Motivated and curious, with a strong focus on quality. A team player with the ability to work effectively in collaboration with others. Strong problem-solving skills and the ability to handle multiple tasks simultaneously. Driven and quality-conscious, with a passion for tackling technical challenges."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72361-test-engineer-test-automation/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Test Engineer &#8211; Test &amp; Automation. The company is redefining the automotive experience by simplifying people’s lives through innovation. They offer a unique opportunity to make a significant impact in a rapidly evolving industry, with considerable growth and personal development prospects. Research &amp; Development Role As part of the Research &amp; Development team, you will play a pivotal role in creating the next generation of luxury vehicles. Working alongside a global team of engineers, you will contribute to the development of cutting-edge, human-centric automotive technology designed to enhance the driving experience and make everyday life easier. If you have a passion for car design, connected technology, and creating exceptional user experiences, this role offers the perfect environment for you to excel. Electric Propulsion Software Department The Electric Propulsion Software division is a key player in the electric vehicle software development field. They are leading the shift towards electric mobility, contributing to the company&#8217;s vision of providing customers with a sustainable, personal, and safe driving experience. Within the Battery Control &amp; ECU Platform department, they are focused on developing in-house software for vehicle propulsion systems. This includes: Electric Drive inverters Traction battery control units Onboard chargers Main Responsibilities: In this role, your main duties will include: Developing and maintaining tests to verify ECU functionality at the ECU level. Working within a Python-based, automated test environment. Investigating, reporting, and managing software-related issues. Further developing and maintaining the automated test environment (which is developed in-house). Performing technical documentation and conducting manual tests as needed. Required Qualifications: You are expected to have the following qualifications: A degree in Computer Science, Electronics, or a related field, or equivalent professional experience. Experience in creating test cases from system and software requirements. Professional expertise in system testing and test automation. Proven experience in developing and executing automated tests. Python scripting experience. Familiarity with automotive interfaces such as CAN/CANFD and related protocols is highly recommended. Additional Qualifications: The following skills are considered advantageous: Knowledge of Autosar BSW. Experience working with Linux systems and shell scripting. Proficiency in version control systems such as GIT. Experience with ISO26262 standards. Familiarity with Unified Diagnostic Systems (UDS) and BSW. Experience with dSpace HIL systems. Work experience within the automotive industry. Desired Attributes: Strong commitment to delivering results. Team-oriented with excellent coordination, communication, and documentation skills. Proactive and persistent in achieving goals and driving cross-functional improvements. A structured approach to work and a passion for tackling technical challenges."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72226-senior-infrastructure-engineer-2/",
    "roles": [
      "Backend",
      "Engineer",
      "Infrastruktur"
    ],
    "places": [
      "Hybrid",
      "Stockholm"
    ],
    "description": [
      "We are looking for a Senior Backend Engineer that will join the team in our Platform mission that enables our engineers to effectively utilize cloud infrastructure by providing a platform for infrastructure composition. Our declarative infrastructure is built on top of Kubernetes and we work closely with Google to make sure our platform scales with the growing number of managed resources at us. What you&#8217;ll do: As a team, we build a platform that enables infrastructure as code at us, with the entire engineering organization as our users. The tech stack you’ll work on includes Kubernetes operators (typically in Golang); supporting backend services (in Java); utilities and scripts (in Python and Bash); analytics data pipelines (in Python and SQL); and a lot of declaratively managed infrastructure of our own (in YAML). Collaborate closely with our sister platform squads and become a valued member of an autonomous, cross-functional team. We want you to bring your whole self to work and strive to foster an environment that supports your individual growth. Who you are: A valued team player in an autonomous, cross-functional team that inspires others experienced in designing, analyzing, optimizing code, and troubleshooting large-scale distributed systems. Experienced with Kubernetes, GKE, and Google Cloud Platform. Knowledgeable in how to write distributed, high-performance services and experienced in deploying and operating services on Linux. Passionate about infrastructure as code Can use scripting languages where needed to glue pieces together Have experience with Java and/or Go Equipped with a systematic problem-solving approach coupled with effective communication skills and drive. Excited about working on a team where you constantly learn, experiment, and iterate quickly. Extra: *Engineers with a solid engineering background (MSc. in engineering of related) *Engineers with experience extending k8s, writing their own or maintaining k8s operators and CRDs *Experience within platform organisations is a plus *Experience with GCP is a plus"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72196-platform-engineer-5/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en Platform Engineer som ska bidra till digitalisering, IOC (Infrastructure Operations Center), plattformar och DevOps. Uppdraget omfattar att utveckla framtidens tjänster för patienter, invånare och medarbetare. Vår kund erbjuder flexibla arbetsformer, med möjlighet att kombinera arbete på deras kontor i Göteborgsområdet och distansarbete. Målet är att effektivisera processen för applikationsteamen att produktionssätta system samt att standardisera och automatisera hostingplattformen. Ett viktigt fokusområde är Infrastructure as Code (IaC), där återanvändbara funktioner och enhetlighet inom serverparken är centrala. Genom att implementera dessa principer strävar kunden efter att öka effektiviteten och minska risken för fel. Huvudsakliga ansvarsområden: Som Platform Engineer kommer du att: Samarbeta med teamet för att vidareutveckla och drifta kundens hostingplattform. Arbeta i en agil organisation och delta i ett team som befinner sig i en intensiv och kreativ utvecklingsfas. Bidra till utvecklingen av serverlösningar som tillgodoser både nuvarande och framtida behov från invånare och medarbetare. Utveckla nya funktioner och tjänster med fokus på att förenkla konsumtion och drift av standardiserade servrar. Obligatoriska kvalifikationer: Minst 1 års erfarenhet av arbete inom serverpark i offentlig sektor. Minst 5 års erfarenhet av arbete i större organisationer inom offentlig sektor. Mycket god erfarenhet av serveradministration på stora Windowsplattformar. Mycket god erfarenhet av serveradministration i stora Linuxmiljöer. Erfarenhet av att implementera automatiserade processer och självbetjäningslösningar. Erfarenhet av agila arbetssätt. God förmåga att uttrycka dig i tal och skrift på både svenska och engelska. Erfarenhet av att skapa återanvändbara funktioner och självservicelösningar via script och API Observera att tjänsten är säkerhetsklassad, vilket innebär att svenskt medborgarskap är ett krav. Meriterande kvalifikationer Ansible/AWX. Microsoft Endpoint Configuration Manager (MECM/SCCM). OP5 och Systems Center Operation Manager (SCOM). Active Directory (AD) och Group Policies. Säkerhetsarbete för serverplattformar. VMWare för virtualisering. Automation genom script, såsom Powershell, Python eller shellscript. Scrum-metodiken. Personliga egenskaper Vi söker dig som är: Självgående men även en lagspelare. Nyfiken och ständigt strävar efter att förbättra och utveckla dig själv. Villig att stötta och samarbeta med kollegor. Bra på att kommunicera och samarbeta med olika delar av organisationen, då rollen innebär omfattande kontakt med flera team. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72186-data-engineer-infrastruktur-cybersakerhet/",
    "roles": [
      "Ingenjör"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en dataingenjör som ska bidra till kundens digitalisering samt arbeta med IoC-plattformar och DevOps. Du kommer att ingå i deras DevOps-team inom Infrastruktur och Cybersäkerhet. Uppdraget innefattar att utveckla framtidens tjänster för patienter, invånare och medarbetare. Huvudsakliga ansvarsområden: Designa, utveckla, testa och underhålla robusta, säkra och skalbara lösningar för datalagring och databehandling. Bygga och underhålla data pipelines och automation. Bidra till utvecklingen av nya tjänster för att bättre möta invånarnas och medarbetarnas behov, både nu och i framtiden. Implementera principen &#8221;automatisera allt&#8221; för att skapa lösningar för både intern och extern användning av infrastruktur och plattformar. Arbeta med både implementering och förvaltning av olika förmågor kopplade till produkten. Fungera som en brygga mellan data scientists, dataanalytiker och IT-funktionen. Obligatoriska kvalifikationer: Omfattande kunskaper om Denodo. Erfarenhet av att bygga data pipelines och automation. Goda kunskaper i Python. Goda kunskaper inom SQL/NoSQL och erfarenhet av ETL/ELT-utveckling. Erfarenhet av datalager och data lakes. Erfarenhet av arbete med datahantering. Erfarenhet och kunskap om datavirtualisering. Erfarenhet och kunskap om data catalog tools. God förståelse för DevOps-metodik och agilt arbetssätt. Minst två års erfarenhet av att arbeta i organisationer och miljöer. Svenskt medborgarskap är ett krav eftersom tjänsten kommer att säkerhetsklassas. Meriterande kvalifikationer: Fördjupad förståelse för DevOps-metodik och agilt arbetssätt. Förmåga att uttrycka dig väl i tal och skrift på både svenska och engelska. Erfarenhet av en eller flera ledande databasmotorer. Erfarenhet och kunskap om datavirtualisering. Erfarenhet och kunskap om data catalog tools. &nbsp; Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72155-software-developer-19/",
    "roles": [
      "Developer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Software Developer for SUM &amp; TPMS SW Factory – Infrastructure &amp; CI. The role involves designing, developing, and maintaining the SUM &amp; TPMS CI pipeline and infrastructure. We are looking for someone with a deep understanding of CI/CD, DevOps, and a passion for delivering high-quality software solutions. Main Responsibilities: Build automation, including automated build systems for vehicle software. Integrate Unit/Component/Domain regression testing as part of the CI/CD process. Automate Unit/Component verification gates with SIL/MIL/HIL testing. Implement static code analysis, code linting, and style enforcement tools. Provide support for software release processes. Maintain HIL rigs for various components like ECUs and sensors. Develop and execute test frameworks for Vector CANoe tests in HIL rigs and SWDL gates. Analyze logs and trace issues within hardware and software under test, including fault injection. Collect and report data from HIL tests. Support software releases. Use containerization technologies like Docker for development and production environments. Design and implement CI/CD pipelines for continuous integration and delivery. Write unit, integration, and end-to-end tests to ensure code quality and reliability. Perform code reviews and follow best practices to maintain code quality and consistency. Provide support to other teams for the integration of HIL tests into CI/CD pipelines. Assist other development teams with optimizing test execution time and reporting test results. Collaborate with product owners, designers, and other developers to deliver features and enhancements. Participate in agile ceremonies such as sprint planning, stand-ups, and retrospectives. Mentor and guide junior developers. Required Qualifications: Experience with DevOps practices, including CI/CD pipelines. Familiarity with automated verification systems and software release processes. Knowledge of: Feature branch strategy Traceability and data coverage C, Python, MATLAB Gerrit, Zuul CI, Jenkins, Artifactory, Robot Framework, Green Hills PPC, Polyspace, BlackDuck, Vector Version control systems, particularly Git. Required Attributes: Strong problem-solving skills and attention to detail. Excellent communication and teamwork abilities. Ability to manage time effectively and meet deadlines."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72149-senior-devops-technician-2/",
    "roles": [
      "DevOps Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a senior DevOps technician living in or near Gothenburg to join their office on a regular basis. The team’s responsibility is to provide and maintain services such as: Artifactory (a binary management system) Black Duck (a software composition analysis tool) SonarQube (a static code analysis system) Polyspace Access (a presentation tool for Polyspace Bugfinder) These tools are used by several thousand developers within our client’s organization. The team is committed to improving and automating these services to enhance the lives of their users. Currently, the team consists of four DevOps engineers who specialize in technologies and platforms such as: Azure AWS Terraform Kubernetes Argo CD How they work: Collaborate closely with various stakeholder teams to better understand their needs. Improve key characteristics of the services offered, including user experience, performance, scalability, resource utilization, supportability, maintainability, and observability. Automate service management. Implement a GitOps approach to operations. Provide self-service options and documentation for end-users. Offer expert-level support for their services. Required Qualifications: Outspoken and willing to actively participate in brainstorming sessions. Proactive, with a knack for finding new solutions to technical challenges or improving ways of working. Curious, eager to learn, and able to think outside the box. A true team player with excellent communication and collaboration skills. Confident in working with Linux and Git. Solid understanding of CI/CD pipelines. Experience with Kubernetes and Docker. Good knowledge of Azure and/or AWS. Broad understanding of IT infrastructure and its components to help diagnose and resolve incidents affecting the tools. Additional Qualifications: Experience with Azure Cloud and Azure-managed services. Experience with the GitOps way of working. Expertise in Kubernetes. Experience with Artifactory, Black Duck, and SonarQube. Knowledge of Polyspace Access. Familiarity with high-availability applications. Proficiency in Python."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71461-full-stack-developer-javascript-2/",
    "roles": [
      "Developer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Full Stack Developer (JavaScript) with DevOps experience for Continuous Integration (CI) applications. Our client believes that curiosity and a deep commitment to understanding people are key to future success. They work together to create technologies and innovations for safe, sustainable, and convenient mobility. The digital future is being developed with a human-centric mindset, using Agile/DevOps practices. This role is part of the Continuous Integration Infrastructure team, which develops CI tools for the pipeline, one of the largest software automation chains in Sweden, connecting complete vehicle systems to software applications. As a developer and DevOps engineer, you will be responsible for moving requirements from review to production while working with code reviews and architecture planning to ensure high quality and quick changes. Main Responsibilities: Work as a SW developer in an agile, cross-functional team focused on implementing the CI-pipeline. Perform software design, development, testing, and end-user documentation. Build user experiences using frontend technologies and support end users. Collaborate with top DevOps experts on a team skilled in JavaScript, Node.js, React, Python, Bash, and software architecture. Participate in all stages of development, from requirements gathering to production code deployment. Contribute to DevOps practices, building innovative products and services that deliver customer value. Collaborate with the team to manage and develop the CI pipeline, combining and developing various tools. Take ownership of Visualization tools for the CI pipeline, infrastructure management, and software baselines. Required Qualifications: Proficiency in both backend and frontend development, with a strong background in JavaScript (minimum 5 years working experience with ES5 or later). Strong experience with CI/CD systems and software development. Experience writing and appreciating the value of tests. Expertise in the following technologies: JavaScript Node.js React Next.js Python MongoDB Linux Gerrit Docker Kubernetes Shell scripting (Bash) Cloud infrastructure (preferably Azure) Additional Qualifications: Experience with RabbitMQ, Redis, Git, GitOps tools (e.g., Flux CD or Argo CD), Kubernetes, and Infrastructure as Code (IaC) tools such as Ansible, Terraform, or Pulumi. At least 4+ years of documented experience working within IT as a developer. Previous experience working with requirements and direct client contact. Experience with data analytics tools. A solid understanding of the Agile development process. Familiarity with DevOps methodologies and CI/CD development. Desired Attributes: Curiosity and open-mindedness toward new technology and programming languages. Continual striving to develop skillsets by networking internally and externally. Willingness to develop a T-shaped profile by expanding knowledge in multiple specializations. Understanding of Agile team principles and ceremonies. Interest in the user journey and understanding user needs for the product team&#8217;s outcomes. Ability to network with stakeholders when necessary for technical elicitation. Outgoing, easy to communicate with, and patient. Self-motivated and proactive in initiating contact with new people."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71268-applikationstekniker/",
    "roles": [
      "Application Engineer",
      "Tekniker"
    ],
    "places": [
      "Sundsvall"
    ],
    "description": [
      "Uppdragsbeskrivning På kunds räkning söker vi nu en applikations driftstekniker inomWindows och Linux. Uppdraget är delat up i två delar; Del 1: 50% av uppdraget förutsätter teknisk kompetens omWindows operativsystem samt erfarenhet från applikatorisk drift och underhåll i Windows server miljö. Du ska ha kunskap om administrativa stödsystem som tex EESSI/RINA (ettsystem som tillhandahålls via EU) och stöder handläggning mellan EU-anslutna länder. Del 2: 50% av uppdraget förutsätter även teknisk kompetens inom containerplattform, Linux och opensource. Arbetet som applikations driftstekniker innebär både slut användarkontakter samt intern problemlösning och felsökning i olika team konstellationer. Allt arbete sker utifrån ITIL:s ramverk och dess processer. SKA-krav: Du ska ha minst (2) års erfarenhet av arbete som applikations driftstekniker EESSI/RINA och WindowsServer. Du ska ha minst (2) års erfarenhet av opensource applikationen RODA på Linux och container plattform. Du ska minst (2) års erfarenhet av myndighetssamverkan. Du ska ha minst (2) års erfarenhet av arbete med kvalitetssäkring av tekniska leveranser från externa leverantörer. Kvalitetssäkring av leveranser ska ha gjorts tillsammans med samverkande myndighet/myndigheter för att säkerställa ett enhetligt IT-stöd anpassat till respektive myndighets verksamhetsprocesser. Du ska ha minst (2) års erfarenhet av samverkan med andra myndigheter. Med samverkan avses gemensam förvaltning/styrning och ledning. Du ska ha minst (2) års erfarenhet av kvalitetssäkring av leveranser ska ha gjorts tillsammans med samverkande myndighet/myndigheter för att säkerställa ett enhetligt IT-stöd anpassat till respektive myndighets verksamhetsprocesser. Bör-krav: Du bör ha jobbat med ITIL Du bör ha jobbat med scripting , Bash, python eller liknande. Du kommer initialt arbeta från vår kunds lokaler i Sundsvall, distans är möjligt när verksamheten tillåter."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71043-test-engineer-ad-adas-track-testing/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client is currently seeking a Test Engineer to join their AD/ADAS track testing team. Our client follows a people-centric philosophy with a mission to provide personal, sustainable, and safe mobility solutions. Their commitment includes simplifying customers&#8217; lives through advanced technologies, enhancing global impact while protecting both individuals and their communities, fostering a diverse, inclusive, and collaborative work environment, and encouraging talent development to help employees reach their full potential. You will be part of a journey focused on creating future innovations in safety, autonomous driving, and electrification. The company believes that being curious and truly committed to understanding people is the key to future success. They care about others and work together to create new technologies and innovations for safe, sustainable, and convenient mobility. Vehicle &amp; Rig Testing Group The Vehicle &amp; Rig Testing group performs objective verification and validation activities according to customer requirements in the following areas: Driverless systems AD (Autonomous Drive) ADAS (Advanced Driver Assistance System) V2X (Vehicle to Everything) Chassis objective testing (Vehicle dynamics and Clearance) The activities are performed both in rigs and on the test track. During the winter season, they support expeditions at tracks in southern Europe and northern Sweden. With state-of-the-art test equipment, they ensure durability, comfort, performance, reliability, and safety in vehicles through verification and certification activities. Main Responsibilities: As a Test Engineer, you will: Plan, prepare, and carry out tests on the test track Have technical, operational, and safety responsibility for the test setup and procedure, including rigs and equipment Improve and maintain test equipment to meet current and new testing standards Collaborate with stakeholders in developing new test methods Develop test equipment and digital tools, often working with other companies and universities In this role, you will use state-of-the-art equipment like driverless steering robots and self-propelling soft targets to develop world-leading vehicle functions. You will be part of a highly skilled team and have the opportunity to: Develop and lead new test methods, systems, and components Participate in research and investment projects Continuously work on advancing AD, ADAS, and V2X functionality Qualifications: M.Sc. or B.Sc. in Mechatronics, Electronics, or a related field Good skills in Electronics, Control, and Automation Experience in programming (Python preferred, C and C++ are meritorious) Fluency in English (spoken and written) Swedish driving license (B) Additional Qualifications: Knowledge of measurements and signal processing (e.g., Vector tools like CANalyzer, CANoe, CAPL) Familiarity with communication networks such as LIN, CAN, Ethernet, SOME/IP Experience working with hardware and/or measurement equipment Experience in AD (autonomous drive) and V2X systems You should enjoy working with hardware, ensuring measurement accuracy, and troubleshooting technical issues during testing, sometimes under time pressure. Desired Attributes: Team-oriented and innovative Positive and proactive in your approach Structured and well-organized, with a focus on quality and customer satisfaction"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70972-senior-dataarkitekt-data-engineer-region-skane-avrop-945/",
    "roles": [
      "Data Engineer"
    ],
    "places": [
      "Lund"
    ],
    "description": [
      "Uppdragsbeskrivning Region Skåne befinner sig på en spännande resa mot att bli en datadriven region. Avgörande för att utveckla vår hälso- och sjukvård inför framtiden är att stärka vår förmåga att tillvarata värdet av vår data. Genom att öka tillgängligheten till högkvalitativa data och utveckla verksamhetens kompetens att använda denna möjliggörs nya arbetssätt och metoder inom planering, forskning, resursoptimering och innovation. Därför söker vi nu en driven dataarkitekt/data engineer till vårt team av trevliga, samarbetsvilliga och kunniga kollegor som jobbar med utvecklingen av våra nya plattformar för data, API:er och AI. Vi söker dig som har en gedigen praktisk erfarenhet inom dataplattformar / Data Management. Du har erfarenhet av hela kedjan från kravinsamling till implementation och test. Du är nyfiken på att hela tiden lära dig nytt, som du gärna vill tillämpa och dela med dig av. Du är pragmatisk och har förmågan att skapa goda relationer med andra människor. Du är strukturerad, självgående och kvalitetsmedveten. Som dataarkitekt/data engineer tillhör du ett centralt utvecklingsteam som bygger plattformar på den allra senaste tekniken inom datahantering, API:er och AI. Du arbetar tillsammans med andra data engineers, produktägare, systemutvecklare, testare och andra arkitekter. Vår dataplattform skall kunna hantera flera Petabyte med data för Business Intelligence, avancerad analys och AI med mycket hög prestanda. Arbetet innebär att: Ansvara för design av delar av vår nya data- och analysplattform Delta i planeringen av färdplan för våra plattformar Samla in krav och önskemål från användare och andra intressenter Beskriva features och user stories för vår backlog Utvärdera och förslå lösningar på krav och önskemål Supporta, förvalta och felsöka våra lösningar Stödja data engineers och andra utvecklare Aktivt delta i implementationsarbetet Dokumentera arkitekturen och lösningarna Utveckla och beskriva säkerhetsåtgärder för våra plattformar Planera och driva arbete med test av våra plattformar Ge råd och stöd i tekniska designval och arkitekturfrågor Du har: Mycket god kunskap om arkitektur och design av datalager, datasjöar och data lakehouses. Mycket god kunskap om Microsoft SQL Server / Azure SQL databaser och T-SQL. Mycket god kunskap om ETL-utveckling. God kunskap om Business Intelligence. God kunskap om informationssäkerhet. God kunskap om utveckling i C#. God praktisk erfarenhet av att etablera och implementera datalösningar. Du har en gedigen bakgrund inom data warehousing och har gjort resan till molnet. God förmåga att förstå verksamhetens behov. God pedagogisk förmåga att beskriva och presentera lösningsarkitektur, både muntligen och skriftligen. Meriterande: Erfarenhet av Databricks, Microsoft Fabric, Azure Synapse och Power BI. Erfarenhet av Biml eller andra automatiseringslösningar. Erfarenhet av DBT. Erfarenhet av att etablera plattformar från grunden. Erfarenhet av AI, Machine Learning och avancerad analys. Erfarenhet av Data Governance. Erfarenhet av Master Data Management och Data Quality Management. Erfarenhet av att jobba enligt Data Mesh, Data Fabric och DataOps. Erfarenhet av medallion-arkitektur. Erfarenhet av utveckling i Python. Erfarenhet av hälso- och sjukvårdsverksamhet. Relevanta certifieringar inom exempelvis Azure. Tillhör kategori: Systemarkitekt &nbsp; Startdatum och omfattning är öppet för diskussion. Möjlighet finns till förlängning av uppdraget."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70344-hil-development-engineer/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a HIL Development Engineer. Their development centers focus heavily on software (SW), and they are taking a bold step forward by introducing a centralized compute platform in their next-generation vehicles. This platform will host most of the active safety, driver support, and vehicle motion control software. This centralized architecture will connect all exterior sensors to a central computer, enabling: In-house software development Continuous innovation on a stable compute platform Superior customer offerings Together with their partners, the client is building a modular, service-based perception platform to lead in safety and driver support applications. This innovation sets the stage for future safety advancements and autonomous drivingfeatures, fulfilling their mission of providing safe, personal, and sustainable mobility as they work toward a future of Zero Collisions. In their next-generation vehicles, the client is developing a computer-in-the-car architecture, essential for driving innovation in areas such as: Vehicle Motion Protective Safety Advanced Connectivity Machine Learning Autonomous Drive Their goal is to create a Vehicle Control Unit platform using cutting-edge technologies like DriveOS and NVIDIA’s latest chip technology, combined with traditional car signaling systems. This core computer and platform will: Simplify software and application development Provide a safe, reliable, and secure platform to boost innovation and development speed The Hardware In The Loop (HIL) test environments are built around this computer-in-the-car architecture. These setups integrate vehicle simulators and real hardware components to emulate a real vehicle, including all relevant dynamics. The team is responsible for developing and maintaining these test environments, ensuring they are capable of executing critical test cases for platform, software, and function verification. The hardware-based environments are state-of-the-art test setups, essential for verifying software before the final product is launched. In this role, you will be working in a fast-paced, innovative environment, tackling daily challenges and contributing to groundbreaking advancements in automotive technology. Main Responsibilities: Work in a small cross-functional team with a high focus on quality and continuous improvements. Define, set up, and configure Hardware In The Loop (HIL) test environments to support current and future projects. Deploy software applications on core computers and model with Matlab and Simulink. Enable test automation, driving toward Continuous Integration (CI) and Continuous Deployment (CD). Collaborate closely with other groups at the client company, suppliers, and cross-functional teams. Grow your understanding of Next-Generation Vehicles and the Software Platform, especially in domains such as Vehicle Motion Control, Protective Safety, and Autonomous Driving. Required Qualifications: Education in M.Sc or B.Sc in Electronics, Physics, Mechatronics, Software Engineering, or similar. At least 2 years of experience with dSPACE HIL rigs. At least 2 years of experience with dSPACE development tools (e.g., ControlDesk, ConfigurationDesk, ModelDesk, Bus Manager, Aurelion, etc.). At least 2 years of experience with Matlab/Simulink development. Fluent in English, able to communicate effectively with all types of stakeholders. Additional Qualifications: Vehicle Communication: Knowledge of CAN, LIN, FlexRay, Ethernet, etc. Programming Skills: Expertise in Matlab and Python. Agile Development: Familiar with Agile methods of working. Sensing Technologies: Knowledge of [&hellip;]"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70046-senior-software-developer-java-and-elasticsearch/",
    "roles": [
      "Developer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Senior Software Developer with expertise in Java and Elasticsearch. Our client believes that curiosity and a genuine commitment to understanding people are key to future success. They are a team of people who care about others, working together to create new technologies and innovations for safe, sustainable, and convenient mobility. They are part of Car Software Development Solutions, a division within our client&#8217;s Software Digital department in Engineering. They develop, provide, and maintain an extensive suite of digital solutions designed to enable best-in-class vehicle software development. To achieve this, they work closely with their R&amp;D organization and other departments within the client’s organization. Their solutions cover Complete CI Tool Chains, High-Performance Computing, and other tools for Software Development and Engineering. The team is diverse and engaged, consisting of 50 members divided into 7 product teams. Main Responsibilities: In this role, you will: Develop and maintain a sophisticated metadata management platform to support Autonomous Drive development. Ensure smooth daily operations to help users and the business maximize the benefits of the big data collected from test and customer vehicles worldwide. Act as a Subject Matter Expert (SME) for the AD/ADAS (Autonomous Drive/Advanced Driver Assistance System) metadata domain, collaborating closely with the product owner, business stakeholders, and the architectural community. Contribute to the maintenance and development of coding standards and best practices within the team. Participate in planning, high-level design, evaluation and improvement of existing solutions, and implementation of new solutions. Support the optimization of data usage, integration of new data sources, and improvement of data processes and pipelines. Be empowered to solve issues and ensure users receive the services they need. Development and maintenance of the platform’s backend, frontend, and Elasticsearch configuration. Participating in testing, deployment, and operation of application services. Driving data pipeline architecture and information models in collaboration with team members and business stakeholders. Capturing business needs and translating them into solution designs. Contributing to the evolution of coding processes, standards, and ways of working to improve quality and delivery speed. Maintaining and, to some extent, developing the platform&#8217;s cloud infrastructure. Engaging with the stakeholder and user community to understand platform usage, requirements, and needs. Required Qualifications: To succeed in this position, you should have the following qualifications: Java: 5-6 years of experience. Python. Experience in building fast and scalable applications using Elasticsearch. Kubernetes: 3 years of experience. Knowledge of PostgreSQL, Spring Boot, Swagger, Groovy, and working with CI/CD tool chains. Application Security skills. Additional Qualifications: JavaScript. TypeScript. ReactJS. GraphQL. Application development using Azure cloud services. Linux. Desired Attributes: Ability to work in an Agile environment. Strong communication skills and a team player with a positive attitude."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70037-hil-engineer-sw-developer-ci-devops/",
    "roles": [
      "Developer",
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a HIL Engineer / SW Developer &#8211; CI / DevOps to join their RigOps team. Main Responsibilities: Monitor and manage around 200 component HILs as one of two engineers focusing on rig operations in the lab. Design and order new rigs to ensure stable operations, which are crucial for continuous development. Collaborate closely with the cloud infrastructure team and Software Test Center to ensure stable rig operations. Utilize Python development skills to enhance rig monitoring systems when not working directly on the rigs. Work with CI teams to improve rig usage and optimize processes. Develop and maintain CI infrastructure (as code) in collaboration with all Infotainment CI teams for the current and future generations of head-unit ECUs (SPA1, SPA2, and SPA3). Support approximately 30 development teams through the CI infrastructure. Tools and Technologies: Our client&#8217;s Infotainment system is based on Android Automotive OS, with close collaboration with partners such as Google, Apple, Aptiv, Microsoft, QNX, and Qualcomm. The CI teams work with various tools, including: Jenkins, Gerrit/GIT, Artifactory, SonarQube, Cloud/Azure, Python, Bash, Linux, Ansible, Terraform, MongoDB, and Docker. Qualifications: Background as a SW Developer or HIL Engineer. Experience with RigOps, CI, DevOps, or Cloud (Azure). Proficiency in Python development."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70023-software-engineer-112/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Software Engineer to join their development team. In this role as a Developer, you will be part of a fast-paced team delivering state-of-the-art functionality and calibrations. You will utilize various software tools used for different parts of the development process and will be responsible for all phases of development—from design and implementation to vehicle testing and fine-tuning of functionality. The Power Electronics Software department at our client’s organization is proud to be one of the most successful players in software development for Electric Vehicles. They deliver system solutions and software functionality for the Inverters in their electrified vehicles. Their vision is to deliver the best and most innovative functions to the market and continuously evolve their software platform. The Motor Controls team is developing an in-house Electric Motor Control Application from the ground up. The core functionality of the software is to realize the requested electric machine torque in the most optimal way, given the current operating conditions. Because the software is being developed from the ground up in an embedded environment, the scope of the team is comparatively large, as it is responsible for the entire development chain: architectural structure, concept studies, development environment, functionality development, software verification (unit testing, MIL, SIL, HIL, and rig/dyno), documentation, and requirements review. The team uses Simulink and code generation for application software, and direct C code for the lower-level code needed for the inverter drivers and communication. The way of working includes using Git and Gerrit with short iterations between implementation and team feedback. Qualifications: Master of Science in Electrical Power Engineering / Power Electronics / Control Theory Expertise in electric machine controls (PMSM, IM, etc.) At least 5 years of full-time industry experience System safety competence (e.g., ASIL standards) Embedded software development experience Expert knowledge of MATLAB Simulink for controls development Familiarity with modern integrated development environments and debuggers Experience in other programming languages such as Python, C, C++ Experience in calibration activities in test rigs and vehicles Knowledge of AUTOSAR structured architecture, workflows, and toolchains Advanced proficiency in the English language, with the ability to explain and understand complex solutions Holds a valid driver’s license Desired Attributes: Passion for the development of complex mechatronic systems within vehicle electrification, electronics, and embedded systems. Enjoy driving engineering challenges from the business case and concept stage through to mass production. Senior experience within the Power Electronics field and a natural initiator committed to delivering the team’s objectives with high precision and quality. A team player who contributes to bringing out the best in fellow team members and actively works to expand their professional network."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69894-senior-data-engineer-5/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Senior Data Engineer within their Engineering Data Hub. This role is based in Gothenburg, and you will be expected to work primarily from their Gothenburg office. Our client is making bold digital visions come true, aiming to lead the automotive world by creating a digital ecosystem designed to simplify customers&#8217; lives. They are looking for curious, creative individuals who want to make a difference through innovative thinking. On a journey to redefine the automotive customer experience through digital technology, the focus areas include Electrification, Autonomous Drive, and Shared Mobility, all aimed at enabling personal, sustainable, and safe mobility. Software engineering is playing an increasingly important role, with more development being done in-house for better integration and continuous improvement. Their data vision focuses on driving innovation and decisions with trusted data, tackling challenges through robust designs and flexibility. As part of the Engineering Data Hub, you will join a fast-paced, fun environment where the mission is to deliver trusted data and insights to improve product performance, processes, and customer experiences. The data engineering team bridges the gap between data producers and consumers, aiming to enhance efficiency in data product creation and platform capabilities. Main Responsibilities: Provide support, guidelines, and best practices for creating and operating data products. Create and maintain data products based on business requirements. Collaborate with the Product Owner to ensure proper functionality, break down tasks, and plan sprints. Maintain the technical design within architectural guidelines and collaborate with stakeholders and system architects. Tech they use daily: Programming Languages: Python, Apache Spark, Bash Table Formats: Delta Cloud Platforms: Azure Data Platforms: Databricks, Snowflake Other Tools: Docker, GitHub Required Qualifications: Minimum 8 years of experience in related fields. Fluent in English, both verbal and written. Deep knowledge of modern data architecture principles. Extensive hands-on experience in data pipeline design, development, and operation. Comfortable working independently and collaboratively in an agile environment. Strong understanding of data modeling, data access, and data storage techniques. Experience with cloud technologies (Azure, AWS). Knowledge of data privacy and protection tools. Pragmatic approach to balancing ideal and functional solutions. Additional Qualifications: Knowledge of Software Engineering, System Design, SQL, Orchestration Tools (Airflow/Prefect/Dagster), Data Streaming (Apache Kafka), CI/CD, IaC, GitOps, DevOps, and Networking. Experience applying product thinking to data projects. Experience with data governance and modern data architectures such as data mesh. Experience creating reports to convey business insights. Desired Attributes: Proactive, problem-solver, and flexible team player. Eager to learn and handle daily challenges with a service-minded approach. Adaptable to a high-paced, fast-changing environment, driven by a sense of urgency and curiosity. Ability to build trust and influence others with a company-aligned mindset. Strong communication, analytical, and organizational skills. Automotive industry experience is meritorious."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69890-data-engineer-25/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking two Data Engineers to join their AD and ADAS Analytics team within the AD and ADAS Functions department, part of Safe Vehicle Automation. In this role, you will analyze and optimize data related to autonomous driving (AD) and advanced driver-assistance systems (ADAS), contributing to business objectives, performance tracking, and identifying areas for improvement. Our client is committed to leading in innovation, safety, and electrification. You will help develop advanced data-driven insights that shape the future of mobility. Our client aims to redefine car ownership and driving experiences by combining advanced technology with innovative services. The AD and ADAS Analytics team collaborates with leading industry partners to provide essential insights into AD/ADAS performance. You&#8217;ll develop and maintain data pipelines and dashboards that support key business decisions, ensuring world-class safety and performance in AD/ADAS functions. Main Responsibilities: Develop, maintain, and optimize data pipelines to handle large-scale fleet data related to AD/ADAS functions. Create and deliver dashboards that track business KPIs (e.g., crash boards, functional usage) and provide real-time insights. Measure and report on AD/ADAS business objectives, fulfillment, and performance trends. Collaborate with cross-functional teams to capture analytics requirements and drive data engagements. Use data-driven insights to support the safe and efficient launch of AD/ADAS functionalities. Required Qualifications: Strong experience in data engineering, with proficiency in Python, SQL, and cloud platforms (e.g., AWS, Azure, or GCP). Expertise in building data pipelines, ETL processes, and handling big data technologies (e.g., Hadoop, Spark). Familiarity with data visualization tools (e.g., Tableau, PowerBI) and real-time analytics. Experience in the automotive industry, especially AD/ADAS systems, is a plus. Additional Qualifications: Experience with fleet data collection and analysis. Strong analytical and problem-solving skills, with a focus on safety and performance metrics. This consultancy role offers an exciting opportunity to work with our client on cutting-edge technologies and contribute to the future of autonomous driving. Apply now to help shape the future of safe vehicle automation!"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69652-senior-software-developer-for-sw-platform-2/",
    "roles": [
      "Developer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Assignment Description Our client in the automotive industry is currently seeking a Senior Software Developer for their software platform. Our client is at an exciting point in their transformation from traditional cars to a fully electric architecture. This will be a challenging journey, and they hope you would like to be part of it! They are developing new technologies to lead in safety, autonomous driving, and electrification. If you want to grow alongside talented individuals creating the future of automotive technology, this could be the right opportunity for you. Core System Components (ARTCSC) Department At the Core System Components (ARTCSC) department, within Software &amp; Electronics Platforms, they develop Zone Controllers for the new platform. This is the biggest challenge for the new platform, as they will launch the base software for new multi-function units. These units will include: Body Controllers I/O Controllers Electrical Power Distribution Units Gateways Electrical Power Supply Units They work with solutions from early concept stages to industrialization and follow-up in the field. The teams configure and develop the AUTOSAR-based software stack (BSW) in close cooperation with suppliers and external teams. They are involved in the entire process, from implementation to verifying and delivering the complete ECU for manufacturing. Main Responsibilities: As a Senior Software Developer for ARTCSC nodes, your key responsibilities will include: Creating the next generation of Zone Controllers/Body Controllers while maintaining current ECUs in production. Planning test activities and ensuring the necessary equipment for testing. Defining the Software Architecture and Implementation Strategy, from configuring the BSW to delivering applications for use in vehicles. Supporting teams in defining, exploring, and implementing enablers. Providing oversight and guidance while fostering a quality-first culture using modern tools and technologies. Leading software stack configuration development and ensuring integration with other ECU components. Contributing to the development of an automated workflow for continuous integration and testing of new software. Collaborating closely with internal and external experts to enhance long-term development and expand knowledge across various fields. Qualifications: To succeed in this role, you should have: Extensive experience as a Senior Software Developer, particularly in Core System Components. Fluency in English, both written and spoken. Expertise in AUTOSAR, which is the primary operating system. A broad and deep understanding of relevant technologies, including: Hardware (HW) Software (SW) Continuous Integration (CI) System Safety Additional Qualifications: Experience in the following areas is considered a plus: Embedded Software Development Configuration Management Software Software Release Processes Python Programming CAN and Automotive Ethernet Communications Hardware-in-the-Loop (HIL) Systems and Real-Time Simulation Continuous Integration, Verification, and Development Platform Development Proven ability to develop and maintain long-term roadmaps and technical evolution plans Desired Attributes: Curiosity, positivity, and a strong drive to engage with and support teams and individuals. Excellent communication skills, with the ability to balance the needs of different stakeholders. A passion for implementing architectural visions and the ability to build both formal and informal relationships inside and outside the organization. Strong technical ability and expertise to evaluate system and function alternatives, understanding the full consequences of different [&hellip;]"
    ]
  }
]