[
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72899-projektledare-56/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning Vi söker en projektledare för vår kunds räkning. Arbetet kommer att utföras både på kundens kontor och delvis på distans. Vid resor mellan kontor används främst kollektivtrafik. Huvudsakliga ansvarsområden: Driva och koordinera olika IT-projekt som initieras av kundens olika verksamheter. Ansvara för projekt som relaterar till användarnära IT-infrastruktur samt fastighetstekniska system där IT-stödet spelar en central roll. Föra dialog med beställare och kunder för att klargöra krav och förväntningar, samt säkerställa att dessa möts under projektets gång. Ansvara för genomförandet av projekt, oavsett om det rör sig om små eller större uppdrag med varierande komplexitet. Sköta projektens budget, planering, uppföljning och dokumentation på ett professionellt sätt. Beroende på projektens storlek förväntas du hantera flera projekt samtidigt. De flesta projekten är IT-relaterade, men vissa kan vara mer koordinerande eller förändringsorienterade. Obligatoriska kvalifikationer: Minst 5 års erfarenhet som IT-projektledare, med erfarenheter som är högst 10 år gamla. Djup och bred kunskap inom användarnära IT-infrastruktur och generell IT-infrastruktur. Gedigen erfarenhet av att leda virtuella team med varierande kompetens. Mycket god förmåga att dokumentera och presentera på svenska. Trivs i en drivande och självständig roll. Svenskt medborgarskap krävs för att kunna genomgå säkerhetsprövning. Ett detaljerat CV som tydligt beskriver din erfarenhet inom området. B-körkort krävs. Meriterande kvalifikationer: Tidigare erfarenhet inom de specifika sektorer som uppdraget omfattar. Erfarenhet av arbete i större organisationer med politisk styrning. Erfarenhet av att leda förändringsarbeten med agila metoder. Erfarenhet av arbete i stora och komplexa IT-miljöer. Ett agilt förhållningssätt i ditt arbetssätt. Bred IT-kompetens som sträcker sig över flera områden. Personliga egenskaper: Stark samarbetsförmåga men också bekväm med att arbeta självständigt. Prestigelös och generös med att dela med dig av din erfarenhet och idéer. Engagerad, drivande och lyhörd i din kommunikation och ditt arbetssätt."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72892-teknisk-specialist-med-mim-kompetens/",
    "roles": [
      "Teknisk specialist"
    ],
    "places": [
      "Göteborg",
      "Hybrid"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en teknisk specialist med kompetens inom Microsoft Identity Manager (MIM). Vår kund vill fortsätta arbetet med att etablera och förbättra en plattform för att möjliggöra tillgång till applikationer inom Identity Fabric. Teamet kommer att utveckla en modern plattform som en tjänst, där både utvecklare och ansvariga för tjänster får tillgång till de tekniska verktyg som krävs för effektivt arbete. Huvudsakliga ansvarsområden: Ansvara för övervakning och hantering av MIM-installationens livscykel. Analysera och felsöka incidenter genom att granska loggar och samarbeta med kollegor för att identifiera och lösa problem. Obligatoriska kvalifikationer: Djupgående erfarenhet och kompetens i att drifta Microsoft Identity Manager (MIM) i stora organisationer. Erfarenhet av att installera och hantera MIM i offentlig sektor. Kunskap om DevOps-metodik, infrastruktur som kod samt plattformar för identitetshantering och åtkomstkontroll. Svenskt medborgarskap krävs då uppdraget kan bli säkerhetsklassat. Personliga egenskaper: Självständig och tekniskt kunnig med lång erfarenhet inom området. Förmåga att arbeta självständigt och lösa komplexa tekniska utmaningar. Erfarenhet av systemövervakning och hantering av systemens livscykel. Ansvarstagande, noggrann och resultatorienterad med en problemlösande inställning. God samarbetsförmåga och stark kommunikationsförmåga, flytande på både svenska och engelska i tal och skrift. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72878-projektledare-ibc-hotlab/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en projektledare med ansvar för att leda och koordinera införandet av IBC Hotlab. Projektet innebär nära samarbete med en leverantör baserad i Nederländerna, vilket kräver god kommunikationsförmåga på engelska. Projektledaren kommer att ha en central roll i kontakten med både verksamhetens och IT-avdelningens intressenter. Bakgrund: Kundens plattform för digitalisering stödjer verksamheterna i anskaffning, utveckling och implementering av IT-tjänster. Enheten för projekt- och förändringsledning arbetar med att driva projekt som följer kundens digitaliseringsstrategi och tekniska utveckling. Denna enhet ansvarar även för att kvalitetssäkra IT-leveranser. Projekt- och förändringsledarna driver digitaliseringsprojekt som har initierats utifrån olika behov inom organisationens förvaltningar. Enheten fokuserar främst på nyutvecklingsprojekt, men det förekommer även vidareutvecklingsprojekt och avrop av kompetens från externa leverantörer. Kunden har idag en föråldrad metod för hantering av radiofarmaka inom nuklearmedicinska laboratorier. Detta system uppfyller inte längre moderna krav på patientsäkerhet eller myndighetskrav. IBC Hotlab-systemet har upphandlats för att skapa ett integrerat och säkert system för hantering och registrering av radioaktiva läkemedel, vilket kommer att förbättra patientsäkerheten och öka spårbarheten genom att eliminera manuell hantering. Huvudsakliga ansvarsområden: Leda och driva införandet av IBC Hotlab. Vara huvudansvarig för kontakterna med verksamheten och IT-avdelningen. Regelbunden uppföljning med projektägare och säkerställande av projektets framdrift. Ansvara för att kommunicera och koordinera med leverantören baserad i Nederländerna. Säkerställa att projektet följer de krav som ställs från myndigheter som Strålskyddsmyndigheten och Läkemedelsverket. Obligatoriska kvalifikationer: Minst 5 års erfarenhet som projektledare inom digitalisering och verksamhetsutveckling. Gedigen erfarenhet av att leda virtuella team och använda digitala verktyg som Microsoft365. Mycket god förmåga att dokumentera och presentera komplex information på svenska för olika målgrupper. Förmåga att fatta beslut och driva projektet framåt med stort ansvar. Svenskt medborgarskap, för möjlighet att säkerhetsklassas vid behov. Erfarenhet av att leda IT-projekt inom offentlig sektor. Stark förmåga att kommunicera på engelska. Meriterande kvalifikationer: Erfarenhet av att leda IT-projekt inom digitalisering inom hälso- och sjukvårdssektorn. Kunskap och erfarenhet av agila arbetsmetoder. Erfarenhet av förändringsledning. Personliga egenskaper: Konsulten bör vara engagerad, drivande och lyhörd. Förmåga att vara prestigelös och lyssna in olika parter, samtidigt som man delar med sig av sina erfarenheter och idéer. Stark förmåga att hantera flera intressenter och balansera olika behov i projektet. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72858-teknisk-specialist-plattformar-brandvaggsomrade/",
    "roles": [
      "Teknisk specialist"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nuen teknisk specialist inom brandväggsplattformar. I denna roll kommer du att vara en viktig del av teamet och bidra med utbildning av kundens personal samt stötta tekniska teamet under detaljplanering, installation och migrering till den nya brandväggslösningen. Eftersom det rör sig om en ny produkt för kunden, kommer du att agera som rådgivare och expert vid övergången till den nya plattformen. Du kommer att spela en central roll i att utforma och konfigurera den framtida brandväggsmiljön samt överföra de befintliga regelverken från den nuvarande brandväggsplattformen till den nya. Huvudsakliga ansvarsområden: Utbilda kundens personal och stödja teknisk personal under implementering och migrering till ny brandväggsplattform. Fungera som rådgivare och expert vid övergången till den nya plattformen. Detaljplanera och konfigurera den framtida brandväggsmiljön. Flytta och migrera befintliga brandväggsregelverk till den nya plattformen. Obligatoriska kvalifikationer: Djup erfarenhet av Fortigate. Gedigen kunskap om FortiAnalyzer och FortiManager. Erfarenhet av att implementera Fortinet-produkter i storskaliga IT-miljöer. Erfarenhet av Cisco Security Manager och Cisco ASA-brandväggar. Stark erfarenhet av att arbeta med brandväggskonfigurationer och komplexa nätverk, inklusive redundans. Eftersom konsultuppdraget kan vara säkerhetsklassat, krävs att du är svensk medborgare. Meriterande kvalifikationer: Erfarenhet av att sätta upp BGP i Fortigate-miljöer. Personliga egenskaper: Du har mycket god förmåga att arbeta i team och är tekniskt kompetent inom nätverks- och brandväggsområdet. Du är skicklig på att förmedla din expertis och stödja både kundens och teamets personal under utbildnings- och implementeringsprocessen. Du är noggrann, van vid att ta ansvar och är drivande och lösningsorienterad. Du har stark kommunikativ förmåga och kan arbeta effektivt med både svenska och engelska, i tal och skrift. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72846-teknisk-specialist-drift-adc/",
    "roles": [
      "Teknisk specialist"
    ],
    "places": [
      "Skövde",
      "Vänersborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en teknisk specialist för att ansluta till deras ADC-team. I denna roll kommer du att arbeta med att implementera, hantera och utföra beställningar samt säkerställa stabil drift av lastbalanserare och applikationer. Arbetsuppgifterna inkluderar konfigurering av F5 BIG-IP och andra lastbalanseringsprodukter, samt support och felsökning inom dessa områden. Huvudsakliga ansvarsområden: Implementering och konfigurering av lastbalanserare, särskilt F5 BIG-IP och Loadbalancer eller motsvarande system. Hantera teknisk support och utföra felsökning för att lösa problem relaterade till nätverks- och applikationsdrift. Arbeta i miljöer med hög säkerhet och komplexa integrationer, där förståelse för lastbalanseringens mekanismer är avgörande. Obligatoriska kvalifikationer: Nätverkslösningar: Erfarenhet av att arbeta med nätverkskomponenter, inklusive lastbalanserare, brandväggar och nätverkssäkerhet. Nätverksprotokoll: Djup förståelse för grundläggande nätverksprotokoll som TCP/IP, DNS, med flera. Lastbalansering och F5 BIG-IP: Praktisk erfarenhet av att implementera och konfigurera lastbalanserare som F5 BIG-IP eller Loadbalancer, eller liknande produkter. Support och felsökning: Förmåga att snabbt identifiera och åtgärda problem relaterade till nätverk och applikationer för att säkerställa stabil drift. Dokumentation: Erfarenhet av att skapa teknisk dokumentation och förmåga att kommunicera effektivt på svenska, både skriftligt och muntligt. Meriterande kvalifikationer: Nätverkskompetens: Erfarenhet som nätverkstekniker eller specialist inom IT-infrastruktur, med omfattande kunskap om nätverk och säkerhet. Kundfokus: Förmåga att arbeta nära både interna och externa intressenter för att identifiera och möta deras behov och krav på nätverkslösningar. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72815-projektledare-54/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Distans",
      "Gävle"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en projektledare som har kunskap inom verksamhetsutveckling. Rollbeskrivning: Du kommer att ha ansvar för att driva, samordna och leda projektet genom dess livscykel. Det ingår arbete med bl.a. förändringsledning, tjänstedesign, agila arbetssätt, nytta- och effektmätning i olika omständigheter. Skallkrav: B-körkort Du ska ha relevant eftergymnasial utbildning Du ska ha minst 5 års dokumenterad erfarenhet av projektledning Du ska ha minst 5 års dokumenterad erfarenhet av arbete i ledande positioner Du ska ha erfarenhet av att driva projekt inom IT-verksamhet och/eller digitalisering Du ska ha erfarenhet av att driva arbete med national digital infrastruktur tex Säker Digital Kommunikation, Digitala Nationella, KLASSA prov mfl Du ska ha erfarenhet och förståelse av IT-tekniska lösningar Du ska ha erfarenhet av arbete med systemintegrationer Du ska ha erfarenhet av att ta fram och dokumentera krav och behov Du ska ha certifiering eller vara diplomerad förändringsledare Du ska ha dokumenterad kompetens av agil projektledning Du ska ha erfarenhet av IT-projekt i stora och komplexa IT-miljöer Du ska ha erfarenhet av samverkan med intressenter från flera olika organisationer i projekt/uppdrag tex SKR, DIGG mfl Du ska ha erfarenhet av att samordna utredningsarbete gällande juridiska frågeställningar Du ska ha erfarenhet av att samordna utredningsarbete gällande informationssäkerhet Du ska ha erfarenhet från att ta fram och presentera tydliga beslutsunderlag Du ska ha god planeringsförmåga och vara strukturerad i sitt arbetssätt Du ska ha god samarbetsförmåga samt kommunikationsförmåga i så väl i tal och skrift på svenska Du ska ha erfarenhet av uppdrag där fokus är på att leverera resultat och uppfylla kundförväntningar Du ska utföra ditt uppdrag delvis på plats i vår kunds lokaler i Gävle. Beroende på arbetsuppgifter och uppdrag så förekommer arbete fysiskt på plats i Gävle."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72770-teknisk-systemforvaltare/",
    "roles": [
      "Systemförvaltare"
    ],
    "places": [
      "Göteborg",
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en Teknisk Systemförvaltare. Rollen innebär arbete med olika plattformar, där ett centralt system att förvalta är Antura. Det är fördelaktigt om du har erfarenhet av andra byggprojektsystem som Byggnet, Dalux, Drofus, Ibinder, Interaxo och tidplaneringssystem. Du bör även ha gedigna kunskaper inom M365, SharePoint och Teams, samt en bred förståelse för Windowsmiljö, Power BI-tjänster, AD och Azure Entra ID. Erfarenhet av ritningssystem och en viss förståelse för BIM och CAD är också önskvärd. Huvudsakliga ansvarsområden: Ansvara för teknisk förvaltning av IT-system inom byggprojekt. Leda implementeringen av en ny projektportal och avveckla befintliga system. Migrera data och säkerställa att den nya lösningen uppfyller alla funktionalitetskrav. Planera och koordinera systemutveckling och uppgraderingar. Hantera teknisk support, incidenthantering och säkerhetsåtgärder (ex. backup, MFA, redundans). Arbeta nära tillsammans med systemförvaltare och systemägare inom verksamheten. Obligatoriska kvalifikationer: Erfarenhet av teknisk systemförvaltning eller erfarenhet av arbetssätt och systemanvändning inom byggprojekt. Stark IT-kompetens, inklusive systemförståelse och integrationer. Förståelse för verksamhetsbehov och förmåga att översätta dessa till digitala lösningar. Förmåga att ge råd kring tekniska lösningar och föreslå lämpliga åtgärder. Erfarenhet av projektledning och att leda tekniska uppdrag, såsom exempelvis dokumentmigrering och avveckling av system. Meriterande kvalifikationer: Erfarenhet från byggprojekt eller fastighetsförvaltning. Gedigna kunskaper inom M365, SharePoint och Teams, samt en bred förståelse för Windowsmiljö, Power BI-tjänster, AD och Azure Entra ID, ritningssystem och viss kunskap om BIM och CAD."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72727-devops-engineer-24/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en DevOps Engineer till kundens digitaliseringssatsning inom IOC och plattformar. Du kommer att vara en viktig del i utvecklingen av framtidens tjänster för patienter, invånare och medarbetare. Rollen innebär att bygga nya förmågor och utveckla tjänster för att bättre förstå och möta aktuella och framtida behov. Kunden erbjuder en flexibel arbetsmiljö, där du har möjlighet att arbeta både på distans och från deras kontor i Göteborgsområdet, beroende på verksamhetens förutsättningar. Huvudsakliga ansvarsområden: Som DevOps Engineer kommer dina huvudsakliga ansvarsområden att vara: Vidareutveckla och drifta vår kunds hostingplattform tillsammans med teamet. Arbeta i en agil och öppen organisation som befinner sig i en kreativ och intensiv utvecklingsfas. Bidra till att teamet utvecklar lösningar som möter deras behov av serverlösningar. Minska tiden det tar för applikationsteam att produktionssätta ett system genom optimering och automatisering. Standardisera och automatisera hostingplattformen för att öka effektiviteten. Arbeta med &#8221;Infrastructure as Code&#8221; (IaC) och säkerställa återanvändbara funktioner och en enhetlig serverpark. Implementera processer som förbättrar effektiviteten och minskar risken för fel. Tillhandahålla en hostingplattform som underlättar för användare att konsumera och drifta standardiserade servrar. Obligatoriska kvalifikationer För att kvalificera dig för rollen krävs följande: Minst 5 års erfarenhet av att arbeta i stora organisationer inom offentlig sektor. Gedigen erfarenhet av serveradministration inom stora Windows-miljöer. Omfattande erfarenhet av serveradministration inom Linux-miljöer. Erfarenhet av att implementera automatiserade processer och självbetjäningslösningar. Erfarenhet av agila arbetsmetoder. Förmåga att uttrycka dig väl i både tal och skrift på svenska och engelska. Svenskt medborgarskap, då tjänsten kommer att säkerhetsklassas. Praktisk erfarenhet av att arbeta med stora serverparker. Förmåga att skapa återanvändbara funktioner och självbetjäningslösningar genom script och API, för att minimera manuell inblandning i det dagliga arbetet. Meriterande kvalifikationer: Det är meriterande om du har erfarenhet av följande: Ansible/AWX. Microsoft Endpoint Configuration Manager (MECM/SCCM). OP5 och Systems Center Operations Manager (SCOM). Active Directory (AD) och Group Policies. Säkerhetsarbete för att säkra serverplattformar. Virtualisering med hjälp av VMWare. Automatisering genom script såsom PowerShell, Python eller shellscript. Erfarenhet av Scrum. Personliga egenskaper: Vi söker dig som: Är självgående och samtidigt en god lagspelare. Är nyfiken och har ett starkt driv att ständigt utvecklas. Har en vilja att dela med dig av kunskap och stötta dina kollegor. Har god kommunikations- och samarbetsförmåga då rollen innebär kontakt med olika delar av organisationen. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72665-projektledare-53/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning Vi söker nu en Projektledare på uppdrag av en kund. Rollen innebär främst att driva och koordinera olika IT-projekt som beställs och initieras av kundens olika avdelningar. Ett av de viktigaste projekten handlar om att sammanföra och utreda cirka 150 applikationer inom ett universitetssjukhus. Arbetet utförs delvis på kundens kontor, men det finns möjlighet till distansarbete. Vid resor mellan olika kontor föredras i första hand användning av kollektivtrafik. Bakgrund: Avdelningen för digitalisering arbetar för att stötta verksamheterna med att anskaffa och utveckla IT-tjänster. Inom avdelningen för Infrastruktur och cybersäkerhet drivs interna projekt och uppdrag med fokus på att strategiskt följa den globala tekniska utvecklingen. Dessutom ansvarar en specifik enhet för att följa upp och kvalitetssäkra IT-leveranser inom projekten. De tekniskt inriktade projekten drivs inom fem olika team, där de flesta projekt rör utveckling och implementering av ny teknik inom infrastrukturområdet. Ofta anlitas experter från linjeverksamhet och externa leverantörer för dessa projekt. Huvudsakliga ansvarsområden: Säkerställa att dialoger med beställare och kunder klargör krav och förväntningar inom de olika projektuppdragen. Ansvara för genomförandet av både stora och små projekt med varierande komplexitet. Arbeta med stöd av etablerade arbetsmetoder och team för att leverera projekt på ett professionellt sätt. Hantera projektbudget, planering, uppföljning och dokumentation. Koordinera flera projektuppdrag, där antalet kan variera beroende på projektens omfattning. Nästan alla projekt är IT-relaterade, men det kan förekomma projekt som även kräver koordination eller förändringsledning. Obligatoriska kvalifikationer: Minst 3 års erfarenhet som IT-projektledare, med aktuell erfarenhet inom de senaste 10 åren. Bred och djup kunskap om IT-infrastruktur nära användaren. Erfarenhet av att leda virtuella kompetensteam. Förmåga att dokumentera och presentera på svenska. Självständig och drivande i sin arbetsroll. Svenskt medborgarskap, nödvändigt för säkerhetsklassning. Körkort (B). Ett detaljerat CV som beskriver erfarenheter inom relevanta områden. Meriterande kvalifikationer: Erfarenhet från arbete inom större politiskt styrda organisationer. Erfarenhet av agila arbetsmetoder. Kunskap om större, komplexa IT-miljöer. Erfarenhet av system inom hälso- och sjukvård samt medicintekniska system. Erfarenhet av IT-säkerhet och IT-infrastrukturarbete. Erfarenhet av att arbeta i en agil miljö. Personliga egenskaper: Engagerad och drivande i sitt arbete. Lyhörd och bra på att samarbeta med andra. Trivs både med att arbeta i grupp och självständigt. Prestigelös och villig att dela med sig av sina erfarenheter och idéer. Flexibel och anpassningsbar i olika arbetsmiljöer."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72623-projektledare-utredare/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en Projektledare/Utredare. Arbetet kommer att utföras både på plats i kundens lokaler, med viss möjlighet till distansarbete. Vid behov av resor mellan kontoren kommer i första hand kommunala färdmedel att användas. Vår kunds digitaliseringsplattform har som mål att stödja verksamheterna i deras anskaffning och utveckling av IT-tjänster. Avdelningen Infrastruktur och Cybersäkerhet ansvarar för att driva interna projekt, strategiskt följa den globala tekniska utvecklingen samt säkerställa kvaliteten på IT-leveranser i dessa projekt. Enheten Förändring och Möjliggörande, som ingår i avdelningen Infrastruktur och Cybersäkerhet, ansvarar för tekniskt inriktade projekt och är organiserad i fem team som fokuserar på specifika kundgrupper. Deras uppdrag omfattar ofta utveckling och implementering av ny infrastrukturteknik, där de använder resurser från både interna avdelningar och externa leverantörer. Huvudsakliga ansvarsområden: Ansvara för att driva och samordna olika IT-projekt som initieras av kundens verksamheter. Hantera utredningen av cirka 150 applikationer inom Sahlgrenska som huvudprojekt. Föra dialog med beställare/kunder för att klargöra krav och förväntningar inom ramen för projektuppdragen. Genomföra projekt med varierande komplexitet, från mindre uppdrag till större, mer omfattande projekt. Hantera projektbudget, planering, uppföljning och dokumentation. Koordinera och leda projekt, främst inom IT, men även inom förändringsledning och annan relevant verksamhet. Antalet projekt varierar beroende på deras storlek. Projektuppdragen är nästan uteslutande IT-relaterade, men kan även inkludera koordinerande eller förändringsledda uppgifter. Obligatoriska kvalifikationer: Minst 3 års erfarenhet som IT-projektledare, ej äldre än 10 år. God och bred kunskap inom användarnära IT-infrastruktur. God och bred kunskap inom IT-infrastruktur i allmänhet. Erfarenhet av att leda virtuella kompetensteam. Svenskt medborgarskap (för säkerhetsklassning). Ett CV som tydligt beskriver erfarenheter inom relevanta områden. Du ska inneha ett B-körkort. Meriterande kvalifikationer: Erfarenhet från arbete i större politiskt styrda organisationer. Erfarenhet av agila arbetssätt. Erfarenhet av arbete inom stora, komplexa IT-miljöer. Erfarenhet av hälso- och sjukvårdssystem samt medicintekniska system. Erfarenhet av arbete inom IT-infrastruktur och IT-säkerhet. Erfarenhet av större, komplexa IT-miljöer. Ett agilt förhållningssätt. Bred IT-kompetens. Personliga egenskaper: God förmåga att dokumentera och presentera på svenska. Trivs i en drivande roll och har förmågan att arbeta självständigt. Engagerad, drivande och lyhörd, med förmåga att samarbeta effektivt, men också kunna arbeta självständigt. Prestigelös och villig att dela med sig av erfarenhet och idéer. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72592-it-projektledare-ioc/",
    "roles": [
      "IT Projektledare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en erfaren projektledare med fokus på verksamhetsutveckling och en stark IT-bakgrund. Du förväntas ha djupgående förståelse för komplexa IT-miljöer samt erfarenhet av att utveckla och implementera affärsmodeller inom IT-området. Personen bör även ha arbetat i stora organisationer, gärna med politiska beslutsstrukturer, och vara kapabel att leda och engagera både interna och externa intressenter för att säkerställa en framgångsrik implementering av kundens nya service offering-modell. Obligatoriska kvalifikationer: Dokumenterad erfarenhet av affärsutveckling eller verksamhetsutveckling inom IT de senaste fem åren. Förmåga att uttrycka sig flytande i både svenska och engelska, i både skrift och tal. Erfarenhet av att leda utvecklingsprojekt med ett flertal intressenter. Beprövad kompetens i att utveckla och implementera affärsmodeller eller servicekoncept inom IT. Erfarenhet av att arbeta i större organisationer, helst med politisk styrning. Förmåga att arbeta självständigt och vara initiativrik. Meriterande kvalifikationer: Tidigare erfarenhet av att utveckla affärsmodeller eller servicekoncept inom områden som IT-infrastruktur och cybersäkerhet anses vara en stor fördel. Du bör ha erfarenhet av att leda projekt och förändringsarbete i miljöer där politiska beslutsprocesser påverkar organisationens struktur och riktning. Det är meriterande om konsulten har arbetat med agila metoder för att leda utvecklings- eller förändringsprojekt, vilket möjliggör en anpassningsbar och flexibel arbetsmetodik. Referenser från tidigare kunder, där liknande uppdrag har genomförts med framgång, stärker konsultens trovärdighet och förmåga att leverera. Personliga egenskaper: Förmåga att kommunicera effektivt och tydligt, både inom teamet och med externa aktörer. Drivkraft att genomföra projekt från start till mål. Bekväm med att utmana och ifrågasätta existerande strukturer för att driva förbättring. Lösningsorienterad med en stark vilja att nå uppsatta mål. Anpassningsbar och öppen för förändring i dynamiska miljöer."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72304-tekniska-specialister-virtualisering/",
    "roles": [
      "Teknisk specialist"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu två Tekniska Specialister (DevOps engineer) till sektionen DevOps inom digitalisering, IOC och Plattformar. Du kommer att vara med och driva utvecklingen av den virtuella plattformen som stödjer framtidens tjänster för patienter, invånare och medarbetare. Vi söker dig som har praktisk kunskap och erfarenhet av att arbeta med större Enterprise VMware-miljöer. Du bör också ha erfarenhet av automation. Du kommer att ingå i ett virtualiseringsteam som ansvarar för att utveckla och förvalta den virtuella infrastrukturen. Teamet består av en Produktansvarig (Product Owner), en Team Coach (Scrum Master) och flera Tekniska Specialister (DevOps engineers). Vår kund har en etablerad Enterprise VMware-miljö som inkluderar teknologier som vSphere, VMware Horizon, Aria Operations, Tanzu, vCloud Foundation och NSX. Huvudsakliga ansvarsområden: Som Teknisk Specialist (DevOps engineer) kommer du att: Utveckla och förvalta den virtuella infrastrukturen Leverera kapacitet Optimera prestanda, säkerhet och tillgänglighet Kvalifikationer: Minst 3 års mycket god erfarenhet av att ha arbetat med Enterprise VMware-miljöer i stora organisationer God erfarenhet av VMware-teknologier, inklusive vSphere, vCenter och vCF God erfarenhet av automatisering och skriptning God erfarenhet av Powershell God erfarenhet av server-OS från Microsoft Förmåga att arbeta självständigt och i team God problemlösningsförmåga Förmåga att uttrycka dig väl i tal och skrift på både svenska och engelska Du kan komma att säkerhetsklassas, vilket kan ställa krav på svenskt medborgarskap. Meriterande kvalifikationer: God erfarenhet av server-OS från Ubuntu och Redhat God erfarenhet av Horizon VDI-plattform God förståelse för nätverks- och lagringstekniker som påverkar virtualiserade miljöer God erfarenhet av att utforma och implementera självbetjäningslösningar och automatiserade processer God erfarenhet av agila arbetssätt God erfarenhet av versionshantering (exempelvis Git) God erfarenhet av infrastruktur som kod och CI/CD-pipelines Erfarenhet av Kubernetes-plattform, exempelvis vCenter integrated Tanzu Personliga egenskaper: Vi söker dig som: Är nyfiken och strävar efter att förbättra och utveckla dig själv Gärna stöttar dina kollegor i deras arbete Har god samarbetsförmåga Har god kommunikationsförmåga, både internt och externt"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72289-systemforvaltare-utveckling-optimizely/",
    "roles": [
      "Systemförvaltare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en systemförvaltare med gedigen erfarenhet av utveckling och administration av Optimizely. Arbetet utförs främst på plats hos kunden i Göteborgsområdet men det finns möjlighet till visst distansarbete. Uppdraget &#8221;Optimizely uppgradering och utveckling&#8221; omfattar bland annat uppgradering av Optimizely och utveckling av tjänster baserat på krav från förvaltningen och verksamheten. Huvudsakliga ansvarsområden: Medverkan i pågående förvaltning och utveckling av intranätet och externwebben som är byggda med Optimizely. Deltagande i dokumenthanteringsprojekt som inkluderar integrering av dokumentpublicering i intranätet. Uppdrag kan även härröra från ärendeberedning inom funktionsområdet Webbtjänster, vilka kan omfatta förändringar i den förvaltade miljön eller uppgifter finansierade av enheten Information och Arkivering. Hög kompetens kring kringliggande system och tjänster som integreras med Optimizely, exempelvis Lucene/SolR (sökmotor), Fotoweb (bildhantering), Sharepoint, Yammer och Apelon (metadatatjänst). Konsulternas kompetenskrav ligger på nivå 4, vilket innebär en hög nivå av kunskap inom Optimizelys senaste versioner och dess utveckling. Obligatoriska kvalifikationer: Djup erfarenhet av Optimizely samt relaterade tjänster som Ifeed, Sharepoint, Apelon, och Lucene/SolR. Stark förmåga att omsätta användar- och kundkrav till tekniska lösningar. Proaktivt ansvarstagande i roller inom systemutveckling och projektledning. Deltagande i KSD releasehantering, vilket kräver överenskommelser kring arbetstider och leveranser. Erfarenhet av att arbeta med agila utvecklingsmetoder i utvecklingsuppdrag. Systemutveckling inom Optimizely CMS. Minst tre års erfarenhet av uppdrag inom offentlig verksamhet. Meriterande kvalifikationer: Dokumenterad erfarenhet av integrationer med andra system i kundens webbplattform, exempelvis Lucene/SolR, Liferay och CA Siteminder (säkerhetslösningar). Kompetens inom systemarkitektur, integrationsmetoder, och databasarkitektur. Erfarenhet av utveckling i både .NET och Java. Djup förståelse för Optimizelys administrativa funktioner."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72284-losningsarkitekt-25/",
    "roles": [
      "Lösningsarkitekt"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning: Vår kund söker en senior lösningsarkitekt till ett antal projekt inom stöddomänen, initialt till uppdrag rörande våra verksamheter inom områdena för Juridik och Koncernsäkerhet/CISO. Du kommer att ha ansvar för framtagandet av lösningar i flera projekt inom dessa områden. Du kommer även att i vissa frågeställningar avlasta områdets domän-/linjearkitekt. Förutom att driva lösningsframtagningen och säkerställa att lösningen följer beslutade strategier och riktlinjer, möter funktionella och icke-funktionella krav medverkar du också i kravanalys samt i planering och koordinering av projektens leverabler, som stöd till projektledare och it-projektledare. Du kommer att ha ett nära samarbete med våra leverantörer rörande detaljerade krav, systemdesign, systemutveckling, test och leverans. Erfarenhet: Erfarenhet av upphandlingsuppdrag och att arbeta med underleverantörer Erfarenhet av att arbeta i en outsourcad internationell miljö, med underleverantörer för utveckling, Mångårig Erfarenhet som ansvarig lösningsarkitekt i projekt i större organisationer Erfarenhet av kravanalys Erfarenhet av IT-lösningar levererade som SAAS-tjänster Bred kompetens inom IT-arkitektur Meriterand: Erfarenheter av systemstöd för GRC, avtalshantering, styrdokumentshantering samt säkerhetskravställn Branscherfarenhet från tillståndspliktig verksamhet är meriterande Erfarenhet av teknisk projektledning är meriterande Erfarenhet av IT-lösningar levererade på Servicenow Erfarenhet från digitalisering av stödfunktioner t.ex. inom säkerhet och juridik"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72196-platform-engineer-5/",
    "roles": [
      "Engineer"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en Platform Engineer som ska bidra till digitalisering, IOC (Infrastructure Operations Center), plattformar och DevOps. Uppdraget omfattar att utveckla framtidens tjänster för patienter, invånare och medarbetare. Vår kund erbjuder flexibla arbetsformer, med möjlighet att kombinera arbete på deras kontor i Göteborgsområdet och distansarbete. Målet är att effektivisera processen för applikationsteamen att produktionssätta system samt att standardisera och automatisera hostingplattformen. Ett viktigt fokusområde är Infrastructure as Code (IaC), där återanvändbara funktioner och enhetlighet inom serverparken är centrala. Genom att implementera dessa principer strävar kunden efter att öka effektiviteten och minska risken för fel. Huvudsakliga ansvarsområden: Som Platform Engineer kommer du att: Samarbeta med teamet för att vidareutveckla och drifta kundens hostingplattform. Arbeta i en agil organisation och delta i ett team som befinner sig i en intensiv och kreativ utvecklingsfas. Bidra till utvecklingen av serverlösningar som tillgodoser både nuvarande och framtida behov från invånare och medarbetare. Utveckla nya funktioner och tjänster med fokus på att förenkla konsumtion och drift av standardiserade servrar. Obligatoriska kvalifikationer: Minst 1 års erfarenhet av arbete inom serverpark i offentlig sektor. Minst 5 års erfarenhet av arbete i större organisationer inom offentlig sektor. Mycket god erfarenhet av serveradministration på stora Windowsplattformar. Mycket god erfarenhet av serveradministration i stora Linuxmiljöer. Erfarenhet av att implementera automatiserade processer och självbetjäningslösningar. Erfarenhet av agila arbetssätt. God förmåga att uttrycka dig i tal och skrift på både svenska och engelska. Erfarenhet av att skapa återanvändbara funktioner och självservicelösningar via script och API Observera att tjänsten är säkerhetsklassad, vilket innebär att svenskt medborgarskap är ett krav. Meriterande kvalifikationer Ansible/AWX. Microsoft Endpoint Configuration Manager (MECM/SCCM). OP5 och Systems Center Operation Manager (SCOM). Active Directory (AD) och Group Policies. Säkerhetsarbete för serverplattformar. VMWare för virtualisering. Automation genom script, såsom Powershell, Python eller shellscript. Scrum-metodiken. Personliga egenskaper Vi söker dig som är: Självgående men även en lagspelare. Nyfiken och ständigt strävar efter att förbättra och utveckla dig själv. Villig att stötta och samarbeta med kollegor. Bra på att kommunicera och samarbeta med olika delar av organisationen, då rollen innebär omfattande kontakt med flera team. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72186-data-engineer-infrastruktur-cybersakerhet/",
    "roles": [
      "Ingenjör"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en dataingenjör som ska bidra till kundens digitalisering samt arbeta med IoC-plattformar och DevOps. Du kommer att ingå i deras DevOps-team inom Infrastruktur och Cybersäkerhet. Uppdraget innefattar att utveckla framtidens tjänster för patienter, invånare och medarbetare. Huvudsakliga ansvarsområden: Designa, utveckla, testa och underhålla robusta, säkra och skalbara lösningar för datalagring och databehandling. Bygga och underhålla data pipelines och automation. Bidra till utvecklingen av nya tjänster för att bättre möta invånarnas och medarbetarnas behov, både nu och i framtiden. Implementera principen &#8221;automatisera allt&#8221; för att skapa lösningar för både intern och extern användning av infrastruktur och plattformar. Arbeta med både implementering och förvaltning av olika förmågor kopplade till produkten. Fungera som en brygga mellan data scientists, dataanalytiker och IT-funktionen. Obligatoriska kvalifikationer: Omfattande kunskaper om Denodo. Erfarenhet av att bygga data pipelines och automation. Goda kunskaper i Python. Goda kunskaper inom SQL/NoSQL och erfarenhet av ETL/ELT-utveckling. Erfarenhet av datalager och data lakes. Erfarenhet av arbete med datahantering. Erfarenhet och kunskap om datavirtualisering. Erfarenhet och kunskap om data catalog tools. God förståelse för DevOps-metodik och agilt arbetssätt. Minst två års erfarenhet av att arbeta i organisationer och miljöer. Svenskt medborgarskap är ett krav eftersom tjänsten kommer att säkerhetsklassas. Meriterande kvalifikationer: Fördjupad förståelse för DevOps-metodik och agilt arbetssätt. Förmåga att uttrycka dig väl i tal och skrift på både svenska och engelska. Erfarenhet av en eller flera ledande databasmotorer. Erfarenhet och kunskap om datavirtualisering. Erfarenhet och kunskap om data catalog tools. &nbsp; Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72111-testare-12/",
    "roles": [
      "Testare"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning På kunds räkning söker vi nu testare för ett projekt. Uppdraget går ut på att Ansvara för att tester genomförs Själv genomföra tester Kunna estimera, implementera och felsöka i testmiljön Ansvara för teststrategi och testplan. Ansvar för testledning av interna och externa parter Utifrån sin tekniska erfarenhet förstå den nuvarande lösningen, identifiera hur testarbetet ska planeras och genomföras Du är drivande på egen hand och tillsammans med andra, och tar självständigt ansvar. Utföra testerna i en teknisk miljö inom områden som omfattas av bland annat integrationer, databas, videoinspelning Skallkrav: Du ska vara erfaren testare med testledarerfarenhet. Du ska ha minst 4 års dokumenterad erfarenhet av att själv praktiskt utfört tester i en teknisk miljö med komplexa (minst tre system involverade) IT-system med många integrationer. Du ska ha minst 4 års dokumenterad erfarenhet av att kunna strukturera, dokumentera och administrera testfall. Du ska ha dokumenterad erfarenhet av automatiserade och detaljtekniska tester och användning av verktyg så som tex postman. Minst två uppdrag de senaste 6 åren Du ska ha dokumenterad erfarenhet att arbeta och planera i testverktyg som t.ex. X-ray/JIRA, minst två exempel. Du ska ha erfarenhet av att översätta krav till exempelvis user stories, use case, testfall. Minst två uppdrag de senaste 4 åren. Du ska ha erfarenhet av att ta fram och driva teststrategi, testplan och testfall i agilt ramverk från minst 1 tidigare uppdrag de senaste 4 åren. Ange uppdrag och år. Börkrav: Du bör ha erfarenhet av att leda och utföra tester tillsammans med verksamhet, IT och extern leverantör end to end utifrån krav och behov. Minst 1 uppdrag. Du bör a utfört minst 2 uppdrag som testare med system för strömmad video. Du bör ha erfarenhet av inlärning och test av AI vid minst 1 tillfälle. Du bör ha erfarenhet av att praktisk utföra testarbete av system med skyddsvärd information enligt gällande lagstiftning ex säkerhetsskyddslagstiftningen de senaste 3 åren. Du bör ha erfarenhet från att arbeta med behörighetshantering vid minst 1 uppdrag under de senaste 4 åren.Ange uppdrag och år. Du bör ha erfarenhet av minst ett uppdrag på för en offentlig myndighet/förvaltning de senaste 10 åren. Ange uppdrag och år. &nbsp; Du kommer att arbeta på plat i vår kunds lokaler i Stockholm. Dagar och tider för detta styrs efter behov av organisationen och de agila team man arbetar i."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72022-systemforvaltning-utveckling-optimizely-enhet-information-arkivering/",
    "roles": [
      "Systemförvaltare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu dig med lång och dokumenterad erfarenhet inom utveckling och administration av Optimizely. Arbetet sker delvis på plats i kundens lokaler i Göteborg, men vissa delar kan utföras på distans och involverar uppgradering och utveckling av Optimizely. Detta innefattar uppgraderingar och vidareutveckling av tjänster baserade på krav som formulerats av förvaltningen och andra uppdrag, med fokus på att möta behoven från olika delar av verksamheten. Huvudsakliga ansvarsområden: Delta i pågående förvaltning och uppdrag som rör intranätet och externwebben byggda i Optimizely. Samarbeta med dokumenthanteringsprojekt som ska integrera dokumentpublicering i intranätet. Hantera uppdrag som kommer från ärendeberedning under ansvarsområdet Webbtjänster, som kan inkludera förändringar i den förvaltade miljön eller förändringar finansierade av enheten Information och Arkivering. Arbeta med relaterade system och tjänster kring Optimizely-miljön, som Lucene/SolR, Fotoweb (bildhantering), Sharepoint, Yammer och metadatatjänsten Apelon. Bidra med expertkunskap inom utveckling av Optimizely i dess senaste versioner. Obligatoriska kvalifikationer: Gedigen erfarenhet av Optimizely och relaterade IT-tjänster som Ifeed, Sharepoint, Apelon, Lucene/SolR med mera. Förmåga att omvandla användar- och kundkrav till tekniska lösningar. Proaktivt ansvarstagande inom systemutveckling och projektledning. Deltagande i KSD releasehantering, vilket kräver överenskommelser om arbetstider och andra praktiska arrangemang. Erfarenhet av att arbeta i utvecklingsuppdrag som följer agila metoder. Minst 3 års erfarenhet av systemutveckling inom Optimizely CMS i offentlig verksamhet. Meriterande kvalifikationer: Erfarenhet av integrationer med andra delar av plattformen, inklusive Lucene/SolR (sökmotor), Liferay, och säkerhetslösningar från CA Siteminder. Kompetens inom systemarkitektur, integrationsmetoder, och databasarkitektur. Erfarenhet av både .NET och Java. Djupgående kunskap om Optimizelys administrativa funktioner."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72005-teknisk-specialist-adc-drift-2/",
    "roles": [
      "Teknisk specialist"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en Teknisk Specialist inom ADC-drift. Rollen kräver djup expertis inom federationsprotokoll och säker autentisering, med särskild fokus på SAML, OAuth och OpenID Connect, samt erfarenhet av att konfigurera och implementera F5 lösningar för säker och skalbar federering. Arbetet sker i en miljö där hög säkerhet och komplexa integrationer är avgörande. Huvudsakliga ansvarsområden: Implementera, hantera och optimera federationslösningar och säker autentisering med F5 Access Policy Manager (APM). Arbeta med federationsprotokoll som SAML, OAuth och OpenID Connect. Utföra felsökning och support inom dessa områden. Överföra kompetens till teamet. Hantera Single Sign-On (SSO)-lösningar och säkerhetsarkitekturer för federationer. Designa och implementera access policies i komplexa och säkerhetskritiska miljöer. Obligatoriska kvalifikationer: Omfattande erfarenhet av federationsprotokoll som SAML 2.0, OAuth 2.0, OpenID Connect (OIDC), inklusive Single Sign-On (SSO), attribute release policies samt hantering av signering, kryptering och verifiering av SAML Assertions och OIDC tokens. Gedigen kunskap om X.509-certifikat för signering och kryptering samt hantering av PKI-infrastrukturer kopplade till federationslösningar. Erfarenhet av att konfigurera och optimera F5 BIG-IP APM, särskilt när det gäller access policies, autentiseringslösningar och lastbalansering av federerade tjänster. Stark förståelse för TLS/SSL, IDP-initiated och SP-initiated federation, samt secure token services (STS) och hur dessa integreras med F5 lösningar för att säkerställa en sömlös och säker autentisering. Förmåga att skapa och presentera detaljerad teknisk dokumentation på svenska, inklusive design av federationslösningar, integrationsprocesser och tekniska specifikationer. Erfarenhet av att leda implementeringar och integrationer av federerade lösningar, både som teknisk expert och projektledare. Ett CV som tydligt beskriver erfarenhet av avancerade implementationer inom federationsprotokoll, säker autentisering, F5-produkter och storskaliga federationsmiljöer. Meriterande kvalifikationer: Bred erfarenhet som teknisk specialist inom komplexa IT-miljöer med särskild kompetens kring federation, autentisering och access management. Förmåga att hantera kunddialoger professionellt och bygga långvariga kundrelationer. Personliga egenskaper: Självständigt arbetssätt och förmåga att ta tekniskt ledarskap. Stark kommunikationsförmåga och kundfokus."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/72001-teknisk-specialist-adc-drift/",
    "roles": [
      "Teknisk specialist"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en Teknisk Specialist som kommer att ingå i deras ADC-driftteam. Huvudsakliga ansvarsområden: Du kommer att ingå i ADC-teamet med följande arbetsuppgifter: Implementera, hantera och utföra beställningar inom området. Säkerställa stabil drift av lastbalanserare och applikationer. Konfigurera F5 BIG-IP, Loadbalancer och andra nätverksrelaterade produkter. Ge teknisk support samt utföra felsökning inom relevanta områden. Obligatoriska kvalifikationer: Grundläggande erfarenhet av nätverkskomponenter som lastbalansering, brandväggar och nätverkssäkerhet. God förståelse för grundläggande nätverksprotokoll som TCP/IP, DNS etc. Erfarenhet av att arbeta med lastbalansering. Erfarenhet av att arbeta med F5 BIG-IP eller likvärdiga lösningar är mycket meriterande. Förmåga att hantera teknisk support, identifiera och felsöka nätverksrelaterade problem, samt säkerställa att applikationer och tjänster fungerar korrekt. God förmåga att skapa teknisk dokumentation och kommunicera på svenska, både i tal och skrift. Meriterande kvalifikationer: Erfarenhet som nätverkstekniker eller specialist inom IT-infrastruktur med bred förståelse för nätverk och säkerhet. Förmåga att arbeta med både interna och externa intressenter för att förstå och möta behov och krav på nätverkslösningar."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71975-projektledare-enhet-forandring-och-mojliggorande/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Göteborg",
      "Hybrid"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en engagerad, drivande och lyhörd projektledare med starka samarbetsförmågor, som samtidigt trivs med att arbeta självständigt. Arbetet sker både på plats hos vår kund och på distans. Vid resor mellan olika kontor föredras användning av kommunala färdmedel. B-körkort är ett krav. Huvudsakliga ansvarsområden: Driva och koordinera olika IT-projekt som beställs och initieras av kundens verksamheter. Hantera projekt med fokus på: Användarnära IT-infrastruktur. Fastighetstekniska system, där projektledaren ansvarar för IT-stödet som dessa system använder. Föra dialog med beställare för att tydliggöra krav och förväntningar inom ramen för beställningarna. Ansvara för genomförandet av både små och stora projekt med varierande komplexitet. Med stöd av etablerade arbetssätt och team driva projekten på ett professionellt sätt och ansvara för: Projektbudget Planering Uppföljning Dokumentation Hantera ett varierande antal projekt beroende på storlek och omfattning. De flesta uppdrag är IT-relaterade, men vissa projekt kan vara mer koordinerande eller av förändringsledande karaktär. Obligatoriska kvalifikationer: Minst 5 års erfarenhet som IT-projektledare (inom de senaste 10 åren). Gedigen och bred kunskap om användarnära IT-infrastruktur. Bred erfarenhet inom IT-infrastruktur. Mycket god erfarenhet av att leda virtuella kompetensteam. Utmärkt förmåga att dokumentera och presentera på svenska. Svenskt medborgarskap (krävs för säkerhetsklassning). Ett CV som beskriver erfarenheter inom relevanta områden. Meriterande kvalifikationer: Erfarenhet av arbete inom politiskt styrda organisationer. Erfarenhet av agila arbetssätt. Erfarenhet av stora och komplexa IT-miljöer. Erfarenhet inom hälso- och sjukvården eller medicintekniska system. Erfarenhet inom IT-infrastruktur och IT-säkerhetsarbete. Personliga egenskaper: Engagerad, drivande och lyhörd projektledare. Stark samarbetsförmåga. Trivs i en drivande roll och kan arbeta självständigt. Prestigelös och bekväm med att dela med sig av erfarenheter och idéer."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71961-senior-projektledare-forandring-och-mojliggorande/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Göteborg",
      "Hybrid"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en erfaren och driven senior Projektledare. Arbetet sker både på distans och från vår kunds lokaler. När resor mellan kontor krävs används främst kommunala transportmedel, och ett B-körkort är ett krav. Uppdraget gäller bemanning av deras projektet Slutdesign för kundens plattform (Hardware refresh). Obligatoriska kvalifikationer: Minst 5 års aktuell erfarenhet som IT-projektledare, inom de senaste 10 åren. Goda och breda kunskaper inom användarnära IT-infrastruktur. Gedigen förståelse för IT-infrastruktur i allmänhet. Dokumenterad erfarenhet av att leda virtuella kompetensteam med framgång. Mycket god förmåga att dokumentera och presentera på svenska. Svenskt medborgarskap krävs då säkerhetsklassning ingår. Ditt CV ska tydligt beskriva din erfarenhet inom relevanta områden. Meriterande kvalifikationer: Erfarenhet av arbete med specifika sektorer, såsom 5G. Erfarenhet av att arbeta inom politiskt styrda, större organisationer. Erfarenhet av att leda förändringsprojekt med ett agilt arbetssätt. Erfarenhet från komplexa och stora IT-miljöer. Personliga egenskaper: Du är en engagerad och drivande person som är lyhörd för andras behov. Samarbete är en av dina starka sidor, men du trivs också med att arbeta självständigt. Du är prestigelös och delar gärna med dig av dina erfarenheter och idéer. Förmåga att ta ansvar och självständigt driva projekt framåt."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71956-projektledare-51/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en engagerad och självgående Projektledare som har en stark förmåga att samarbeta med andra, men som även trivs med att arbeta självständigt. Du bör vara prestigelös och generös med att dela din kunskap och dina idéer. Arbetet utförs både på kontoret och på distans. Vid resor mellan olika kontor används i första hand kollektiva transportmedel. B-körkort är ett krav. En av vår kunds främsta digitaliseringsmål är att stötta verksamheterna i deras införskaffande och utveckling av IT-tjänster. Avdelningen för Infrastruktur och cybersäkerhet driver dessutom interna projekt och uppdrag som syftar till att följa den globala teknikutvecklingen. Vidare ansvarar de för att följa upp och kvalitetssäkra IT-leveranser inom projekt och uppdrag. Inom enheten Förändring och möjliggörande, som tillhör avdelningen Infrastruktur och cybersäkerhet, genomförs huvudsakligen projekt och uppdrag med teknisk inriktning. Organisationen är uppdelad i olika team som fokuserar på specifika kundgrupper. Ofta handlar det om utveckling och implementering av ny teknik inom infrastrukturområdet, där man använder kompetenser från linjeverksamheten och från olika leverantörskontakter. Obligatoriska kvalifikationer: Minst 5 års erfarenhet som IT-projektledare (ej äldre än 10 år). Bred och djup kunskap inom användarnära IT-infrastruktur. God kännedom om IT-infrastruktur. Gedigen erfarenhet av att leda virtuella kompetensteam. Mycket god förmåga att dokumentera och presentera på svenska. Självständig och drivande i din roll. Svenskt medborgarskap, då säkerhetsklassning krävs. CV som tydligt beskriver din erfarenhet inom relevanta områden. Meriterande kvalifikationer: Erfarenhet av IT-infrastruktur och IT-säkerhetsarbete. Erfarenhet från arbete i större organisationer med politisk styrning. Erfarenhet av att leda förändringsprocesser enligt agila metoder. Erfarenhet från stora, komplexa IT-miljöer. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71936-penetrationstestare-2/",
    "roles": [
      "Testare"
    ],
    "places": [
      "Uppsala"
    ],
    "description": [
      "Uppdragsbeskrivning Vi söker en konsult som kommer genomföra en begränsad greybox pentest som omfattar deras e-tjänst för analysbeställningar i form av delar som beslutas tillsammans med er som leverantör. Omfattningen av uppdraget är satt till ett takpris. Resultat från arbetet ska kunna användas för bedömning av status på e-tjänsternas säkerhetsåtgärder och prioritering av förvaltningsarbetet med e-tjänsterna. Uppdraget ska minst generera en rapport som beskriver nuläget och en aktivitetslista för att hantera avvikelser. Uppdraget ska genomföras under hösten 2024. Uppdraget ska vara slutrapporterat under 2024. Vår kund driftar sin egna It-miljö för e-tjänsterna. Vissa applikationer inom ramen för e-tjänsterna köps som tjänst. Antalet servrar är fördelat enligt följande; fyra test-servrar och fyra produktionsservrar."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71648-projektledare-implementation-av-logex-costing/",
    "roles": [
      "Projektledare"
    ],
    "places": [
      "Göteborg"
    ],
    "description": [
      "Uppdragsbeskrivning För kunds räkning söker vi nu en engagerad, drivande och lyhörd projektledare med en stark förmåga till samarbete. Du bör vara prestigelös och ha lätt för att lyssna på flera parter, men även kunna dela med dig av din erfarenhet och dina idéer. Huvudsakliga ansvarsområden: Projektet har tidigare överskridit fastställda tidplaner, vilket har lett till att vår kund nu befinner sig i en förändrad situation. Deras program för teknisk förvaltning planeras att tas i drift i november 2024. Därför omfattar uppdraget att: Säkerställa att kalkylverktyget samspelar med data från programmet. Säkerställa att data hanteras korrekt i kalkylverktyget. Säkerställa att utdata är tillfredsställande. Möjliggöra att den utdata som efterfrågas från olika plattformar görs tillgänglig. Uppdraget innebär att säkerställa implementationen av Logex Costing hos vår kund, med minst bibehållen funktionalitet. Detta omfattar bland annat: Teknisk installation. Sätta modeller för kalkylering avseende KPP (Kostnad Per Patient) och diagnostik (stödjande roll). Rigga datainläsningar från cirka 25 källor, inklusive kontroller. Implementera säkerhetshöjande åtgärder (skydda information, efterleva PDL). Genomlysning av rutiner, arbetssätt och förvaltning (stödjande roll). Utföra tester. Genomföra utbildning. Säkerställa utdata och rapportskapande (stödjande roll). Avveckla nuvarande applikationer. Obligatoriska kvalifikationer: Minst 5 års erfarenhet som projektledare för komplexa digitaliseringsprojekt. Erfarenhet av projekt inom uppsättning av modeller för kalkylering av kostnad per patient (KPP). Mycket god erfarenhet av att leda virtuella kompetensteam. Mycket god förmåga att dokumentera och presentera på både svenska och engelska. Förmåga att trivas i en drivande roll och arbeta självständigt. Svenskt medborgarskap, för att vid behov kunna säkerhetsklassas. Meriterande kvalifikationer: Mycket goda kunskaper om agila arbetssätt. Erfarenhet av projekt inom hälso- och sjukvårdssektorn. Erfarenhet av projekt där en extern leverantör vidareutvecklar produkten inom en agil förvaltningsorganisation, gärna enligt ramverket SAFe. Nedan finner du kravmatris för detta uppdrag. Vänligen ladda ner och fyll i denna samt bifoga tillsammans med CV i ansökan. Länk till kravmatris"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/71025-operational-technolgy/",
    "roles": [
      "Operational Technology"
    ],
    "places": [
      "Tomelilla"
    ],
    "description": [
      "Uppdragsbeskrivning: För kunds räkning söker vi nu en underkonsult med specialkompetens inom OT (Operational Technology) för att bistå ett kommunalt driftbolag inom vatten och avlopp (VA) med att granska och säkerställa att deras nya OT-design uppfyller kraven enligt NIS2-direktivet. Uppdraget innefattar även att säkerställa att designen möter de krav som Livsmedelsverket ställer på kommunala VA-bolag. Uppdraget kommer innebära vissa arbetsmoment på plats hos kundens lokaler kombinerat med arbete remote. Arbetsuppgifter: Granskning av OT-design utifrån ett säkerhets- och complianceperspektiv Identifiera eventuella brister eller riskområden i förhållande till NIS2-krav och Livsmedelsverkets riktlinjer för VA verksamhet Utarbeta förslag på förbättringar och säkerhetsåtgärder Arbeta nära vårt interna team som hanterar övergripande NIS2-krav och informationssäkerhetsledningssystem Delta i workshops och möten med VA-bolaget för att presentera fynd och rekommendationer Kompetenskrav: Erfarenhet av arbete med OT-system, särskilt inom vatten- och avloppssektorn Djup förståelse för SCADA-system, PLC-teknik och industriella kontrollsystem inom VA Erfarenhet av att designa, implementera och underhålla OT-nätverk Kännedom om Livsmedelsverkets krav och riktlinjer för kommunala VA-bolag &nbsp;"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70996-2-x-senior-software-engineer-region-skane-avrop-947/",
    "roles": [
      "Software Engineer"
    ],
    "places": [
      "Lund"
    ],
    "description": [
      "Uppdragsbeskrivning Region Skåne befinner sig på en spännande resa mot att bli en datadriven region. Avgörande för att utveckla vår hälso- och sjukvård inför framtiden är att stärka vår förmåga att tillvarata värdet av vår data. Genom att öka tillgängligheten till högkvalitativa data och utveckla verksamhetens kompetens att använda denna möjliggörs nya arbetssätt och metoder inom planering, forskning, resursoptimering och innovation. Därför söker vi nu en driven software engineer till vårt team av trevliga, samarbetsvilliga och kunniga kollegor som jobbar med utvecklingen av våra nya plattformar för data, API:er och AI. Vi söker dig som har en gedigen teknisk erfarenhet inom systemutveckling. Du har erfarenhet av komplexa utvecklingsprojekt, gärna open source. Du är nyfiken på att hela tiden lära dig nytt, som du gärna vill tillämpa och dela med dig av. Du är pragmatisk och har förmågan att skapa goda relationer med andra människor. Du är strukturerad, självgående och kvalitetsmedveten. Som software engineer tillhör du ett utvecklingsteam som bygger plattformar på den allra senaste tekniken inom datahantering, API:er och AI. Du arbetar tillsammans med bland annat produktägare, arkitekter, data engineers, full-stack utvecklare och testare. Arbetet innebär att: Arbeta med systemutveckling och implementation av exempelvis API:er och klassbibliotekr Supporta, förvalta och felsöka våra lösningar Delta i planering och analys av funktioner Utveckla och testa komponenter Skriva enhetstester Utveckla ci/cd pipelines Granska kod Omstrukturera kod Ge råd och stöd i tekniska designval och arkitekturfrågor Du har: Gedigen och bred erfarenhet av utveckling i .NET och C#, samt gärna fler programmeringsspråk God kunskap inom API design och utveckling God kunskap om SQL-databaser och utveckling av stored procedures God kunskap om prestandafrågor God kunskap om säkerhetsfrågor och rekommendationer från exempelvis OWASP Gedigen erfarenhet av att arbeta med Git Du har förmågan att arbeta både självständigt och i grupp Du är van vid att ta ansvar för och äga leveransen av en eller flera funktion(er) Du är mån om att leverera kvalitativa lösningar Du har erfarenhet av att arbeta agilt Meriterande: Erfarenhet av att drifta lösningar on-prem och i public cloud (Docker/Kubernetes/Azure) Certifieringar inom Docker/Kubernetes/Azure God erfarenhet av Infrastructure as Code (t.ex. Bicep eller Terraform) God kunskap om Event/Message brokers såsom exempelvis RabbitMQ, Kafka eller Azure Service Bus Goda kunskaper inom teknisk dokumentation Erfarenhet eller intresse av Data Engineering-domänen Tillhör kategori: Systemutvecklare Startdatum och omfattning är öppet för diskussion. Möjlighet finns till förlängning av uppdraget. &nbsp;"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70993-senior-full-stack-utvecklare-region-skane-avrop-946/",
    "roles": [
      "Fullstack-utvecklare"
    ],
    "places": [
      "Lund"
    ],
    "description": [
      "Uppdragsbeskrivning Region Skåne befinner sig på en spännande resa mot att bli en datadriven region. Avgörande för att utveckla vår hälso- och sjukvård inför framtiden är att stärka vår förmåga att tillvarata värdet av vår data. Genom att öka tillgängligheten till högkvalitativa data och utveckla verksamhetens kompetens att använda denna möjliggörs nya arbetssätt och metoder inom planering, forskning, resursoptimering och innovation. Därför söker vi nu en driven full-stack utvecklare till vårt team av trevliga, samarbetsvilliga och kunniga kollegor som jobbar med utvecklingen av våra nya data- och API-plattformar. Vi söker dig som har en gedigen teknisk erfarenhet inom systemutveckling. Du har erfarenhet av såväl modern webbutveckling som backend och API-utveckling. Du är nyfiken på att hela tiden lära dig nytt, som du gärna vill tillämpa och dela med dig av. Du är pragmatisk och har förmågan att skapa goda relationer med andra människor. Du är strukturerad, självgående och kvalitetsmedveten. Som full-Stack utvecklare tillhör du ett utvecklingsteam som bygger plattformar på den allra senaste tekniken inom datahantering, API:er och AI. Du arbetar tillsammans med bland annat produktägare, arkitekter, data engineers, software engineers och testare. Arbetet innebär att: Arbeta med utveckling inom både frontend och backend Supporta, förvalta och felsöka våra lösningar Delta i planering och analys av funktioner Utveckla ci/cd pipelines Granska kod Bedriva testarbete och skriva enhetstester Ge råd och stöd i tekniska designval och arkitekturfrågor Du har: Gedigen erfarenhet av utveckling både inom frontend och backend God kunskap om TypeScript/Javascript, HTML5, CSS3, Tailwind, jQuery och Bootstrap God kunskap om .NET och C#, samt gärna fler programmeringsspråk Erfarenhet av moderna frontend-ramverk som t.ex. NextJS, Nuxt, SvelteKit God kunskap om Single Page Applications, Jamstack och static site generators God kunskap inom API design och utveckling God kunskap om SQL-databaser God kunskap om säkerhetsfrågor och rekommendationer från exempelvis OWASP Gedigen erfarenhet av att arbeta med Git Känsla för design och UX Du har förmågan att arbeta både självständigt och i grupp Du är van vid att ta ansvar för och äga leveransen av en eller flera funktion(er) Du är mån om att leverera kvalitativa lösningar Du har erfarenhet av att arbeta agilt Meriterande: Goda kunskaper inom tillgänglighet (WCAG) Goda kunskaper i Docker/Kubernetes Erfarenhet av att drifta lösningar on-prem och i public cloud (Docker/Kubernetes/Azure) Erfarenhet av Infrastructure as Code (t.ex. Bicep eller Terraform) Erfarenhet inom Prompt Engineering Goda kunskaper inom teknisk dokumentation &nbsp; Tillhör kategori: Systemutvecklare &nbsp; Startdatum och omfattning är öppet för diskussion. Möjlighet finns till förlängning av uppdraget. &nbsp;"
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/70972-senior-dataarkitekt-data-engineer-region-skane-avrop-945/",
    "roles": [
      "Data Engineer"
    ],
    "places": [
      "Lund"
    ],
    "description": [
      "Uppdragsbeskrivning Region Skåne befinner sig på en spännande resa mot att bli en datadriven region. Avgörande för att utveckla vår hälso- och sjukvård inför framtiden är att stärka vår förmåga att tillvarata värdet av vår data. Genom att öka tillgängligheten till högkvalitativa data och utveckla verksamhetens kompetens att använda denna möjliggörs nya arbetssätt och metoder inom planering, forskning, resursoptimering och innovation. Därför söker vi nu en driven dataarkitekt/data engineer till vårt team av trevliga, samarbetsvilliga och kunniga kollegor som jobbar med utvecklingen av våra nya plattformar för data, API:er och AI. Vi söker dig som har en gedigen praktisk erfarenhet inom dataplattformar / Data Management. Du har erfarenhet av hela kedjan från kravinsamling till implementation och test. Du är nyfiken på att hela tiden lära dig nytt, som du gärna vill tillämpa och dela med dig av. Du är pragmatisk och har förmågan att skapa goda relationer med andra människor. Du är strukturerad, självgående och kvalitetsmedveten. Som dataarkitekt/data engineer tillhör du ett centralt utvecklingsteam som bygger plattformar på den allra senaste tekniken inom datahantering, API:er och AI. Du arbetar tillsammans med andra data engineers, produktägare, systemutvecklare, testare och andra arkitekter. Vår dataplattform skall kunna hantera flera Petabyte med data för Business Intelligence, avancerad analys och AI med mycket hög prestanda. Arbetet innebär att: Ansvara för design av delar av vår nya data- och analysplattform Delta i planeringen av färdplan för våra plattformar Samla in krav och önskemål från användare och andra intressenter Beskriva features och user stories för vår backlog Utvärdera och förslå lösningar på krav och önskemål Supporta, förvalta och felsöka våra lösningar Stödja data engineers och andra utvecklare Aktivt delta i implementationsarbetet Dokumentera arkitekturen och lösningarna Utveckla och beskriva säkerhetsåtgärder för våra plattformar Planera och driva arbete med test av våra plattformar Ge råd och stöd i tekniska designval och arkitekturfrågor Du har: Mycket god kunskap om arkitektur och design av datalager, datasjöar och data lakehouses. Mycket god kunskap om Microsoft SQL Server / Azure SQL databaser och T-SQL. Mycket god kunskap om ETL-utveckling. God kunskap om Business Intelligence. God kunskap om informationssäkerhet. God kunskap om utveckling i C#. God praktisk erfarenhet av att etablera och implementera datalösningar. Du har en gedigen bakgrund inom data warehousing och har gjort resan till molnet. God förmåga att förstå verksamhetens behov. God pedagogisk förmåga att beskriva och presentera lösningsarkitektur, både muntligen och skriftligen. Meriterande: Erfarenhet av Databricks, Microsoft Fabric, Azure Synapse och Power BI. Erfarenhet av Biml eller andra automatiseringslösningar. Erfarenhet av DBT. Erfarenhet av att etablera plattformar från grunden. Erfarenhet av AI, Machine Learning och avancerad analys. Erfarenhet av Data Governance. Erfarenhet av Master Data Management och Data Quality Management. Erfarenhet av att jobba enligt Data Mesh, Data Fabric och DataOps. Erfarenhet av medallion-arkitektur. Erfarenhet av utveckling i Python. Erfarenhet av hälso- och sjukvårdsverksamhet. Relevanta certifieringar inom exempelvis Azure. Tillhör kategori: Systemarkitekt &nbsp; Startdatum och omfattning är öppet för diskussion. Möjlighet finns till förlängning av uppdraget."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69904-pki-specialist/",
    "roles": [
      "PKI Specialist"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Ansvarsområden: Granska och utvärdera befintlig Microsoft-baserad PKI-lösning samt identifiera förbättringsområden. Samarbeta med infrastrukturleverantören för att bedöma och implementera föreslagna förändringar. Designa och strukturera en hållbar certifikatsinfrastruktur som möter företagets nuvarande och framtida behov. Leda projekt för att modernisera och implementera PKI-lösningar, från analys till drift. Säkerställa att interna team får rätt vägledning och kunskapsstöd för att långsiktigt hantera och underhålla den nya infrastrukturen. &nbsp; Vi söker dig som har: Gedigen erfarenhet av att implementera PKI-lösningar på flertalet företag. Erfarenhet av att arbeta med certifikathantering och certifikatstrukturer. God kunskap om Microsoft PKI-lösningar och infrastruktur. Förmåga att bedöma tekniska lösningsförslag och leda moderniseringsprojekt inom IT-säkerhet. Starka kommunikations- och samarbetsförmågor – du kommer att agera expert och stöd till både interna team och externa leverantörer."
    ]
  },
  {
    "link_to_assignment": "https://upgraded.se/konsultuppdrag/69631-avtalscontroller-samhallsutvecklingsforvaltningen/",
    "roles": [
      "Avtalscontroller",
      "Controller"
    ],
    "places": [
      "Stockholm"
    ],
    "description": [
      "Uppdragsbeskrivning Avropet omfattar en (1) resurskonsult till 100 % av en heltidstjänst för utförande av beskrivet uppdrag (160 timmar per månad), under 12 månader, därefter med option att justera till en 50% tjänst i dialog mellan beställare och leverantör. Uppdraget förväntas pågå enligt nedan angiven kontraktstid men med uppsägningstid på 2 månader för beställaren. Uppdraget som avtalscontroller handlar om att koordinera och leda SUFs (Samhällsutvecklingsförvaltningen) arbete med avtal, i detta ingår löpande förvaltning och uppföljning av tilldelade avtal. Analysera genomförda upphandlingar för att hitta förbättringsområden samt bidra till utvärderingsprocessen vid pågående upphandlingar. Förväntat resultat Genomföra utredningar av leverantörer och säkerställa att de under avtalsperioden uppfyller t ex. kreditvärdighet, försäkringskrav och i avtalet överenskomna nivåer. Utifrån interna kontrollrutiner genomförs årligen stickprovskontroller på ingångna avtal mot en på förhand framtagen checklista. Leda och vara kallande i entreprenadupphandlingsrådet som samlar förvaltningens avdelningar. Vidare innefattar tjänsten att säkerställa att samtliga krav i avtalen uppfylls och att rutiner och processer internt på förvaltningen följs och att avvikelser hanteras på rätt sätt. Stötta vid uppföljnings- och driftsmöten. Ansvarig för indexering av ramavtal samt vår interna avtalsdatabas. Säkerställa att aktiva beslut om avtal tas av avtalsägaren, säga upp eller förlänga enligt respektive avtalsperiod. Vara ett stöd till avdelningarna vid direktupphandlingar och avrop från befintliga avtal. Stötta avtalsägare och avtalsförvaltare med frågeställningar med anledning av upphandlingar och tecknade avtal. Projektorganisation Konsulten rapporterar till administrativa chefen SUF. Säkerhetskrav Om konsult anser att uppgift(er) i offert omfattas av sekretess ska detta anges med utförlig motivering i offerten. I annat fall förutsätts att anledning till sekretess saknas. Uppgifter som anses sekretessbelagda kan med fördel lämnas i separata bilagor. Hantering av personuppgifter Sedvanliga personuppgifter som finns i avtal och inom en förvaltning vid kommunikation internt och externt, inga känsliga eller säkerhetsskyddade personuppgifter eller uppgifter kommer att hanteras. Handlingar som ska ingå i offert: &#8211; CV &#8211; Referensförteckning &#8211; Pris Skallkrav Relevant högskoleutbildning: Konsulten ska inneha en examen från högskola eller universitet inom områden som ekonomi, juridik, offentlig förvaltning eller annan relevant utbildning kopplad till avtalsförvaltning och upphandling Minst 1-3 års erfarenhet av liknande arbetsuppgifter: Konsulten ska ha arbetat som avtalscontroller, upphandlare eller liknande roll i minst 1-3 år. Under denna tid ska konsulten ha genomfört ett flertal uppdrag som innefattar avtalsuppföljning, upphandlingar och avtalsförvaltning Erfarenhet av uppföljning och förvaltning av avtal: Konsulten ska ha dokumenterad erfarenhet av att följa upp ingångna avtal, inklusive att säkerställa leverantörers efterlevnad av avtalade krav samt hantera eventuella avvikelser och förlängningar av avtal Kunskap om Lagen om offentlig upphandling (LOU): Konsulten ska ha goda kunskaper i LOU och kunna tillämpa denna lag i sitt dagliga arbete Erfarenhet av avtalsdatabas och system för avtalsadministration: Konsulten ska ha erfarenhet av att arbeta i TendSign och Kommers Börkrav Meriterande med utbildning inom upphandling eller avtalsrätt Meriterande med specifik utbildning eller kurser inom offentlig upphandling (LOU), avtalsrätt eller motsvarande Meriterande med certifieringar inom upphandlings- och avtalsområdet, såsom CIPS (Certified International Procurement Professional) eller liknande, är önskvärda men ej obligatoriska Meriterande med erfarenhet av offentlig sektor: Erfarenhet av arbete inom offentlig sektor [&hellip;]"
    ]
  }
]